#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x3C7 (0x3C8 - 0x1)
// ScriptStruct BaseHumanAnimBP.BaseHumanAnimBP_C.AnimBlueprintGeneratedConstantData
struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                        Pad_46EB[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                __ArrayProperty_3489;                              // 0x8(0x10)(AutoWeak, AssetRegistrySearchable, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	enum class EAlphaBlendOption                 __EnumProperty_3490;                               // 0x18(0x1)(None)
	uint8                                        Pad_46EC[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                __ArrayProperty_3491;                              // 0x20(0x10)(AutoWeak, ContainsInstancedReference, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<float>                                __ArrayProperty_3492;                              // 0x30(0x10)(TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<float>                                __ArrayProperty_3493;                              // 0x40(0x10)(AutoWeak, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	enum class EAlphaBlendOption                 __EnumProperty_3494;                               // 0x50(0x1)(None)
	enum class EBlendListTransitionType          __EnumProperty_3495;                               // 0x51(0x1)(None)
	uint8                                        Pad_46ED[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                __ArrayProperty_3496;                              // 0x58(0x10)(AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, BlueprintAuthorityOnly, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<float>                                __ArrayProperty_3497;                              // 0x68(0x10)(AutoWeak, SimpleDisplay, AdvancedDisplay, BlueprintAuthorityOnly, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<float>                                __ArrayProperty_3498;                              // 0x78(0x10)(ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, BlueprintAuthorityOnly, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	class FName                                  __NameProperty_3499;                               // 0x88(0x8)(None)
	struct FAnimNodeFunctionRef                  __StructProperty_3500;                             // 0x90(0x20)(ZeroConstructor)
	struct FAnimNodeFunctionRef                  __StructProperty_3501;                             // 0xB0(0x20)(ZeroConstructor)
	class FName                                  __NameProperty_3502;                               // 0xD0(0x8)(None)
	class UAnimSequenceBase*                     __AnimSequenceBase_3503;                           // 0xD8(0x8)(ZeroConstructor)
	class UAnimSequenceBase*                     __AnimSequenceBase_3504;                           // 0xE0(0x8)(ZeroConstructor)
	class UAnimSequenceBase*                     __AnimSequenceBase_3505;                           // 0xE8(0x8)(ZeroConstructor)
	class UAnimSequenceBase*                     __AnimSequenceBase_3506;                           // 0xF0(0x8)(ZeroConstructor)
	class UAnimSequenceBase*                     __AnimSequenceBase_3507;                           // 0xF8(0x8)(ZeroConstructor)
	class FName                                  __NameProperty_3508;                               // 0x100(0x8)(None)
	TArray<float>                                __ArrayProperty_3509;                              // 0x108(0x10)(AssetRegistrySearchable, AdvancedDisplay, BlueprintAuthorityOnly, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<float>                                __ArrayProperty_3510;                              // 0x118(0x10)(AutoWeak, AdvancedDisplay, BlueprintAuthorityOnly, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<float>                                __ArrayProperty_3511;                              // 0x128(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, BlueprintAuthorityOnly, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<float>                                __ArrayProperty_3512;                              // 0x138(0x10)(AssetRegistrySearchable, SimpleDisplay, BlueprintAuthorityOnly, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<float>                                __ArrayProperty_3513;                              // 0x148(0x10)(ContainsInstancedReference, SimpleDisplay, BlueprintAuthorityOnly, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<float>                                __ArrayProperty_3514;                              // 0x158(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, BlueprintAuthorityOnly, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<float>                                __ArrayProperty_3515;                              // 0x168(0x10)(AutoWeak, AssetRegistrySearchable, BlueprintAuthorityOnly, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<float>                                __ArrayProperty_3516;                              // 0x178(0x10)(ContainsInstancedReference, BlueprintAuthorityOnly, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<float>                                __ArrayProperty_3517;                              // 0x188(0x10)(BlueprintAuthorityOnly, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<float>                                __ArrayProperty_3518;                              // 0x198(0x10)(AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	class FName                                  __NameProperty_3519;                               // 0x1A8(0x8)(None)
	int32                                        __IntProperty_3520;                                // 0x1B0(0x4)(None)
	class FName                                  __NameProperty_3521;                               // 0x1B4(0x8)(None)
	int32                                        __IntProperty_3522;                                // 0x1BC(0x4)(None)
	class FName                                  __NameProperty_3523;                               // 0x1C0(0x8)(None)
	int32                                        __IntProperty_3524;                                // 0x1C8(0x4)(None)
	enum class EAnimSyncMethod                   __EnumProperty_3525;                               // 0x1CC(0x1)(None)
	uint8                                        Pad_46EE[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  __NameProperty_3526;                               // 0x1D0(0x8)(None)
	class FName                                  __NameProperty_3527;                               // 0x1D8(0x8)(None)
	int32                                        __IntProperty_3528;                                // 0x1E0(0x4)(None)
	uint8                                        Pad_46EF[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                __ArrayProperty_3529;                              // 0x1E8(0x10)(SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<float>                                __ArrayProperty_3530;                              // 0x1F8(0x10)(ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, Protected, BlueprintCallable, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<int32>                                __ArrayProperty_3531;                              // 0x208(0x10)(AutoWeak, SimpleDisplay, Protected, BlueprintCallable, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FInputScaleBiasClampConstants         __StructProperty_3532;                             // 0x218(0x2C)(None)
	class FName                                  __NameProperty_3533;                               // 0x244(0x8)(None)
	float                                        __FloatProperty_3534;                              // 0x24C(0x4)(None)
	enum class ESequenceEvalReinit               __ByteProperty_3535;                               // 0x250(0x1)(None)
	bool                                         __BoolProperty_3536;                               // 0x251(0x1)(None)
	uint8                                        Pad_46F0[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        __FloatProperty_3537;                              // 0x254(0x4)(None)
	enum class EAnimSyncMethod                   __EnumProperty_3538;                               // 0x258(0x1)(None)
	enum class EAnimGroupRole                    __ByteProperty_3539;                               // 0x259(0x1)(None)
	uint8                                        Pad_46F1[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  __NameProperty_3540;                               // 0x25C(0x8)(None)
	enum class EAlphaBlendOption                 __EnumProperty_3541;                               // 0x264(0x1)(None)
	uint8                                        Pad_46F2[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UBlendProfile*                         __BlendProfile_3542;                               // 0x268(0x8)(ZeroConstructor)
	class UCurveFloat*                           __CurveFloat_3543;                                 // 0x270(0x8)(ZeroConstructor)
	bool                                         __BoolProperty_3544;                               // 0x278(0x1)(None)
	enum class EAlphaBlendOption                 __EnumProperty_3545;                               // 0x279(0x1)(None)
	enum class EBlendListTransitionType          __EnumProperty_3546;                               // 0x27A(0x1)(None)
	uint8                                        Pad_46F3[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                __ArrayProperty_3547;                              // 0x280(0x10)(AssetRegistrySearchable, Protected, BlueprintCallable, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAnimNodeFunctionRef                  __StructProperty_3548;                             // 0x290(0x20)(ZeroConstructor)
	struct FAnimSubsystem_Tag                    AnimBlueprintExtension_Tag;                        // 0x2B0(0x60)(ContainsInstancedReference, Protected, BlueprintCallable, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAnimSubsystem_PropertyAccess         AnimBlueprintExtension_PropertyAccess;             // 0x310(0x80)(ZeroConstructor, Protected, BlueprintCallable, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAnimSubsystem                        AnimBlueprintExtension_NodeRelevancy;              // 0x390(0x8)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, BlueprintCallable, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAnimSubsystem_BlendSpaceGraph        AnimBlueprintExtension_BlendSpaceGraph;            // 0x398(0x18)(ZeroConstructor, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, BlueprintCallable, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAnimSubsystem_Base                   AnimBlueprintExtension_Base;                       // 0x3B0(0x18)(None)
};

// 0x2F9 (0x2FA - 0x1)
// ScriptStruct BaseHumanAnimBP.BaseHumanAnimBP_C.AnimBlueprintGeneratedMutableData
struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
public:
	uint8                                        Pad_46F4[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        __FloatProperty;                                   // 0x4(0x4)(None)
	bool                                         __BoolProperty_0;                                  // 0x8(0x1)(None)
	bool                                         __BoolProperty_1;                                  // 0x9(0x1)(None)
	bool                                         __BoolProperty_2;                                  // 0xA(0x1)(None)
	uint8                                        Pad_46F5[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        __FloatProperty_3;                                 // 0xC(0x4)(None)
	bool                                         __BoolProperty_4;                                  // 0x10(0x1)(None)
	uint8                                        Pad_46F6[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        __FloatProperty_5;                                 // 0x14(0x4)(None)
	bool                                         __BoolProperty_6;                                  // 0x18(0x1)(None)
	bool                                         __BoolProperty_7;                                  // 0x19(0x1)(None)
	uint8                                        Pad_46F7[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        __FloatProperty_8;                                 // 0x1C(0x4)(None)
	float                                        __FloatProperty_9;                                 // 0x20(0x4)(None)
	bool                                         __BoolProperty_10;                                 // 0x24(0x1)(None)
	uint8                                        Pad_46F8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        __IntProperty_11;                                  // 0x28(0x4)(None)
	float                                        __FloatProperty_12;                                // 0x2C(0x4)(None)
	bool                                         __BoolProperty_13;                                 // 0x30(0x1)(None)
	bool                                         __BoolProperty_14;                                 // 0x31(0x1)(None)
	bool                                         __BoolProperty_15;                                 // 0x32(0x1)(None)
	bool                                         __BoolProperty_16;                                 // 0x33(0x1)(None)
	float                                        __FloatProperty_17;                                // 0x34(0x4)(None)
	TArray<float>                                __ArrayProperty_18;                                // 0x38(0x10)(AssetRegistrySearchable, Protected, BlueprintCallable, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         __BoolProperty_19;                                 // 0x48(0x1)(None)
	uint8                                        Pad_46F9[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                __ArrayProperty_20;                                // 0x50(0x10)(None)
	bool                                         __BoolProperty_21;                                 // 0x60(0x1)(None)
	bool                                         __BoolProperty_22;                                 // 0x61(0x1)(None)
	bool                                         __BoolProperty_23;                                 // 0x62(0x1)(None)
	bool                                         __BoolProperty_24;                                 // 0x63(0x1)(None)
	bool                                         __BoolProperty_25;                                 // 0x64(0x1)(None)
	bool                                         __BoolProperty_26;                                 // 0x65(0x1)(None)
	bool                                         __BoolProperty_27;                                 // 0x66(0x1)(None)
	bool                                         __BoolProperty_28;                                 // 0x67(0x1)(None)
	bool                                         __BoolProperty_29;                                 // 0x68(0x1)(None)
	uint8                                        Pad_46FA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        __FloatProperty_30;                                // 0x6C(0x4)(None)
	float                                        __FloatProperty_31;                                // 0x70(0x4)(None)
	float                                        __FloatProperty_32;                                // 0x74(0x4)(None)
	float                                        __FloatProperty_33;                                // 0x78(0x4)(None)
	bool                                         __BoolProperty_34;                                 // 0x7C(0x1)(None)
	bool                                         __BoolProperty_35;                                 // 0x7D(0x1)(None)
	bool                                         __BoolProperty_36;                                 // 0x7E(0x1)(None)
	bool                                         __BoolProperty_37;                                 // 0x7F(0x1)(None)
	float                                        __FloatProperty_38;                                // 0x80(0x4)(None)
	float                                        __FloatProperty_39;                                // 0x84(0x4)(None)
	float                                        __FloatProperty_40;                                // 0x88(0x4)(None)
	bool                                         __BoolProperty_41;                                 // 0x8C(0x1)(None)
	uint8                                        Pad_46FB[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        __IntProperty_42;                                  // 0x90(0x4)(None)
	bool                                         __BoolProperty_43;                                 // 0x94(0x1)(None)
	bool                                         __BoolProperty_44;                                 // 0x95(0x1)(None)
	bool                                         __BoolProperty_45;                                 // 0x96(0x1)(None)
	uint8                                        Pad_46FC[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        __FloatProperty_46;                                // 0x98(0x4)(None)
	float                                        __FloatProperty_47;                                // 0x9C(0x4)(None)
	bool                                         __BoolProperty_48;                                 // 0xA0(0x1)(None)
	uint8                                        Pad_46FD[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        __FloatProperty_49;                                // 0xA4(0x4)(None)
	bool                                         __BoolProperty_50;                                 // 0xA8(0x1)(None)
	uint8                                        Pad_46FE[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimSequenceBase*                     __AnimSequenceBase_51;                             // 0xB0(0x8)(ZeroConstructor)
	class UAnimSequenceBase*                     __AnimSequenceBase_52;                             // 0xB8(0x8)(ZeroConstructor)
	float                                        __FloatProperty_53;                                // 0xC0(0x4)(None)
	uint8                                        Pad_46FF[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimSequenceBase*                     __AnimSequenceBase_54;                             // 0xC8(0x8)(ZeroConstructor)
	bool                                         __BoolProperty_55;                                 // 0xD0(0x1)(None)
	uint8                                        Pad_4700[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        __FloatProperty_56;                                // 0xD4(0x4)(None)
	float                                        __FloatProperty_57;                                // 0xD8(0x4)(None)
	bool                                         __BoolProperty_58;                                 // 0xDC(0x1)(None)
	uint8                                        Pad_4701[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        __FloatProperty_59;                                // 0xE0(0x4)(None)
	float                                        __FloatProperty_60;                                // 0xE4(0x4)(None)
	float                                        __FloatProperty_61;                                // 0xE8(0x4)(None)
	bool                                         __BoolProperty_62;                                 // 0xEC(0x1)(None)
	uint8                                        Pad_4702[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        __FloatProperty_63;                                // 0xF0(0x4)(None)
	float                                        __FloatProperty_64;                                // 0xF4(0x4)(None)
	bool                                         __BoolProperty_65;                                 // 0xF8(0x1)(None)
	uint8                                        Pad_4703[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        __FloatProperty_66;                                // 0xFC(0x4)(None)
	bool                                         __BoolProperty_67;                                 // 0x100(0x1)(None)
	uint8                                        Pad_4704[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        __FloatProperty_68;                                // 0x104(0x4)(None)
	bool                                         __BoolProperty_69;                                 // 0x108(0x1)(None)
	bool                                         __BoolProperty_70;                                 // 0x109(0x1)(None)
	bool                                         __BoolProperty_71;                                 // 0x10A(0x1)(None)
	bool                                         __BoolProperty_72;                                 // 0x10B(0x1)(None)
	float                                        __FloatProperty_73;                                // 0x10C(0x4)(None)
	bool                                         __BoolProperty_74;                                 // 0x110(0x1)(None)
	bool                                         __BoolProperty_75;                                 // 0x111(0x1)(None)
	bool                                         __BoolProperty_76;                                 // 0x112(0x1)(None)
	bool                                         __BoolProperty_77;                                 // 0x113(0x1)(None)
	float                                        __FloatProperty_78;                                // 0x114(0x4)(None)
	float                                        __FloatProperty_79;                                // 0x118(0x4)(None)
	bool                                         __BoolProperty_80;                                 // 0x11C(0x1)(None)
	bool                                         __BoolProperty_81;                                 // 0x11D(0x1)(None)
	bool                                         __BoolProperty_82;                                 // 0x11E(0x1)(None)
	uint8                                        Pad_4705[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimSequenceBase*                     __AnimSequenceBase_83;                             // 0x120(0x8)(ZeroConstructor)
	bool                                         __BoolProperty_84;                                 // 0x128(0x1)(None)
	bool                                         __BoolProperty_85;                                 // 0x129(0x1)(None)
	uint8                                        Pad_4706[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimSequenceBase*                     __AnimSequenceBase_86;                             // 0x130(0x8)(ZeroConstructor)
	bool                                         __BoolProperty_87;                                 // 0x138(0x1)(None)
	bool                                         __BoolProperty_88;                                 // 0x139(0x1)(None)
	bool                                         __BoolProperty_89;                                 // 0x13A(0x1)(None)
	uint8                                        Pad_4707[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimSequenceBase*                     __AnimSequenceBase_90;                             // 0x140(0x8)(ZeroConstructor)
	bool                                         __BoolProperty_91;                                 // 0x148(0x1)(None)
	bool                                         __BoolProperty_92;                                 // 0x149(0x1)(None)
	bool                                         __BoolProperty_93;                                 // 0x14A(0x1)(None)
	bool                                         __BoolProperty_94;                                 // 0x14B(0x1)(None)
	bool                                         __BoolProperty_95;                                 // 0x14C(0x1)(None)
	bool                                         __BoolProperty_96;                                 // 0x14D(0x1)(None)
	uint8                                        __ByteProperty_97;                                 // 0x14E(0x1)(None)
	bool                                         __BoolProperty_98;                                 // 0x14F(0x1)(None)
	bool                                         __BoolProperty_99;                                 // 0x150(0x1)(None)
	bool                                         __BoolProperty_100;                                // 0x151(0x1)(None)
	bool                                         __BoolProperty_101;                                // 0x152(0x1)(None)
	uint8                                        Pad_4708[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimSequenceBase*                     __AnimSequenceBase_102;                            // 0x158(0x8)(ZeroConstructor)
	bool                                         __BoolProperty_103;                                // 0x160(0x1)(None)
	uint8                                        Pad_4709[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimSequenceBase*                     __AnimSequenceBase_104;                            // 0x168(0x8)(ZeroConstructor)
	bool                                         __BoolProperty_105;                                // 0x170(0x1)(None)
	uint8                                        Pad_470A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimSequenceBase*                     __AnimSequenceBase_106;                            // 0x178(0x8)(ZeroConstructor)
	float                                        __FloatProperty_107;                               // 0x180(0x4)(None)
	float                                        __FloatProperty_108;                               // 0x184(0x4)(None)
	bool                                         __BoolProperty_109;                                // 0x188(0x1)(None)
	uint8                                        Pad_470B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        __FloatProperty_110;                               // 0x18C(0x4)(None)
	float                                        __FloatProperty_111;                               // 0x190(0x4)(None)
	bool                                         __BoolProperty_112;                                // 0x194(0x1)(None)
	bool                                         __BoolProperty_113;                                // 0x195(0x1)(None)
	uint8                                        Pad_470C[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimSequenceBase*                     __AnimSequenceBase_114;                            // 0x198(0x8)(ZeroConstructor)
	class UAnimSequenceBase*                     __AnimSequenceBase_115;                            // 0x1A0(0x8)(ZeroConstructor)
	class UAnimSequenceBase*                     __AnimSequenceBase_116;                            // 0x1A8(0x8)(ZeroConstructor)
	bool                                         __BoolProperty_117;                                // 0x1B0(0x1)(None)
	uint8                                        Pad_470D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimSequenceBase*                     __AnimSequenceBase_118;                            // 0x1B8(0x8)(ZeroConstructor)
	class UAnimSequenceBase*                     __AnimSequenceBase_119;                            // 0x1C0(0x8)(ZeroConstructor)
	bool                                         __BoolProperty_120;                                // 0x1C8(0x1)(None)
	uint8                                        Pad_470E[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimSequenceBase*                     __AnimSequenceBase_121;                            // 0x1D0(0x8)(ZeroConstructor)
	class UAnimSequenceBase*                     __AnimSequenceBase_122;                            // 0x1D8(0x8)(ZeroConstructor)
	bool                                         __BoolProperty_123;                                // 0x1E0(0x1)(None)
	uint8                                        Pad_470F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimSequenceBase*                     __AnimSequenceBase_124;                            // 0x1E8(0x8)(ZeroConstructor)
	class UAnimSequenceBase*                     __AnimSequenceBase_125;                            // 0x1F0(0x8)(ZeroConstructor)
	class UAnimSequenceBase*                     __AnimSequenceBase_126;                            // 0x1F8(0x8)(ZeroConstructor)
	bool                                         __BoolProperty_127;                                // 0x200(0x1)(None)
	bool                                         __BoolProperty_128;                                // 0x201(0x1)(None)
	bool                                         __BoolProperty_129;                                // 0x202(0x1)(None)
	uint8                                        Pad_4710[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimSequenceBase*                     __AnimSequenceBase_130;                            // 0x208(0x8)(ZeroConstructor)
	class UAnimSequenceBase*                     __AnimSequenceBase_131;                            // 0x210(0x8)(ZeroConstructor)
	bool                                         __BoolProperty_132;                                // 0x218(0x1)(None)
	uint8                                        Pad_4711[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimSequenceBase*                     __AnimSequenceBase_133;                            // 0x220(0x8)(ZeroConstructor)
	bool                                         __BoolProperty_134;                                // 0x228(0x1)(None)
	bool                                         __BoolProperty_135;                                // 0x229(0x1)(None)
	uint8                                        Pad_4712[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimSequenceBase*                     __AnimSequenceBase_136;                            // 0x230(0x8)(ZeroConstructor)
	class UAnimSequenceBase*                     __AnimSequenceBase_137;                            // 0x238(0x8)(ZeroConstructor)
	bool                                         __BoolProperty_138;                                // 0x240(0x1)(None)
	uint8                                        Pad_4713[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimSequenceBase*                     __AnimSequenceBase_139;                            // 0x248(0x8)(ZeroConstructor)
	bool                                         __BoolProperty_140;                                // 0x250(0x1)(None)
	uint8                                        Pad_4714[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimSequenceBase*                     __AnimSequenceBase_141;                            // 0x258(0x8)(ZeroConstructor)
	bool                                         __BoolProperty_142;                                // 0x260(0x1)(None)
	uint8                                        Pad_4715[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimSequenceBase*                     __AnimSequenceBase_143;                            // 0x268(0x8)(ZeroConstructor)
	bool                                         __BoolProperty_144;                                // 0x270(0x1)(None)
	bool                                         __BoolProperty_145;                                // 0x271(0x1)(None)
	uint8                                        Pad_4716[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimSequenceBase*                     __AnimSequenceBase_146;                            // 0x278(0x8)(ZeroConstructor)
	bool                                         __BoolProperty_147;                                // 0x280(0x1)(None)
	bool                                         __BoolProperty_148;                                // 0x281(0x1)(None)
	bool                                         __BoolProperty_149;                                // 0x282(0x1)(None)
	bool                                         __BoolProperty_150;                                // 0x283(0x1)(None)
	uint8                                        Pad_4717[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimSequenceBase*                     __AnimSequenceBase_151;                            // 0x288(0x8)(ZeroConstructor)
	class UAnimSequenceBase*                     __AnimSequenceBase_152;                            // 0x290(0x8)(ZeroConstructor)
	bool                                         __BoolProperty_153;                                // 0x298(0x1)(None)
	bool                                         __BoolProperty_154;                                // 0x299(0x1)(None)
	bool                                         __BoolProperty_155;                                // 0x29A(0x1)(None)
	uint8                                        Pad_4718[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        __FloatProperty_156;                               // 0x29C(0x4)(None)
	float                                        __FloatProperty_157;                               // 0x2A0(0x4)(None)
	float                                        __FloatProperty_158;                               // 0x2A4(0x4)(None)
	float                                        __FloatProperty_159;                               // 0x2A8(0x4)(None)
	float                                        __FloatProperty_160;                               // 0x2AC(0x4)(None)
	float                                        __FloatProperty_161;                               // 0x2B0(0x4)(None)
	float                                        __FloatProperty_162;                               // 0x2B4(0x4)(None)
	float                                        __FloatProperty_163;                               // 0x2B8(0x4)(None)
	uint8                                        Pad_4719[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimSequenceBase*                     __AnimSequenceBase_164;                            // 0x2C0(0x8)(ZeroConstructor)
	bool                                         __BoolProperty_165;                                // 0x2C8(0x1)(None)
	uint8                                        Pad_471A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimSequenceBase*                     __AnimSequenceBase_166;                            // 0x2D0(0x8)(ZeroConstructor)
	uint8                                        __ByteProperty_167;                                // 0x2D8(0x1)(None)
	uint8                                        Pad_471B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimSequenceBase*                     __AnimSequenceBase_168;                            // 0x2E0(0x8)(ZeroConstructor)
	float                                        __FloatProperty_169;                               // 0x2E8(0x4)(None)
	float                                        __FloatProperty_170;                               // 0x2EC(0x4)(None)
	class UAnimSequenceBase*                     __AnimSequenceBase_171;                            // 0x2F0(0x8)(None)
	bool                                         __BoolProperty_172;                                // 0x2F8(0x1)(None)
	bool                                         __BoolProperty_173;                                // 0x2F9(0x1)(None)
};

}


