#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xB1 (0xE1 - 0x30)
// BlueprintGeneratedClass BP_VFX_Spawn_on_AnimNotify.BP_VFX_Spawn_on_AnimNotify_C
class UBP_VFX_Spawn_on_AnimNotify_C : public UAnimNotifyState
{
public:
	class FString                                BoneName;                                          // 0x30(0x10)(ContainsInstancedReference, Protected, BlueprintCallable, BlueprintAuthorityOnly, ExposeOnSpawn, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	struct FVector                               BoneOffset;                                        // 0x40(0x18)(None)
	FMulticastInlineDelegateProperty_            NewEventDispatcher;                                // 0x58(0x10)(Edit, ZeroConstructor)
	double                                       Mult_Amount;                                       // 0x68(0x8)(None)
	class UNiagaraSystem*                        Niagara_System;                                    // 0x70(0x8)(Edit, ZeroConstructor)
	struct FVector                               Distance_To_Test_Collision;                        // 0x78(0x18)(None)
	bool                                         Attach_NS_to_bone;                                 // 0x90(0x1)(None)
	uint8                                        Pad_4A1E[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Mult_Size;                                         // 0x98(0x8)(None)
	double                                       Mult_Velocity;                                     // 0xA0(0x8)(None)
	struct FRotator                              NS_Rotate;                                         // 0xA8(0x18)(None)
	class UCurveFloat*                           Curve_foot_size_0;                                 // 0xC0(0x8)(None)
	bool                                         backwards;                                         // 0xC8(0x1)(None)
	uint8                                        Pad_4A1F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       MaxCamDistanceForVFX;                              // 0xD0(0x8)(None)
	double                                       MaxCamDistanceForVFXByAPlayer;                     // 0xD8(0x8)(None)
	bool                                         bPlaySound;                                        // 0xE0(0x1)(None)

	static class UClass* StaticClass();
	static class UBP_VFX_Spawn_on_AnimNotify_C* GetDefaultObj();

	void Spawn_Sound(class USceneComponent* Actor, const struct FVector& Location, double Speed, double Size, const struct FAudio_Ground_Collection& StepSounds, bool IsPlayer, class AActor* CallFunc_GetOwner_ReturnValue, class APrimalDinoCharacter* K2Node_DynamicCast_AsPrimal_Dino_Character, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsLocallyControlled_ReturnValue, double CallFunc_Multiply_DoubleFloat_ReturnValue, double CallFunc_Divide_DoubleFloat_ReturnValue, double CallFunc_Divide_DoubleFloat_ReturnValue_1, double CallFunc_Divide_DoubleFloat_ReturnValue_2, bool CallFunc_Greater_DoubleDouble_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue_1, double CallFunc_Divide_DoubleFloat_ReturnValue_3, double CallFunc_Divide_DoubleFloat_ReturnValue_4, class UAudioComponent* CallFunc_SpawnSoundAttached_ReturnValue, class UAudioComponent* CallFunc_SpawnSoundAttached_ReturnValue_1, double CallFunc_Divide_DoubleFloat_ReturnValue_5, bool CallFunc_Greater_DoubleDouble_ReturnValue_2, class UAudioComponent* CallFunc_SpawnSoundAttached_ReturnValue_2, bool CallFunc_Greater_DoubleDouble_ReturnValue_3, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, class UAudioComponent* CallFunc_SpawnSoundAttached_ReturnValue_3, class UAudioComponent* CallFunc_SpawnSoundAttached_ReturnValue_4, class UAudioComponent* CallFunc_SpawnSoundAttached_ReturnValue_5, float CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast, float CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast_1, float CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast_2, float CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast_3, float CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast_4, float CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast_5);
	void Spawn_Anim_Notify();
	void Received_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration, const struct FAnimNotifyEventReference& EventReference, bool ReturnValue, const class FString& AnimName, bool ShowFootprints, bool IsPlayer, class UNiagaraSystem* Niagara_System_To_Play, class UNiagaraSystem* Niagara_System_Player, double Baby_Scale, double Dino_Size_Mult, double Dino_Amount_Mult, double Dino_Vel_Mult, const struct FAudio_Ground_Collection& StepSounds, double Total_Amount_Mult, double Foot_Velocity_Mult, class UCurveFloat* Curve_foot_vel, class UCurveFloat* Curve_foot_size, double Foot_Size_Mult, double Thatch, double Sand, double Pebbles, double Leaves, double Grass, double Friction, double Dust, double Bounce, class USkeletalMeshComponent* SK_Mesh_Comp, const struct FColor& Color, class UNiagaraComponent* Niagara_Component, const class FString& NewLocalVar, const TArray<class AActor*>& Temp_object_Variable, const class FString& CallFunc_GetDisplayName_ReturnValue, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, float CallFunc_GetPrimaryCameraLocationDistanceFromPoint_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, class APrimalCharacter* K2Node_DynamicCast_AsPrimal_Character, bool K2Node_DynamicCast_bSuccess, float CallFunc_TimeSince_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue, bool CallFunc_IsShooterCharacter_ReturnValue, float CallFunc_TimeSince_ReturnValue_1, class APlayerPawnTest_C* K2Node_DynamicCast_AsPlayer_Pawn_Test, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_Greater_DoubleDouble_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, double CallFunc_SelectFloat_ReturnValue, bool CallFunc_Less_DoubleDouble_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue_1, const struct FVector& CallFunc_GetForwardVector_ReturnValue, class APrimalDinoCharacter* K2Node_DynamicCast_AsPrimal_Dino_Character, bool K2Node_DynamicCast_bSuccess_2, const struct FVector& CallFunc_GetVelocity_ReturnValue, const struct FVector& CallFunc_Cross_VectorVector_ReturnValue, double CallFunc_BreakVector_X, double CallFunc_BreakVector_Y, double CallFunc_BreakVector_Z, double CallFunc_Lerp_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue_2, double CallFunc_MultiplyMultiply_FloatFloat_ReturnValue, const struct FStruct_Ground_Attributes& CallFunc_GetDataTableRowFromName_OutRow, bool CallFunc_GetDataTableRowFromName_ReturnValue, double CallFunc_Multiply_DoubleFloat_ReturnValue, double CallFunc_Multiply_DoubleFloat_ReturnValue_1, double CallFunc_Multiply_DoubleFloat_ReturnValue_2, double CallFunc_Multiply_DoubleFloat_ReturnValue_3, bool CallFunc_Not_PreBool_ReturnValue, double CallFunc_Multiply_DoubleFloat_ReturnValue_4, class USkeletalMesh* CallFunc_GetSkeletalMeshAsset_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue_2, const struct FBoxSphereBounds& CallFunc_GetImportedBounds_ReturnValue, class APlayerPawnTest_C* K2Node_DynamicCast_AsPlayer_Pawn_Test_1, bool K2Node_DynamicCast_bSuccess_3, const struct FVector& CallFunc_BreakBoxSphereBounds_Origin, const struct FVector& CallFunc_BreakBoxSphereBounds_BoxExtent, float CallFunc_BreakBoxSphereBounds_SphereRadius, class ADino_Character_BP_C* K2Node_DynamicCast_AsDino_Character_BP, bool K2Node_DynamicCast_bSuccess_4, float CallFunc_GetFloatValue_ReturnValue, const struct FDinoContentData& CallFunc_GetDinoContentData_DinoContentData, double CallFunc_Multiply_DoubleFloat_ReturnValue_5, double CallFunc_Multiply_DoubleFloat_ReturnValue_6, float CallFunc_GetFloatValue_ReturnValue_1, double CallFunc_Multiply_DoubleFloat_ReturnValue_7, double CallFunc_Multiply_DoubleFloat_ReturnValue_8, double CallFunc_Multiply_DoubleFloat_ReturnValue_9, const struct FLinearColor& CallFunc_Conv_ColorToLinearColor_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue_3, const struct FVector& CallFunc_GetForwardVector_ReturnValue_1, const struct FVector& CallFunc_GetVelocity_ReturnValue_1, const struct FVector& CallFunc_GetForwardVector_ReturnValue_2, const struct FRotator& CallFunc_Conv_VectorToRotator_ReturnValue, bool CallFunc_IsConsoleBuild_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue, class UShooterGameUserSettings* CallFunc_GetShooterGameUserSettings_ReturnValue, bool CallFunc_Contains_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, const struct FTransform& CallFunc_MakeTransform_ReturnValue, const struct FMatrix& CallFunc_Conv_TransformToMatrix_ReturnValue, class FName CallFunc_Conv_StringToName_ReturnValue, const struct FVector4& CallFunc_Matrix_TransformVector_ReturnValue, class FName CallFunc_GetSocketBoneName_ReturnValue, const struct FVector& CallFunc_Conv_Vector4ToVector_ReturnValue, const struct FTransform& CallFunc_GetSocketTransform_ReturnValue, const struct FVector& CallFunc_BreakTransform_Location, const struct FRotator& CallFunc_BreakTransform_Rotation, const struct FVector& CallFunc_BreakTransform_Scale, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_1, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_2, const struct FHitResult& CallFunc_LineTraceSingle_OutHit, bool CallFunc_LineTraceSingle_ReturnValue, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct FVector& CallFunc_BreakHitResult_Location, const struct FVector& CallFunc_BreakHitResult_ImpactPoint, const struct FVector& CallFunc_BreakHitResult_Normal, const struct FVector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class AActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, class FName CallFunc_BreakHitResult_BoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_ElementIndex, int32 CallFunc_BreakHitResult_FaceIndex, const struct FVector& CallFunc_BreakHitResult_TraceStart, const struct FVector& CallFunc_BreakHitResult_TraceEnd, const class FString& CallFunc_GetDisplayName_ReturnValue_1, const struct FRotator& CallFunc_MakeRotFromYX_ReturnValue, class FName CallFunc_Conv_StringToName_ReturnValue_1, const struct FRotator& CallFunc_ComposeRotators_ReturnValue, const struct FStruct_Ground_Attributes& CallFunc_GetDataTableRowFromName_OutRow_1, bool CallFunc_GetDataTableRowFromName_ReturnValue_1, class UNiagaraComponent* CallFunc_SpawnSystemAtLocation_ReturnValue, double CallFunc_Less_DoubleDouble_A_ImplicitCast, double CallFunc_Greater_DoubleDouble_A_ImplicitCast, double CallFunc_Greater_DoubleDouble_A_ImplicitCast_1, double CallFunc_Lerp_A_ImplicitCast, double CallFunc_Lerp_Alpha_ImplicitCast, float CallFunc_Multiply_DoubleFloat_B_ImplicitCast, float CallFunc_Multiply_DoubleFloat_B_ImplicitCast_1, float CallFunc_Multiply_DoubleFloat_B_ImplicitCast_2, float CallFunc_Multiply_DoubleFloat_B_ImplicitCast_3, float CallFunc_Multiply_DoubleFloat_B_ImplicitCast_4, float CallFunc_SetVariableFloat_InValue_ImplicitCast, float CallFunc_SetVariableFloat_InValue_ImplicitCast_1, float CallFunc_SetVariableFloat_InValue_ImplicitCast_2, float CallFunc_SetVariableFloat_InValue_ImplicitCast_3, float CallFunc_SetVariableFloat_InValue_ImplicitCast_4, float CallFunc_SetVariableFloat_InValue_ImplicitCast_5, float CallFunc_SetVariableFloat_InValue_ImplicitCast_6, float CallFunc_SetVariableFloat_InValue_ImplicitCast_7, float CallFunc_SetVariableFloat_InValue_ImplicitCast_8, float CallFunc_SetVariableFloat_InValue_ImplicitCast_9, float CallFunc_SetVariableFloat_InValue_ImplicitCast_10, double CallFunc_MakeVector_X_ImplicitCast, double CallFunc_MakeVector_Y_ImplicitCast, double CallFunc_MakeVector_Z_ImplicitCast);
	void Received_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, const struct FAnimNotifyEventReference& EventReference, bool ReturnValue);
	void GetNotifyName(const class FString& ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue);
	void Received_NotifyTick(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float FrameDeltaTime, const struct FAnimNotifyEventReference& EventReference, bool ReturnValue, double Line_End_Distance);
	void NewEventDispatcher__DelegateSignature();
};

}


