#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xA8 (0xD8 - 0x30)
// BlueprintGeneratedClass BP_VFX_Spawn_Footprint_AnimNotify.BP_VFX_Spawn_Footprint_AnimNotify_C
class UBP_VFX_Spawn_Footprint_AnimNotify_C : public UAnimNotifyState
{
public:
	class FString                                BoneName;                                          // 0x30(0x10)(ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FVector                               BoneOffset;                                        // 0x40(0x18)(None)
	FMulticastInlineDelegateProperty_            NewEventDispatcher;                                // 0x58(0x10)(Edit, ZeroConstructor)
	class UNiagaraSystem*                        Niagara_System;                                    // 0x68(0x8)(Edit, ZeroConstructor)
	struct FVector                               Distance_To_Test_Collision;                        // 0x70(0x18)(None)
	bool                                         Attach_NS_to_bone;                                 // 0x88(0x1)(None)
	uint8                                        Pad_49A7[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRotator                              NS_Rotate;                                         // 0x90(0x18)(None)
	bool                                         backwards;                                         // 0xA8(0x1)(None)
	bool                                         Front;                                             // 0xA9(0x1)(None)
	uint8                                        Pad_49A8[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UMaterialInterface*                    Footprint_Material;                                // 0xB0(0x8)(None)
	int32                                        Render_Index;                                      // 0xB8(0x4)(None)
	bool                                         bAllowNotifyForPlayerCharacter;                    // 0xBC(0x1)(None)
	uint8                                        Pad_49A9[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       MaxCamDistanceForVFX;                              // 0xC0(0x8)(None)
	double                                       MaxCamDistanceForVFXByAPlayer;                     // 0xC8(0x8)(None)
	bool                                         bPlaySound;                                        // 0xD0(0x1)(None)
	uint8                                        Pad_49AA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DinoFootprintOpacityScale;                         // 0xD4(0x4)(None)

	static class UClass* StaticClass();
	static class UBP_VFX_Spawn_Footprint_AnimNotify_C* GetDefaultObj();

	void LR_FB_Offset(const struct FVector& Front_Offset, const struct FVector& Back_Offset, const struct FVector& Offset, double CallFunc_BreakVector_X, double CallFunc_BreakVector_Y, double CallFunc_BreakVector_Z, const class FString& CallFunc_Split_LeftS, const class FString& CallFunc_Split_RightS, bool CallFunc_Split_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue, const class FString& CallFunc_Right_ReturnValue, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue, bool CallFunc_EqualEqual_StriStri_ReturnValue, const class FString& CallFunc_Left_ReturnValue, double CallFunc_BreakVector_X_1, double CallFunc_BreakVector_Y_1, double CallFunc_BreakVector_Z_1, bool CallFunc_EqualEqual_StriStri_ReturnValue_1, const struct FVector& CallFunc_MakeVector_ReturnValue_1, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_1);
	void NewFunction_0(bool Condition, bool Condition2);
	void Do_Trace(class USkeletalMeshComponent* SK_Mesh_Comp, class AActor* InputPin, double BabyScale, bool IsPlayer, double FootPrintSize, bool Hit_Bool, const struct FHitResult& OutHit, class UMaterialInterface* FootPrintMaterialBack, class UMaterialInterface* FootPrintMaterialFront, class UMaterialInterface* MI_Back, class UMaterialInterface* MI_Front, const struct FVector& Back_Offset, const struct FVector& Front_Offset, double Size, const struct FVector& CallFunc_Conv_DoubleToVector_ReturnValue, class ADino_Character_BP_C* K2Node_DynamicCast_AsDino_Character_BP, bool K2Node_DynamicCast_bSuccess, class AShooterCharacter* K2Node_DynamicCast_AsShooter_Character, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_IsValid_ReturnValue, class UPrimalItem* CallFunc_GetEquippedItemOfType_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class UDinoSettings_Base_C* K2Node_DynamicCast_AsDino_Settings_Base, bool K2Node_DynamicCast_bSuccess_2, const struct FVector& CallFunc_GetForwardVector_ReturnValue, const struct FRotator& CallFunc_Conv_VectorToRotator_ReturnValue, const TArray<class AActor*>& Temp_object_Variable, const struct FVector& CallFunc_LR_FB_Offset_Offset, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue, const struct FVector& CallFunc_Conv_DoubleToVector_ReturnValue_1, const struct FMatrix& CallFunc_Conv_TransformToMatrix_ReturnValue, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_1, const struct FVector4& CallFunc_Matrix_TransformVector_ReturnValue, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_2, const struct FVector& CallFunc_Conv_Vector4ToVector_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, class FName CallFunc_Conv_StringToName_ReturnValue, class FName CallFunc_GetSocketBoneName_ReturnValue, const struct FTransform& CallFunc_GetSocketTransform_ReturnValue, const struct FVector& CallFunc_BreakTransform_Location, const struct FRotator& CallFunc_BreakTransform_Rotation, const struct FVector& CallFunc_BreakTransform_Scale, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_1, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_2, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_3, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_4, const struct FHitResult& CallFunc_LineTraceSingle_OutHit, bool CallFunc_LineTraceSingle_ReturnValue);
	void Spawn_Sound(class USceneComponent* Actor, const struct FVector& Location, double Size, const struct FAudio_Ground_Collection& StepSounds, bool IsPlayer, class AActor* CallFunc_GetOwner_ReturnValue, class APrimalDinoCharacter* K2Node_DynamicCast_AsPrimal_Dino_Character, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsLocallyControlled_ReturnValue, double CallFunc_Divide_DoubleFloat_ReturnValue, double CallFunc_FClamp_ReturnValue, double CallFunc_Divide_DoubleFloat_ReturnValue_1, double CallFunc_Divide_DoubleFloat_ReturnValue_2, double CallFunc_FClamp_ReturnValue_1, double CallFunc_FClamp_ReturnValue_2, bool CallFunc_Greater_DoubleDouble_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue_1, double CallFunc_Divide_DoubleFloat_ReturnValue_3, double CallFunc_Divide_DoubleFloat_ReturnValue_4, double CallFunc_FClamp_ReturnValue_3, double CallFunc_FClamp_ReturnValue_4, class UAudioComponent* CallFunc_SpawnSoundAttached_ReturnValue, class UAudioComponent* CallFunc_SpawnSoundAttached_ReturnValue_1, double CallFunc_Divide_DoubleFloat_ReturnValue_5, bool CallFunc_Greater_DoubleDouble_ReturnValue_2, double CallFunc_FClamp_ReturnValue_5, class UAudioComponent* CallFunc_SpawnSoundAttached_ReturnValue_2, bool CallFunc_Greater_DoubleDouble_ReturnValue_3, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, class UAudioComponent* CallFunc_SpawnSoundAttached_ReturnValue_3, class UAudioComponent* CallFunc_SpawnSoundAttached_ReturnValue_4, class UAudioComponent* CallFunc_SpawnSoundAttached_ReturnValue_5, float CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast, float CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast_1, float CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast_2, float CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast_3, float CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast_4, float CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast_5);
	void Spawn_Anim_Notify();
	void Received_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration, const struct FAnimNotifyEventReference& EventReference, bool ReturnValue, bool IsPlayer, class UMaterialInterface* Material_Front, class UMaterialInterface* Material_Back, double Foot_Print_Size, class AActor* Owner, const struct FVector& Direction, double BabyScale, const struct FAudio_Ground_Collection& StepSounds, double Total_Amount_Mult, double Foot_Velocity_Mult, class UCurveFloat* Curve_foot_vel, class UCurveFloat* Curve_foot_size, double Foot_Size_Mult, double Thatch, double Sand, double Pebbles, double Leaves, double Grass, double Friction, double Dust, double Bounce, class USkeletalMeshComponent* SK_Mesh_Comp, const struct FColor& Color, class UNiagaraComponent* Niagara_Component, const class FString& NewLocalVar, bool DebugPrint_, const class FString& CallFunc_GetDisplayName_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, bool CallFunc_Contains_ReturnValue, class APrimalCharacter* K2Node_DynamicCast_AsPrimal_Character, bool K2Node_DynamicCast_bSuccess, float CallFunc_TimeSince_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue, bool CallFunc_IsShooterCharacter_ReturnValue, float CallFunc_TimeSince_ReturnValue_1, bool CallFunc_Contains_ReturnValue_1, bool CallFunc_Greater_DoubleDouble_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue_1, float CallFunc_GetPrimaryCameraLocationDistanceFromPoint_ReturnValue, double CallFunc_SelectFloat_ReturnValue, bool CallFunc_Less_DoubleDouble_ReturnValue, class FName CallFunc_Conv_StringToName_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue_2, int32 Temp_int_Array_Index_Variable, class UWorld* CallFunc_K2_GetWorld_ReturnValue, class APlayerPawnTest_C* K2Node_DynamicCast_AsPlayer_Pawn_Test, bool K2Node_DynamicCast_bSuccess_1, class AWorldSettings* CallFunc_K2_GetWorldSettings_ReturnValue, class APrimalWorldSettings* K2Node_DynamicCast_AsPrimal_World_Settings, bool K2Node_DynamicCast_bSuccess_2, const struct FRotator& CallFunc_GetSocketRotation_ReturnValue, class APrimalDinoCharacter* K2Node_DynamicCast_AsPrimal_Dino_Character, bool K2Node_DynamicCast_bSuccess_3, const TArray<class UNiagaraComponent*>& CallFunc_GetComponentsByTag_ReturnValue, class UNiagaraComponent* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_CanSpawnGloballyLimitedParticle_ReturnValue, class ADino_Character_BP_C* K2Node_DynamicCast_AsDino_Character_BP, bool K2Node_DynamicCast_bSuccess_4, double CallFunc_Lerp_ReturnValue, double CallFunc_MultiplyMultiply_FloatFloat_ReturnValue, double CallFunc_Multiply_DoubleFloat_ReturnValue, double CallFunc_Multiply_DoubleFloat_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_IsConsoleBuild_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, class UShooterGameUserSettings* CallFunc_GetShooterGameUserSettings_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, const class FString& CallFunc_Split_LeftS, const class FString& CallFunc_Split_RightS, bool CallFunc_Split_ReturnValue, const class FString& CallFunc_Right_ReturnValue, const class FString& CallFunc_Left_ReturnValue, bool CallFunc_EqualEqual_StriStri_ReturnValue, bool CallFunc_EqualEqual_StriStri_ReturnValue_1, const struct FVector& CallFunc_MakeVector_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue_1, class FName CallFunc_Conv_StringToName_ReturnValue_1, const struct FVector& CallFunc_GreaterGreater_VectorRotator_ReturnValue, const struct FRotator& CallFunc_GetSocketRotation_ReturnValue_1, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue, const struct FVector& CallFunc_GreaterGreater_VectorRotator_ReturnValue_1, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_1, double CallFunc_Do_Trace_FootPrintSize, bool CallFunc_Do_Trace_Hit_Bool, const struct FHitResult& CallFunc_Do_Trace_OutHit, class UMaterialInterface* CallFunc_Do_Trace_FootPrintMaterialBack, class UMaterialInterface* CallFunc_Do_Trace_FootPrintMaterialFront, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct FVector& CallFunc_BreakHitResult_Location, const struct FVector& CallFunc_BreakHitResult_ImpactPoint, const struct FVector& CallFunc_BreakHitResult_Normal, const struct FVector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class AActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, class FName CallFunc_BreakHitResult_BoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_ElementIndex, int32 CallFunc_BreakHitResult_FaceIndex, const struct FVector& CallFunc_BreakHitResult_TraceStart, const struct FVector& CallFunc_BreakHitResult_TraceEnd, const class FString& CallFunc_GetDisplayName_ReturnValue_1, class FName CallFunc_Conv_StringToName_ReturnValue_2, const struct FHitResult& CallFunc_K2_SetWorldLocation_SweepHitResult, const struct FStruct_Ground_Attributes& CallFunc_GetDataTableRowFromName_OutRow, bool CallFunc_GetDataTableRowFromName_ReturnValue, double CallFunc_Greater_DoubleDouble_A_ImplicitCast, double CallFunc_Greater_DoubleDouble_A_ImplicitCast_1, double CallFunc_Less_DoubleDouble_A_ImplicitCast, double CallFunc_Lerp_A_ImplicitCast, double CallFunc_Lerp_Alpha_ImplicitCast, float CallFunc_Multiply_DoubleFloat_B_ImplicitCast, float CallFunc_SetFloatParameter_Param_ImplicitCast);
	void Received_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, const struct FAnimNotifyEventReference& EventReference, bool ReturnValue);
	void GetNotifyName(const class FString& ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue);
	void Received_NotifyTick(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float FrameDeltaTime, const struct FAnimNotifyEventReference& EventReference, bool ReturnValue, class USkeletalMeshComponent* Mesh_Comp, double Line_End_Distance);
	void NewEventDispatcher__DelegateSignature();
};

}


