#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x431 (0xEA9 - 0xA78)
// WidgetBlueprintGeneratedClass CheatMenu.CheatMenu_C
class UCheatMenu_C : public UUI_DebugSpawnMenu
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xA78(0x8)(BlueprintCallable, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	class UCheckBox*                             BabyCheck;                                         // 0xA80(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             BlueprintCheckBox;                                 // 0xA88(0x8)(Edit, ZeroConstructor)
	class UCanvasPanel*                          CharacterPresetOptions;                            // 0xA90(0x8)(Edit, ZeroConstructor)
	class UCanvasPanel*                          CheatOptions;                                      // 0xA98(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      CheatStringAddition;                               // 0xAA0(0x8)(Edit, ZeroConstructor)
	class UButton*                               ClearFilterButton;                                 // 0xAA8(0x8)(Edit, ZeroConstructor)
	class UButton*                               CloseButton;                                       // 0xAB0(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             DebugTouchCheck;                                   // 0xAB8(0x8)(Edit, ZeroConstructor)
	class UCanvasPanel*                          DebugView;                                         // 0xAC0(0x8)(Edit, ZeroConstructor)
	class UDataListPanel*                        DinoList;                                          // 0xAC8(0x8)(Edit, ZeroConstructor)
	class UCanvasPanel*                          DinoOptions;                                       // 0xAD0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      DinoSpawnLevelBox;                                 // 0xAD8(0x8)(Edit, ZeroConstructor)
	class UCanvasPanel*                          EggOptions;                                        // 0xAE0(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             EngramCheckBox;                                    // 0xAE8(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             FemaleCheck;                                       // 0xAF0(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             FertilizedCheckBox;                                // 0xAF8(0x8)(Edit, ZeroConstructor)
	class UCanvasPanel*                          FilterPanel;                                       // 0xB00(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image;                                             // 0xB08(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_4;                                           // 0xB10(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_48;                                          // 0xB18(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_97;                                          // 0xB20(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             IncludeItemsCheck;                                 // 0xB28(0x8)(Edit, ZeroConstructor)
	class UCanvasPanel*                          ItemOptions;                                       // 0xB30(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             MaleCheck;                                         // 0xB38(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      NamesFilterInputField;                             // 0xB40(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      NumberEggsToSpawn;                                 // 0xB48(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      NumToSpawnTextBox;                                 // 0xB50(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      QualityToSpawnTextBox;                             // 0xB58(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            ReferenceText;                                     // 0xB60(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             SaddleCheck;                                       // 0xB68(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             TameCheck;                                         // 0xB70(0x8)(Edit, ZeroConstructor)
	class UButton*                               ToDinosButton;                                     // 0xB78(0x8)(Edit, ZeroConstructor)
	int32                                        ScreenTracker;                                     // 0xB80(0x4)(None)
	uint8                                        Pad_4195[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FText>                          FolderNames;                                       // 0xB88(0x10)(AutoWeak, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class UUI_DebugSpawnMenuEntry*>       DebugEntries;                                      // 0xB98(0x10)(ZeroConstructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        DinoNames;                                         // 0xBA8(0x10)(SimpleDisplay, AdvancedDisplay, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        DinoEggNames;                                      // 0xBB8(0x10)(ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        CheatNames;                                        // 0xBC8(0x10)(AutoWeak, ContainsInstancedReference, AdvancedDisplay, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        CheatStrings;                                      // 0xBD8(0x10)(AutoWeak, AdvancedDisplay, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        CharacterPresetStrings;                            // 0xBE8(0x10)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<struct FCheatMenuCharacterLevelPreset> CharacterPresetLevel;                              // 0xBF8(0x10)(AssetRegistrySearchable, SimpleDisplay, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        ScorchedEarthDinoNames;                            // 0xC08(0x10)(AutoWeak, SimpleDisplay, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<enum class ECheatMenuOptionTypes>     OptionTypes;                                       // 0xC18(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        ScorchedEarthEggNames;                             // 0xC28(0x10)(AssetRegistrySearchable, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<struct FCheatMapJumpInfo>             IslandMapJumpInfos;                                // 0xC38(0x10)(ContainsInstancedReference, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        MapOpenCheats;                                     // 0xC48(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        OpenMapNames;                                      // 0xC58(0x10)(AutoWeak, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<struct FCheatMapJumpInfo>             SE_MapJumpInfos;                                   // 0xC68(0x10)(ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        ReferenceTexts;                                    // 0xC78(0x10)(SimpleDisplay, AdvancedDisplay, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<struct FCheatMapJumpInfo>             CenterMapJumpInfos;                                // 0xC88(0x10)(AutoWeak, AssetRegistrySearchable, AdvancedDisplay, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<struct FCheatMapJumpInfo>             AberrationMapJumpInfos;                            // 0xC98(0x10)(SimpleDisplay, AdvancedDisplay, Protected, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<struct FCheatMapJumpInfo>             RagnarokMapJumpInfos;                              // 0xCA8(0x10)(AutoWeak, AssetRegistrySearchable, AdvancedDisplay, Protected, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<struct FCheatMapJumpInfo>             ExtinctionMapJumpInfos;                            // 0xCB8(0x10)(AutoWeak, ContainsInstancedReference, AdvancedDisplay, Protected, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<struct FCheatMapJumpInfo>             ValgueroMapJumpInfos;                              // 0xCC8(0x10)(AdvancedDisplay, Protected, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<struct FCheatMapJumpInfo>             CrystalIslesMapJumpInfos;                          // 0xCD8(0x10)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, Protected, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<struct FCheatMapJumpInfo>             GenesisMapJumpInfos;                               // 0xCE8(0x10)(AutoWeak, ContainsInstancedReference, SimpleDisplay, Protected, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<struct FCheatMapJumpInfo>             Gen2MapJumpInfos;                                  // 0xCF8(0x10)(AutoWeak, SimpleDisplay, Protected, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<struct FCheatMapJumpInfo>             LostIslandMapJumpInfos;                            // 0xD08(0x10)(ContainsInstancedReference, AssetRegistrySearchable, Protected, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<bool>                                 CheatConfirmation;                                 // 0xD18(0x10)(AssetRegistrySearchable, Protected, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        IslandBossStrings;                                 // 0xD28(0x10)(AutoWeak, Protected, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        IslandBossCheats;                                  // 0xD38(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        SEBossCheats;                                      // 0xD48(0x10)(AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        SEBossStrings;                                     // 0xD58(0x10)(ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        AberrationBossStrings;                             // 0xD68(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        AberrationBossCheats;                              // 0xD78(0x10)(AutoWeak, AssetRegistrySearchable, AdvancedDisplay, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        ExtinctionBossCheats;                              // 0xD88(0x10)(ContainsInstancedReference, AdvancedDisplay, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        ExtinctionBossStrings;                             // 0xD98(0x10)(AdvancedDisplay, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        CenterBossCheats;                                  // 0xDA8(0x10)(AutoWeak, AssetRegistrySearchable, SimpleDisplay, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        CenterBossStrings;                                 // 0xDB8(0x10)(AutoWeak, ContainsInstancedReference, SimpleDisplay, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        RagnarokBossCheats;                                // 0xDC8(0x10)(SimpleDisplay, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        RagnarokBossStrings;                               // 0xDD8(0x10)(ContainsInstancedReference, AssetRegistrySearchable, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        ValgueroBossCheats;                                // 0xDE8(0x10)(AutoWeak, ContainsInstancedReference, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        ValgueroBossStrings;                               // 0xDF8(0x10)(AutoWeak, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        AberrationUniqueDinoNames;                         // 0xE08(0x10)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        AberrantDinoNames;                                 // 0xE18(0x10)(AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        Community_Dino_Names;                              // 0xE28(0x10)(AutoWeak, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        ExtinctionDinoNames;                               // 0xE38(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        ExtinctionCorruptDinoNames;                        // 0xE48(0x10)(AssetRegistrySearchable, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<bool>                                 OptionsIsEngram;                                   // 0xE58(0x10)(ContainsInstancedReference, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<int32>                                OptionsQuantity;                                   // 0xE68(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        ExtionctionEggNames;                               // 0xE78(0x10)(AutoWeak, AssetRegistrySearchable, SimpleDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	TArray<class FString>                        EventDinoNames;                                    // 0xE88(0x10)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, BlueprintAuthorityOnly, NonPIEDuplicateTransient, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	class FString                                FilterName;                                        // 0xE98(0x10)(None)
	bool                                         IgnoreFilterChange;                                // 0xEA8(0x1)(None)

	static class UClass* StaticClass();
	static class UCheatMenu_C* GetDefaultObj();

	void BPEscapeClosed(bool ReturnValue, class AShooterHUD* CallFunc_GetShooterHUD_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_CloseSpawnMenu_ReturnValue);
	void ClearFilter(bool ShouldRefresh);
	void GetBossSpawnArray(const TArray<class FString>& BossNames, const TArray<class FString>& BossCheats, class UWorld* CallFunc_GetGameWorld_ReturnValue, const class FString& CallFunc_GetObjectName_ReturnValue, bool K2Node_SwitchString_CmpSuccess);
	void CloseMenu(class AShooterHUD* CallFunc_GetShooterHUD_ReturnValue, bool CallFunc_CloseSpawnMenu_ReturnValue);
	void GetMapOpenListsForEntry(int32 ScreenTracker, const TArray<class FString>& CheatStrings, bool Success, bool CallFunc_EqualEqual_IntInt_ReturnValue);
