#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x8 (0x8 - 0x0)
// Function CheatMenuButton.CheatMenuButton_C.OnLoaded_376A4AD64ABB8961D41479A9CEBAB5A0
struct UCheatMenuButton_C_OnLoaded_376A4AD64ABB8961D41479A9CEBAB5A0_Params
{
public:
	class UClass*                                Loaded;                                            // 0x0(0x8)(None)
};

// 0x8 (0x8 - 0x0)
// Function CheatMenuButton.CheatMenuButton_C.OnLoaded_E74A95AD4E858FEFB820B09140E2E827
struct UCheatMenuButton_C_OnLoaded_E74A95AD4E858FEFB820B09140E2E827_Params
{
public:
	class UClass*                                Loaded;                                            // 0x0(0x8)(None)
};

// 0x1C8 (0x1C8 - 0x0)
// Function CheatMenuButton.CheatMenuButton_C.ExecuteUbergraph_CheatMenuButton
struct UCheatMenuButton_C_ExecuteUbergraph_CheatMenuButton_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(None)
	uint8                                        Pad_2FA0[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                K2Node_CustomEvent_Loaded_1;                       // 0x8(0x8)(ZeroConstructor)
	class UClass*                                Temp_class_Variable;                               // 0x10(0x8)(ZeroConstructor)
	class UClass*                                K2Node_ClassDynamicCast_AsPrimal_Dino_Character;   // 0x18(0x8)(Edit, ZeroConstructor)
	bool                                         K2Node_ClassDynamicCast_bSuccess;                  // 0x20(0x1)(None)
	uint8                                        Pad_2FA1[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UObject*                               CallFunc_GetClassDefaultObject_ReturnValue;        // 0x28(0x8)(ZeroConstructor)
	class UClass*                                K2Node_CustomEvent_Loaded;                         // 0x30(0x8)(Edit, ZeroConstructor)
	class APrimalDinoCharacter*                  K2Node_DynamicCast_AsPrimal_Dino_Character;        // 0x38(0x8)(ZeroConstructor)
	bool                                         K2Node_DynamicCast_bSuccess;                       // 0x40(0x1)(None)
	uint8                                        Pad_2FA2[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                Temp_class_Variable_1;                             // 0x48(0x8)(ZeroConstructor)
	class UClass*                                K2Node_ClassDynamicCast_AsPrimal_Item;             // 0x50(0x8)(ZeroConstructor)
	bool                                         K2Node_ClassDynamicCast_bSuccess_1;                // 0x58(0x1)(None)
	uint8                                        Pad_2FA3[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x60(0x8)(None)
	float                                        CallFunc_GetScaledCapsuleRadius_ReturnValue;       // 0x68(0x4)(None)
	bool                                         Temp_bool_Variable;                                // 0x6C(0x1)(None)
	uint8                                        Pad_2FA4[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x70(0x8)(None)
	double                                       Temp_real_Variable;                                // 0x78(0x8)(None)
	bool                                         Temp_bool_Variable_1;                              // 0x80(0x1)(None)
	uint8                                        Pad_2FA5[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                Temp_class_Variable_2;                             // 0x88(0x8)(ZeroConstructor)
	bool                                         CallFunc_IsChecked_ReturnValue;                    // 0x90(0x1)(None)
	bool                                         CallFunc_IsChecked_ReturnValue_1;                  // 0x91(0x1)(None)
	bool                                         CallFunc_BooleanXOR_ReturnValue;                   // 0x92(0x1)(None)
	bool                                         CallFunc_IsChecked_ReturnValue_2;                  // 0x93(0x1)(None)
	bool                                         CallFunc_IsChecked_ReturnValue_3;                  // 0x94(0x1)(None)
	uint8                                        Pad_2FA7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                K2Node_Select_Default;                             // 0x98(0x8)(Edit, ZeroConstructor)
	double                                       K2Node_Select_Default_1;                           // 0xA0(0x8)(None)
	bool                                         CallFunc_IsChecked_ReturnValue_4;                  // 0xA8(0x1)(None)
	uint8                                        Pad_2FA8[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0xB0(0x8)(None)
	class FText                                  CallFunc_GetText_ReturnValue;                      // 0xB8(0x18)(ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, BlueprintAuthorityOnly, NonPIEDuplicateTransient, ExposeOnSpawn, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate;              // 0xD0(0x10)(Edit, ZeroConstructor)
	class FString                                CallFunc_Conv_TextToString_ReturnValue;            // 0xE0(0x10)(None)
	int32                                        CallFunc_Conv_StringToInt_ReturnValue;             // 0xF0(0x4)(None)
	uint8                                        Pad_2FA9[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class APlayerController*                     CallFunc_GetPlayerController_ReturnValue;          // 0xF8(0x8)(Edit, ZeroConstructor)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_1;            // 0x100(0x10)(Edit, ZeroConstructor)
	class AShooterPlayerController*              K2Node_DynamicCast_AsShooter_Player_Controller;    // 0x110(0x8)(Edit, ZeroConstructor)
	bool                                         K2Node_DynamicCast_bSuccess_1;                     // 0x118(0x1)(None)
	uint8                                        Pad_2FAA[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AShooterCharacter*                     CallFunc_GetPlayerCharacter_ReturnValue;           // 0x120(0x8)(None)
	struct FVector                               CallFunc_GetActorForwardVector_ReturnValue;        // 0x128(0x18)(None)
	struct FVector                               CallFunc_K2_GetActorLocation_ReturnValue;          // 0x140(0x18)(None)
	struct FVector                               CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x158(0x18)(None)
	struct FRotator                              CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x170(0x18)(None)
	struct FVector                               CallFunc_Add_VectorVector_ReturnValue;             // 0x188(0x18)(None)
	struct FVector                               CallFunc_Add_VectorVector_ReturnValue_1;           // 0x1A0(0x18)(None)
	double                                       CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x1B8(0x8)(None)
	double                                       CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x1C0(0x8)(None)
};

}
}


