#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x41 (0x41 - 0x0)
// Function Dino_AIController_BP.Dino_AIController_BP_C.ExecuteUbergraph_Dino_AIController_BP
struct ADino_AIController_BP_C_ExecuteUbergraph_Dino_AIController_BP_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(None)
	class FName                                  CallFunc_MakeLiteralName_ReturnValue;              // 0x4(0x8)(None)
	class FName                                  CallFunc_MakeLiteralName_ReturnValue_1;            // 0xC(0x8)(None)
	uint8                                        Pad_47D[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class APrimalDinoAIController*               K2Node_DynamicCast_AsPrimal_Dino_AIController;     // 0x18(0x8)(Edit, ZeroConstructor)
	bool                                         K2Node_DynamicCast_bSuccess;                       // 0x20(0x1)(None)
	uint8                                        Pad_47E[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  CallFunc_MakeLiteralName_ReturnValue_2;            // 0x24(0x8)(None)
	float                                        CallFunc_GetAttackInterval_ReturnValue;            // 0x2C(0x4)(None)
	float                                        CallFunc_GetAttackRotationRangeDegrees_ReturnValue; // 0x30(0x4)(None)
	bool                                         CallFunc_HasAuthority_ReturnValue;                 // 0x34(0x1)(None)
	uint8                                        Pad_47F[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UBlackboardComponent*                  CallFunc_GetBlackboard_ReturnValue;                // 0x38(0x8)(None)
	bool                                         CallFunc_RunBehaviorTree_ReturnValue;              // 0x40(0x1)(None)
};

}
}


