#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x0 (0x28 - 0x28)
// Class Engine.PrimalReplicationDriver
class UPrimalReplicationDriver : public UObject
{
public:

	static class UClass* StaticClass();
	static class UPrimalReplicationDriver* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.ReplicationDriver
class UReplicationDriver : public UPrimalReplicationDriver
{
public:

	static class UClass* StaticClass();
	static class UReplicationDriver* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.ReplicationConnectionDriver
class UReplicationConnectionDriver : public UObject
{
public:

	static class UClass* StaticClass();
	static class UReplicationConnectionDriver* GetDefaultObj();

};

// 0x1F8 (0x220 - 0x28)
// Class Engine.PrimalActor
class UPrimalActor : public UObject
{
public:
	uint8                                        Pad_15B[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        BitPad_1 : 7;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bPreventSaving : 1;                                // Mask: 0x80, PropSize: 0x10x30(0x1)(None)
	uint8                                        bEnableMultiUse : 1;                               // Mask: 0x1, PropSize: 0x10x31(0x1)(None)
	uint8                                        bBlueprintMultiUseEntries : 1;                     // Mask: 0x2, PropSize: 0x10x31(0x1)(None)
	uint8                                        BitPad_2 : 6;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_15C[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bUseCanMoveThroughActor : 1;                       // Mask: 0x1, PropSize: 0x10x34(0x1)(None)
	uint8                                        bUseBPFilterMultiUseEntries : 1;                   // Mask: 0x2, PropSize: 0x10x34(0x1)(None)
	uint8                                        BitPad_3 : 6;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_15D[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bUseBPGetMultiUseCenterText : 1;                   // Mask: 0x1, PropSize: 0x10x38(0x1)(None)
	uint8                                        bMultiUseCenterHUD : 1;                            // Mask: 0x2, PropSize: 0x10x38(0x1)(None)
	uint8                                        bUseNetworkSpatialization : 1;                     // Mask: 0x4, PropSize: 0x10x38(0x1)(None)
	uint8                                        bNetworkSpatializationForceRelevancyCheck : 1;     // Mask: 0x8, PropSize: 0x10x38(0x1)(None)
	uint8                                        bNetUseClientRelevancy : 1;                        // Mask: 0x10, PropSize: 0x10x38(0x1)(None)
	uint8                                        bAttachmentReplicationUseNetworkParent : 1;        // Mask: 0x20, PropSize: 0x10x38(0x1)(None)
	uint8                                        bUseBPChangedActorTeam : 1;                        // Mask: 0x40, PropSize: 0x10x38(0x1)(None)
	uint8                                        bForceNetworkSpatialization : 1;                   // Mask: 0x80, PropSize: 0x10x38(0x1)(None)
	uint8                                        bForcedHudDrawingRequiresSameTeam : 1;             // Mask: 0x1, PropSize: 0x10x39(0x1)(None)
	uint8                                        bIsMapActor : 1;                                   // Mask: 0x2, PropSize: 0x10x39(0x1)(None)
	uint8                                        bUseOnlyPointForLevelBounds : 1;                   // Mask: 0x4, PropSize: 0x10x39(0x1)(None)
	uint8                                        bUseBPCheckForErrors : 1;                          // Mask: 0x8, PropSize: 0x10x39(0x1)(None)
	uint8                                        bHasHighVolumeRPCs : 1;                            // Mask: 0x10, PropSize: 0x10x39(0x1)(None)
	uint8                                        bAutoStasis : 1;                                   // Mask: 0x20, PropSize: 0x10x39(0x1)(None)
	uint8                                        bClimbable : 1;                                    // Mask: 0x40, PropSize: 0x10x39(0x1)(None)
	uint8                                        BitPad_4 : 1;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_15E[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bUseBPDrawEntry : 1;                               // Mask: 0x1, PropSize: 0x10x3C(0x1)(None)
	uint8                                        BitPad_5 : 7;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_15F[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bPreventCliffPlatforms : 1;                        // Mask: 0x1, PropSize: 0x10x40(0x1)(None)
	uint8                                        bUseBPOverrideUILocation : 1;                      // Mask: 0x2, PropSize: 0x10x40(0x1)(None)
	uint8                                        bStasised : 1;                                     // Mask: 0x4, PropSize: 0x10x40(0x1)(None)
	uint8                                        bPreventActorStasis : 1;                           // Mask: 0x8, PropSize: 0x10x40(0x1)(None)
	uint8                                        bUseBPGetBonesToHideOnAllocation : 1;              // Mask: 0x10, PropSize: 0x10x40(0x1)(None)
	uint8                                        bReplicateHidden : 1;                              // Mask: 0x20, PropSize: 0x10x40(0x1)(None)
	uint8                                        BitPad_6 : 1;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bHibernateChange : 1;                              // Mask: 0x80, PropSize: 0x10x40(0x1)(None)
	uint8                                        bSavedWhenStasised : 1;                            // Mask: 0x1, PropSize: 0x10x41(0x1)(None)
	uint8                                        bLoadedFromSaveGame : 1;                           // Mask: 0x2, PropSize: 0x10x41(0x1)(None)
	uint8                                        bPreventCharacterBasing : 1;                       // Mask: 0x4, PropSize: 0x10x41(0x1)(None)
	uint8                                        bPreventCharacterBasingAllowSteppingUp : 1;        // Mask: 0x8, PropSize: 0x10x41(0x1)(None)
	uint8                                        bIgnoreNetworkRangeScaling : 1;                    // Mask: 0x10, PropSize: 0x10x41(0x1)(None)
	uint8                                        BitPad_7 : 3;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_160[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bForceReplicateDormantChildrenWithoutSpatialRelevancy : 1; // Mask: 0x1, PropSize: 0x10x44(0x1)(None)
	uint8                                        BitPad_8 : 7;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_161[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bForcePreventSeamlessTravel : 1;                   // Mask: 0x1, PropSize: 0x10x48(0x1)(None)
	uint8                                        bPreventLevelBoundsRelevant : 1;                   // Mask: 0x2, PropSize: 0x10x48(0x1)(None)
	uint8                                        bUseBPInventoryItemUsed : 1;                       // Mask: 0x4, PropSize: 0x10x48(0x1)(None)
	uint8                                        bUseBPInventoryItemDropped : 1;                    // Mask: 0x8, PropSize: 0x10x48(0x1)(None)
	uint8                                        bUseBPOverrideTargetingLocation : 1;               // Mask: 0x10, PropSize: 0x10x48(0x1)(None)
	uint8                                        bForceAllowNetMulticast : 1;                       // Mask: 0x20, PropSize: 0x10x48(0x1)(None)
	uint8                                        bBPInventoryItemUsedHandlesDurability : 1;         // Mask: 0x40, PropSize: 0x10x48(0x1)(None)
	uint8                                        bUseBPForceAllowsInventoryUse : 1;                 // Mask: 0x80, PropSize: 0x10x48(0x1)(None)
	uint8                                        bAlwaysRelevantPrimalStructure : 1;                // Mask: 0x1, PropSize: 0x10x49(0x1)(None)
	uint8                                        bPreventNPCSpawnFloor : 1;                         // Mask: 0x2, PropSize: 0x10x49(0x1)(None)
	uint8                                        bForceHiddenReplication : 1;                       // Mask: 0x4, PropSize: 0x10x49(0x1)(None)
	uint8                                        bNetCritical : 1;                                  // Mask: 0x8, PropSize: 0x10x49(0x1)(None)
	uint8                                        bOnlyReplicateOnNetForcedUpdate : 1;               // Mask: 0x10, PropSize: 0x10x49(0x1)(None)
	uint8                                        bPreventRegularForceNetUpdate : 1;                 // Mask: 0x20, PropSize: 0x10x49(0x1)(None)
	uint8                                        bOnlyInitialReplication : 1;                       // Mask: 0x40, PropSize: 0x10x49(0x1)(None)
	uint8                                        bPreventOnDedicatedServer : 1;                     // Mask: 0x80, PropSize: 0x10x49(0x1)(None)
	uint8                                        bUseAttachmentReplication : 1;                     // Mask: 0x1, PropSize: 0x10x4A(0x1)(None)
	uint8                                        bStasisComponentRadiusForceDistanceCheck : 1;      // Mask: 0x2, PropSize: 0x10x4A(0x1)(None)
	uint8                                        bIgnoredByCharacterEncroachment : 1;               // Mask: 0x4, PropSize: 0x10x4A(0x1)(None)
	uint8                                        BitPad_9 : 5;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bUseBPGetHUDDrawLocationOffset : 1;                // Mask: 0x1, PropSize: 0x10x4B(0x1)(None)
	uint8                                        bUseBPPreventAttachments : 1;                      // Mask: 0x2, PropSize: 0x10x4B(0x1)(None)
	uint8                                        bUseBPGetShowDebugAnimationComponents : 1;         // Mask: 0x4, PropSize: 0x10x4B(0x1)(None)
	uint8                                        bUnstreamComponentsUseEndOverlap : 1;              // Mask: 0x8, PropSize: 0x10x4B(0x1)(None)
	uint8                                        bWantsPerformanceThrottledTick : 1;                // Mask: 0x10, PropSize: 0x10x4B(0x1)(None)
	uint8                                        BitPad_A : 2;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bWantsServerThrottledTick : 1;                     // Mask: 0x80, PropSize: 0x10x4B(0x1)(None)
	uint8                                        BitPad_B : 1;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bBPPreInitializeComponents : 1;                    // Mask: 0x2, PropSize: 0x10x4C(0x1)(None)
	uint8                                        bBPPostInitializeComponents : 1;                   // Mask: 0x4, PropSize: 0x10x4C(0x1)(None)
	uint8                                        bUseBPCustomIsRelevantForClient : 1;               // Mask: 0x8, PropSize: 0x10x4C(0x1)(None)
	uint8                                        bUseStasisGrid : 1;                                // Mask: 0x10, PropSize: 0x10x4C(0x1)(None)
	uint8                                        bAlwaysCreatePhysicsState : 1;                     // Mask: 0x20, PropSize: 0x10x4C(0x1)(None)
	uint8                                        bForceInfiniteDrawDistance : 1;                    // Mask: 0x40, PropSize: 0x10x4C(0x1)(None)
	uint8                                        bIsFromChildActorComponent : 1;                    // Mask: 0x80, PropSize: 0x10x4C(0x1)(None)
	uint8                                        bIsDestroyedFromChildActorComponent : 1;           // Mask: 0x1, PropSize: 0x10x4D(0x1)(None)
	uint8                                        bIsValidUnstasisCaster : 1;                        // Mask: 0x2, PropSize: 0x10x4D(0x1)(None)
	uint8                                        bUseBPAllowActorSpawn : 1;                         // Mask: 0x4, PropSize: 0x10x4D(0x1)(None)
	uint8                                        BitPad_C : 5;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_162[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnTargetingTeamChanged;                            // 0x50(0x10)(ZeroConstructor)
	uint8                                        Pad_163[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        TargetingTeam;                                     // 0x78(0x4)(None)
	int32                                        CustomActorFlags;                                  // 0x7C(0x4)(None)
	class AActor*                                ActorUsingQuickAction;                             // 0x80(0x8)(ZeroConstructor)
	class FName                                  CustomTag;                                         // 0x88(0x8)(None)
	int32                                        CustomData;                                        // 0x90(0x4)(None)
	uint8                                        Pad_164[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnActorCustomEvent;                                // 0x98(0x10)(ZeroConstructor)
	double                                       LastThrottledTickTime;                             // 0xA8(0x8)(None)
	uint8                                        bWantsRealtimeThrottledTick : 1;                   // Mask: 0x1, PropSize: 0x10xB0(0x1)(None)
	uint8                                        BitPad_D : 1;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bRealtimeThrottledTickUseNativeTick : 1;           // Mask: 0x4, PropSize: 0x10xB0(0x1)(None)
	uint8                                        BitPad_E : 5;                                      // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_165[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnMatineeUpdated;                                  // 0xB8(0x10)(ZeroConstructor)
	uint8                                        Pad_166[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EReplicationGraphBehavior         RepGraphBehavior;                                  // 0xE0(0x1)(None)
	enum class EReplicationGraphBehavior         DesiredRepGraphBehavior;                           // 0xE1(0x1)(None)
	bool                                         bDesiredRepGraphBehaviorHasBeenSet;                // 0xE2(0x1)(None)
	uint8                                        Pad_167[0x5];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       ForceMaximumReplicationRateUntilTime;              // 0xE8(0x8)(None)
	double                                       LastActorForceReplicationTime;                     // 0xF0(0x8)(None)
	float                                        NetworkAndStasisRangeMultiplier;                   // 0xF8(0x4)(None)
	float                                        NetworkRangeMultiplier;                            // 0xFC(0x4)(None)
	float                                        NetCullDistanceSquaredDormant;                     // 0x100(0x4)(None)
	uint8                                        Pad_168[0xC];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AActor*>                        NetworkSpatializationChildren;                     // 0x110(0x10)(ZeroConstructor)
	TArray<class AActor*>                        NetworkSpatializationChildrenDormant;              // 0x120(0x10)(ZeroConstructor)
	class AActor*                                NetworkSpatializationParent;                       // 0x130(0x8)(ZeroConstructor)
	int32                                        DefaultStasisComponentOctreeFlags;                 // 0x138(0x4)(None)
	int32                                        DefaultStasisedOctreeFlags;                        // 0x13C(0x4)(None)
	int32                                        DefaultUnstasisedOctreeFlags;                      // 0x140(0x4)(None)
	float                                        OverrideStasisComponentRadius;                     // 0x144(0x4)(None)
	class UPrimitiveComponent*                   StasisCheckComponent;                              // 0x148(0x8)(ZeroConstructor)
	double                                       UnstasisLastInRangeTime;                           // 0x150(0x8)(None)
	double                                       LastPreReplicationTime;                            // 0x158(0x8)(None)
	double                                       LastEnterStasisTime;                               // 0x160(0x8)(None)
	double                                       LastExitStasisTime;                                // 0x168(0x8)(None)
	class FString                                LastSelectedWindSourceComponentName;               // 0x170(0x10)(None)
	uint8                                        Pad_169[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TWeakObjectPtr<class UActorComponent>> StasisUnRegisteredComponents;                      // 0x198(0x10)(ZeroConstructor)
	float                                        ReplicationIntervalMultiplier;                     // 0x1A8(0x4)(None)
	float                                        ClientReplicationSendNowThreshold;                 // 0x1AC(0x4)(None)
	uint8                                        Pad_16A[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TWeakObjectPtr<class USoundBase>             LastPostProcessVolumeSound;                        // 0x1B4(0x8)(ZeroConstructor)
	uint8                                        Pad_16B[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnSemaphoreTaken;                                  // 0x1C0(0x10)(ZeroConstructor)
	bool                                         bForceNonBlockingHits;                             // 0x1D0(0x1)(None)
	uint8                                        Pad_16C[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       OriginalCreationTime;                              // 0x1D8(0x8)(None)
	uint8                                        Pad_16D[0x20];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AMatineeActor*>                 ControllingMatineeActors;                          // 0x200(0x10)(None)
	int32                                        NetCriticalPriorityAdjustment;                     // 0x210(0x4)(None)
	uint8                                        Pad_16E[0xC];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPrimalActor* GetDefaultObj();

	void Unstasis();
	void TryMultiUse(class APlayerController* ForPC, int32 UseIndex, int32 HitBodyIndex, bool ReturnValue);
	void ThrottledTick();
	void TargetingTeamChanged();
	void SetTickFunctionEnabled(bool bEnableTick);
	void SetDesiredRepGraphBehavior(enum class EReplicationGraphBehavior NewBehavior);
	void RecieveMatineeUpdated();
	void RealtimeThrottledTick(double DeltaTime);
	void PreventNotifySound(class USoundBase* SoundIn, bool ReturnValue);
	void PlaySoundOnActor(class USoundCue* InSoundCue, float VolumeMultiplier, float PitchMultiplier);
	void PerformanceThrottledTick();
	void OnInventoryItemGrind();
	void OffsetHUDFromCenterScreenY(class AHUD* ForHUD, float ReturnValue);
	void OffsetHUDFromBottomScreenY(class AHUD* ForHUD, float ReturnValue);
	void MulticastPropertyToPlayer(class FName PropertyName, class APlayerController* PC, bool bUnreliable);
	void MulticastProperty(class FName PropertyName, bool bUnreliable);
	void ModifyHudMultiUseLoc(const struct FVector2D& TheVec, class APlayerController* PC, int32 Index);
	void MatineeUpdated();
	void K2_GetWorld(class UWorld* ReturnValue);
	void IsValidLockOnTarget(class APawn* AttackerPawn, bool ReturnValue);
	void IsTargetable(bool ReturnValue);
	void IsShooterWeapon(bool ReturnValue);
	void IsShooterPlayerController(bool ReturnValue);
	void IsShooterCharacter(bool ReturnValue);
	void IsPrimalStructureTurret(bool ReturnValue);
	void IsPrimalStructureItemContainer(bool ReturnValue);
	void IsPrimalStructureExplosive(bool ReturnValue);
	void IsPrimalStructure(bool ReturnValue);
	void IsPrimalDino(bool ReturnValue);
	void IsPrimalCharacterOrStructure(bool ReturnValue);
	void IsPrimalCharacter(bool ReturnValue);
	void IsNetworkStressTestClientMode(bool ReturnValue);
	void IsLocallyControlledByPlayer(bool ReturnValue);
	void IsInstancedFoliage(bool ReturnValue);
	void IsFirstPersonMeshVisible(bool ReturnValue);
	void IsFirstPersonCamera(bool ReturnValue);
	void IsDead(bool ReturnValue);
	void IsARaft(bool ReturnValue);
	void InputDismissPOI_BP(class APlayerController* ForPC, int32 Index);
	void InputDismissPOI(class APlayerController* ForPC, int32 Index);
	void GetWheelOptionInfoBP(class APlayerController* ForPC, int32 WheelCategory, const struct FMultiUseWheelOption& ReturnValue);
	void GetWheelOptionInfo(class APlayerController* ForPC, int32 WheelCategory, const struct FMultiUseWheelOption& ReturnValue);
	void GetWheelOptionByUseIndex(class APlayerController* ForPC, int32 Index, const struct FMultiUseWheelOption& ReturnValue);
	void GetUsablePriority(float ReturnValue);
	void GetTargetingLocation(class AActor* Attacker, const struct FVector& ReturnValue);
	void GetSecondaryMountedActor(class AActor* ReturnValue);
	void GetMultiUseIconBP(class APlayerController* ForPC, const struct FMultiUseEntry& MultiUseEntry, class UTexture2D* ReturnValue);
	void GetMultiUseIcon(class APlayerController* ForPC, const struct FMultiUseEntry& MultiUseEntry, class UTexture2D* ReturnValue);
	void GetMultiUseEntries(class APlayerController* ForPC, const TArray<struct FMultiUseEntry>& MultiUseEntries, int32 HitBodyIndex);
	void GetInterpolatedVelocity(const struct FVector& ReturnValue);
	void GetInterpolatedRotation(const struct FRotator& ReturnValue);
	void GetInterpolatedLocation(const struct FVector& ReturnValue);
	void GetEditTextString(class APlayerController* ForPC, class UObject* AssociatedObject1, int32 ExtraID1, int32 ExtraID2, const class FString& ReturnValue);
	void GetCharacterController(class AController* ReturnValue);
	void GetAttachedSoundVolumeMultiplier(float ReturnValue);
	void GetAttachedSoundPitchMultiplier(float ReturnValue);
	void GetAllSceneComponents(const TArray<class USceneComponent*>& OutComponents);
	void GetAimedTutorialHintString(const class FString& ReturnValue);
	void GetActorViewDirection(const struct FVector& ReturnValue);
	void ForceReplicateNowIfNoChannel();
	void ForceReplicateNow(bool bForceCreateChannel, bool bForceCreateChannelIfRelevant, bool bOnlyIfNoChannel);
	void DrawBasicFloatingHUD(class AHUD* ForHUD);
	void DrawActorFloatingHUD(class AHUD* ForHUD);
	void CurrentlyHasRider(bool ReturnValue);
	void ClientMultiUse(class APlayerController* ForPC, int32 UseIndex, int32 HitBodyIndex);
	void CheckRegisterCharacterMesh();
	void CheckBPAllowActorSpawn(class UWorld* World, const struct FVector& AtLocation, const struct FRotator& AtRotation, class AActor* ForOwner, class APawn* ForInstigator, bool ReturnValue);
	void ChangeActorTeam(int32 NewTeam);
	void CanMoveThroughActor(class AActor* Actor, bool ReturnValue);
	void BPTryMultiUse(class APlayerController* ForPC, int32 UseIndex, bool ReturnValue);
	void BPSetNetworkAndStasisRangeMultiplier(float Value);
	void BPPreventAttachments(class UObject* ForItem, bool ReturnValue);
	void BPPreInitializeComponents();
	void BPPostInitializeComponents();
	void BPOverrideUILocation(class APlayerController* ForPC, const struct FVector& ReturnValue);
	void BPOverrideServerMultiUseAcceptRange(float ReturnValue);
	void BPIsMarkedForSeamlessTravel(bool ReturnValue);
	void BPInventoryItemUsed(class UObject* InventoryItemObject);
	void BPInventoryItemDropped(class UObject* InventoryItemObject);
	void BPGetShowDebugAnimationComponents(const TArray<class USkeletalMeshComponent*>& SkelMeshComponents);
	void BPGetQuickActionUseEntry(class APlayerController* ForPC, const struct FQuickActionOption& ReturnValue);
	void BPGetMultiUseEntries(class APlayerController* ForPC, const TArray<struct FMultiUseEntry>& MultiUseEntries, const TArray<struct FMultiUseEntry>& ReturnValue);
	void BPGetMultiUseCenterText(class APlayerController* ForPC, int32 UseIndex, const class FString& OutCenterText, const struct FLinearColor& OutCenterTextColor, bool ReturnValue);
	void BPGetExtraSpecialBlueprintInt(int32 ToCheck, int32 ReturnValue);
	void BPGetCustomBlueprintData(class FName DataName, const struct FBPNetExecParams& InData, const struct FBPNetExecParams& OutData, bool ReturnValue);
	void BPGetBonesToHideOnAllocation(const TArray<class FName>& ReturnValue);
	void BPGetActorEyesViewPoint(const struct FVector& Location, const struct FRotator& Rotation);
	void BPForceAllowsInventoryUse(class UObject* InventoryItemObject, bool ReturnValue);
	void BPFilterMultiUseEntries(class APlayerController* ForPC, const TArray<struct FMultiUseEntry>& MultiUseEntries, const TArray<struct FMultiUseEntry>& ReturnValue);
	void BPDrawMultiUseEntry(const struct FMultiUseEntry& Entry, class APlayerController* ForPC, class UCanvas* Canvas, const struct FVector2D& CanvasPosition);
	void BPDrawMultiUseCustomEntry(int32 Index, class FName Text, class APlayerController* ForPC, class UCanvas* Canvas, const struct FVector2D& CanvasPosition);
	void BPCustomIsRelevantForClient(class APlayerController* ForPC, bool ReturnValue);
	void BPControlRigNotify(class FName NotifyName, class FName NotifyCustomTag, const struct FHitResult& WorldSpaceHitResult, const struct FVector& Velocity);
	void BPConsumeUsePinCode(class AActor* FromKeypadActor, class APlayerController* ForPC, int32 AppledPinCode, bool bIsActivating, bool ReturnValue);
	void BPConsumeSetPinCode(class APlayerController* ForPC, int32 AppledPinCode, bool bIsSetting, int32 TheCustomIndex, bool ReturnValue);
	void BPClientDoMultiUse(class APlayerController* ForPC, int32 ClientUseIndex);
	void BPCheckForErrors(const TArray<struct FBPMapCheckEntry>& ReturnValue);
	void BPChangedActorTeam();
	void BPAttachedRootComponent();
	void BPAllowActorSpawn(class UWorld* ForWorld, const struct FVector& AtLocation, const struct FRotator& AtRotation, class AActor* ForOwner, class APawn* ForInstigator, bool ReturnValue);
	void BP_OverrideTargetingLocation(class AActor* Attacker, const struct FVector& ReturnValue);
	void BP_GetHUDWorldDrawLocation(class FName HUDTag, const struct FVector& ReturnValue);
	void AllowManualMultiUseActivation(class APlayerController* ForPC, bool ReturnValue);
	void AllowIgnoreCharacterEncroachment(class UPrimitiveComponent* HitComponent, class AActor* EncroachingCharacter, bool ReturnValue);
	void AllowGrappling(bool ReturnValue);
	void AllowEmulatedMovement(bool ReturnValue);
};

// 0x298 (0x4B8 - 0x220)
// Class Engine.Actor
class AActor : public UPrimalActor
{
public:
	struct FActorTickFunction                    PrimaryActorTick;                                  // 0x220(0x38)(None)
	uint8                                        bNetTemporary : 1;                                 // Mask: 0x1, PropSize: 0x10x258(0x1)(None)
	uint8                                        BitPad_11 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bOnlyRelevantToOwner : 1;                          // Mask: 0x4, PropSize: 0x10x258(0x1)(None)
	uint8                                        bAlwaysRelevant : 1;                               // Mask: 0x8, PropSize: 0x10x258(0x1)(None)
	uint8                                        bReplicateMovement : 1;                            // Mask: 0x10, PropSize: 0x10x258(0x1)(None)
	uint8                                        bCallPreReplication : 1;                           // Mask: 0x20, PropSize: 0x10x258(0x1)(None)
	uint8                                        bCallPreReplicationForReplay : 1;                  // Mask: 0x40, PropSize: 0x10x258(0x1)(None)
	uint8                                        bHidden : 1;                                       // Mask: 0x80, PropSize: 0x10x258(0x1)(None)
	uint8                                        bTearOff : 1;                                      // Mask: 0x1, PropSize: 0x10x259(0x1)(None)
	uint8                                        bForceNetAddressable : 1;                          // Mask: 0x2, PropSize: 0x10x259(0x1)(None)
	uint8                                        bExchangedRoles : 1;                               // Mask: 0x4, PropSize: 0x10x259(0x1)(None)
	uint8                                        bNetLoadOnClient : 1;                              // Mask: 0x8, PropSize: 0x10x259(0x1)(None)
	uint8                                        bNetUseOwnerRelevancy : 1;                         // Mask: 0x10, PropSize: 0x10x259(0x1)(None)
	uint8                                        bRelevantForNetworkReplays : 1;                    // Mask: 0x20, PropSize: 0x10x259(0x1)(None)
	uint8                                        bRelevantForLevelBounds : 1;                       // Mask: 0x40, PropSize: 0x10x259(0x1)(None)
	uint8                                        bReplayRewindable : 1;                             // Mask: 0x80, PropSize: 0x10x259(0x1)(None)
	uint8                                        bAllowTickBeforeBeginPlay : 1;                     // Mask: 0x1, PropSize: 0x10x25A(0x1)(None)
	uint8                                        bForceHighQualityViewerReplication : 1;            // Mask: 0x2, PropSize: 0x10x25A(0x1)(None)
	uint8                                        bActorPreventPhysicsSceneRegistration : 1;         // Mask: 0x4, PropSize: 0x10x25A(0x1)(None)
	uint8                                        bAutoDestroyWhenFinished : 1;                      // Mask: 0x8, PropSize: 0x10x25A(0x1)(None)
	uint8                                        bCanBeDamaged : 1;                                 // Mask: 0x10, PropSize: 0x10x25A(0x1)(None)
	uint8                                        bBlockInput : 1;                                   // Mask: 0x20, PropSize: 0x10x25A(0x1)(None)
	uint8                                        bCollideWhenPlacing : 1;                           // Mask: 0x40, PropSize: 0x10x25A(0x1)(None)
	uint8                                        bFindCameraComponentWhenViewTarget : 1;            // Mask: 0x80, PropSize: 0x10x25A(0x1)(None)
	uint8                                        bGenerateOverlapEventsDuringLevelStreaming : 1;    // Mask: 0x1, PropSize: 0x10x25B(0x1)(None)
	uint8                                        bIgnoresOriginShifting : 1;                        // Mask: 0x2, PropSize: 0x10x25B(0x1)(None)
	uint8                                        bEnableAutoLODGeneration : 1;                      // Mask: 0x4, PropSize: 0x10x25B(0x1)(None)
	uint8                                        bIsEditorOnlyActor : 1;                            // Mask: 0x8, PropSize: 0x10x25B(0x1)(None)
	uint8                                        bActorSeamlessTraveled : 1;                        // Mask: 0x10, PropSize: 0x10x25B(0x1)(None)
	uint8                                        bDisableRigidBodyAnimNodes : 1;                    // Mask: 0x20, PropSize: 0x10x25B(0x1)(None)
	uint8                                        bReplicates : 1;                                   // Mask: 0x40, PropSize: 0x10x25B(0x1)(None)
	uint8                                        bCanBeInCluster : 1;                               // Mask: 0x80, PropSize: 0x10x25B(0x1)(None)
	uint8                                        bAllowReceiveTickEventOnDedicatedServer : 1;       // Mask: 0x1, PropSize: 0x10x25C(0x1)(None)
	uint8                                        BitPad_12 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bReplicateUsingRegisteredSubObjectList : 1;        // Mask: 0x4, PropSize: 0x10x25C(0x1)(None)
	uint8                                        BitPad_13 : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        BitPad_14 : 4;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bActorEnableCollision : 1;                         // Mask: 0x10, PropSize: 0x10x25D(0x1)(None)
	uint8                                        bActorIsBeingDestroyed : 1;                        // Mask: 0x20, PropSize: 0x10x25D(0x1)(None)
	uint8                                        BitPad_15 : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        BitPad_16 : 3;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bAsyncPhysicsTickEnabled : 1;                      // Mask: 0x8, PropSize: 0x10x25E(0x1)(None)
	uint8                                        BitPad_17 : 4;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	enum class EActorUpdateOverlapsMethod        UpdateOverlapsMethodDuringLevelStreaming;          // 0x25F(0x1)(None)
	enum class EActorUpdateOverlapsMethod        DefaultUpdateOverlapsMethodDuringLevelStreaming;   // 0x260(0x1)(None)
	uint8                                        Pad_243[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        InitialLifeSpan;                                   // 0x268(0x4)(None)
	float                                        CustomTimeDilation;                                // 0x26C(0x4)(None)
	enum class ENetRole                          RemoteRole;                                        // 0x270(0x1)(None)
	uint8                                        Pad_244[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        RayTracingGroupId;                                 // 0x274(0x4)(None)
	struct FRepAttachment                        AttachmentReplication;                             // 0x278(0x60)(ZeroConstructor)
	struct FRepMovement                          ReplicatedMovement;                                // 0x2D8(0x70)(None)
	class AActor*                                Owner;                                             // 0x348(0x8)(ZeroConstructor)
	class FName                                  NetDriverName;                                     // 0x350(0x8)(None)
	enum class ENetRole                          Role;                                              // 0x358(0x1)(None)
	enum class ENetDormancy                      NetDormancy;                                       // 0x359(0x1)(None)
	enum class ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod;                      // 0x35A(0x1)(None)
	enum class EAutoReceiveInput                 AutoReceiveInput;                                  // 0x35B(0x1)(None)
	int32                                        InputPriority;                                     // 0x35C(0x4)(None)
	double                                       CreationTime;                                      // 0x360(0x8)(None)
	class UInputComponent*                       InputComponent;                                    // 0x368(0x8)(ZeroConstructor)
	float                                        NetCullDistanceSquared;                            // 0x370(0x4)(None)
	int32                                        NetTag;                                            // 0x374(0x4)(None)
	float                                        NetUpdateFrequency;                                // 0x378(0x4)(None)
	float                                        MinNetUpdateFrequency;                             // 0x37C(0x4)(None)
	float                                        NetPriority;                                       // 0x380(0x4)(None)
	uint8                                        Pad_245[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       LastRenderTime;                                    // 0x388(0x8)(None)
	double                                       LastRenderTimeOnScreen;                            // 0x390(0x8)(None)
	double                                       LastRenderTimeIgnoreShadow;                        // 0x398(0x8)(None)
	class APawn*                                 Instigator;                                        // 0x3A0(0x8)(ZeroConstructor)
	TArray<class AActor*>                        Children;                                          // 0x3A8(0x10)(ZeroConstructor)
	class USceneComponent*                       RootComponent;                                     // 0x3B8(0x8)(ZeroConstructor)
	uint8                                        Pad_246[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FName>                          Layers;                                            // 0x3C8(0x10)(None)
	TWeakObjectPtr<class UChildActorComponent>   ParentComponent;                                   // 0x3D8(0x8)(ZeroConstructor)
	TArray<class FName>                          Tags;                                              // 0x3E0(0x10)(None)
	uint8                                        Pad_247[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastSparseDelegateProperty_            OnTakeAnyDamage;                                   // 0x3F4(0x1)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            OnTakePointDamage;                                 // 0x3F5(0x1)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            OnTakeRadialDamage;                                // 0x3F6(0x1)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            OnActorBeginOverlap;                               // 0x3F7(0x1)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            OnActorEndOverlap;                                 // 0x3F8(0x1)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            OnBeginCursorOver;                                 // 0x3F9(0x1)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            OnEndCursorOver;                                   // 0x3FA(0x1)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            OnClicked;                                         // 0x3FB(0x1)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            OnReleased;                                        // 0x3FC(0x1)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            OnInputTouchBegin;                                 // 0x3FD(0x1)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            OnInputTouchEnd;                                   // 0x3FE(0x1)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            OnInputTouchEnter;                                 // 0x3FF(0x1)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            OnInputTouchLeave;                                 // 0x400(0x1)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            OnActorHit;                                        // 0x401(0x1)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            OnDestroyed;                                       // 0x402(0x1)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            OnEndPlay;                                         // 0x403(0x1)(ZeroConstructor)
	uint8                                        Pad_248[0x84];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UActorComponent*>               InstanceComponents;                                // 0x488(0x10)(ZeroConstructor)
	TArray<class UActorComponent*>               BlueprintCreatedComponents;                        // 0x498(0x10)(ZeroConstructor)
	uint8                                        Pad_249[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AActor* GetDefaultObj();

	void WasRecentlyRendered(float Tolerance, bool ReturnValue);
	void UserConstructionScript();
	void TearOff();
	void StopActorSound(class USoundBase* SoundAsset, float FadeOutTime);
	void SetTickGroup(enum class ETickingGroup NewTickGroup);
	void SetTickableWhenPaused(bool bTickableWhenPaused);
	void SetReplicates(bool bInReplicates);
	void SetReplicateMovement(bool bInReplicateMovement);
	void SetRayTracingGroupId(int32 InRaytracingGroupId);
	void SetOwner(class AActor* NewOwner);
	void SetNetDormancy(enum class ENetDormancy NewDormancy);
	void SetLifeSpan(float InLifespan);
	void SetAutoDestroyWhenFinished(bool bVal);
	void SetActorTickInterval(float TickInterval);
	void SetActorTickEnabled(bool bEnabled);
	void SetActorScale3D(const struct FVector& NewScale3D);
	void SetActorRelativeScale3D(const struct FVector& NewRelativeScale);
	void SetActorHiddenInGame(bool bNewHidden);
	void SetActorEnableCollision(bool bNewActorEnableCollision);
	void ServerSendSimpleExecCommandToEveryone(class FName CommandName, bool bIsReliable, bool bForceSendToLocalPlayer, bool bIgnoreRelevancy);
	void ServerSendExecCommandToPlayer(class APrimalPlayerController* ToPC, class FName CommandName, const struct FBPNetExecParams& ExecParams, bool bIsReliable, bool bForceSendToLocalPlayer, bool bIgnoreRelevancy);
	void ServerSendExecCommandToEveryone(class FName CommandName, const struct FBPNetExecParams& ExecParams, bool bIsReliable, bool bForceSendToLocalPlayer, bool bIgnoreRelevancy);
	void ReregisterAllComponents();
	void RemoveTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
	void RemoveTickPrerequisiteActor(class AActor* PrerequisiteActor);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveRadialDamage(float DamageReceived, class UDamageType* DamageType, const struct FVector& Origin, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser);
	void ReceivePointDamage(float Damage, class UDamageType* DamageType, const struct FVector& HitLocation, const struct FVector& HitNormal, class UPrimitiveComponent* HitComponent, class FName BoneName, const struct FVector& ShotFromDirection, class AController* InstigatedBy, class AActor* DamageCauser, const struct FHitResult& HitInfo);
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason);
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	void ReceiveAsyncPhysicsTick(float DeltaSeconds, float SimSeconds);
	void ReceiveAnyDamage(float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
	void ReceiveActorOnReleased(const struct FKey& ButtonReleased);
	void ReceiveActorOnInputTouchLeave(enum class ETouchIndex FingerIndex);
	void ReceiveActorOnInputTouchEnter(enum class ETouchIndex FingerIndex);
	void ReceiveActorOnInputTouchEnd(enum class ETouchIndex FingerIndex);
	void ReceiveActorOnInputTouchBegin(enum class ETouchIndex FingerIndex);
	void ReceiveActorOnClicked(const struct FKey& ButtonPressed);
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void ReceiveActorEndCursorOver();
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveActorBeginCursorOver();
	void PrestreamTextures(float Seconds, bool bEnableStreaming, int32 CinematicTextureGroups);
	void OnRep_ReplicateMovement();
	void OnRep_ReplicatedMovement();
	void OnRep_Owner();
	void OnRep_Instigator();
	void OnRep_AttachmentReplication();
	void NetSpawnedActor(class AActor* SpawnedActor);
	void NetActorSpawnActorUnreliable(class UClass* ActorClass, const struct FVector& AtLoc, const struct FRotator& AtRot, bool bIgnoreOnDedicatedServer, class USceneComponent* AttachToComponent, class FName BoneName, class AActor* SpawnOwner);
	void NetActorSpawnActor(class UClass* ActorClass, const struct FVector& AtLoc, const struct FRotator& AtRot, bool bIgnoreOnDedicatedServer, class USceneComponent* AttachToComponent, class FName BoneName, class AActor* SpawnOwner);
	void MulticastDrawDebugString(const struct FVector& TextLocation, const class FString& Text, class AActor* TestBaseActor, const struct FLinearColor& TextColor, float Duration, bool EnableInShipping);
	void MulticastDrawDebugSphere(const struct FVector& Center, float Radius, int32 Segments, const struct FLinearColor& LineColor, float Duration, bool EnableInShipping);
	void MulticastDrawDebugPoint(const struct FVector& Position, float Size, const struct FLinearColor& PointColor, float Duration, bool EnableInShipping);
	void MulticastDrawDebugPlane(const struct FPlane& PlaneCoordinates, const struct FVector& Location, float Size, const struct FLinearColor& PlaneColor, float Duration, bool EnableInShipping);
	void MulticastDrawDebugLineTraceHitResult(const struct FHitResult& Hit, const struct FVector& TraceStart, const struct FVector& TraceEnd, const struct FLinearColor& StartColor, const struct FLinearColor& HitColor, float LineThickness, float HitSize, bool bDrawHitNormal, const struct FLinearColor& HitNormalColor, float HitNormalLength, float Duration, bool EnableInShipping);
	void MulticastDrawDebugLine(const struct FVector& LineStart, const struct FVector& LineEnd, const struct FLinearColor& LineColor, float Duration, float Thickness, bool EnableInShipping);
	void MulticastDrawDebugCylinder(const struct FVector& Start, const struct FVector& End, float Radius, int32 Segments, const struct FLinearColor& LineColor, float Duration, bool EnableInShipping);
	void MulticastDrawDebugCoordinateSystem(const struct FVector& AxisLoc, const struct FRotator& AxisRot, float Scale, float Duration, float Thickness, bool EnableInShipping);
	void MulticastDrawDebugCapsuleWithExtents(const struct FVector& Top, const struct FVector& Bottom, float Radius, const struct FLinearColor& LineColor, float Duration, bool bPersistent, bool EnableInShipping);
	void MulticastDrawDebugCapsule(const struct FVector& Center, float HalfHeight, float Radius, const struct FRotator& Rotation, const struct FLinearColor& LineColor, float Duration, bool EnableInShipping);
	void MulticastDrawDebugCamera(class ACameraActor* CameraActor, const struct FLinearColor& CameraColor, float Duration, bool EnableInShipping);
	void MulticastDrawDebugBox(const struct FVector& Center, const struct FVector& Extent, const struct FLinearColor& LineColor, const struct FRotator& Rotation, float Duration, bool EnableInShipping);
	void MulticastDrawDebugArrow(const struct FVector& LineStart, const struct FVector& LineEnd, float ArrowSize, const struct FLinearColor& LineColor, float Duration, bool EnableInShipping);
	void MakeNoise(float Loudness, class APawn* NoiseInstigator, const struct FVector& NoiseLocation, float MaxRange, class FName Tag);
	void K2_TeleportTo(const struct FVector& DestLocation, const struct FRotator& DestRotation, bool bSimpleTeleport, bool ReturnValue);
	void K2_SetActorTransform(const struct FTransform& NewTransform, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport, bool ReturnValue);
	void K2_SetActorRotation(const struct FRotator& NewRotation, bool bTeleportPhysics, bool ReturnValue);
	void K2_SetActorRelativeTransform(const struct FTransform& NewRelativeTransform, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_SetActorRelativeRotation(const struct FRotator& NewRelativeRotation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_SetActorRelativeLocation(const struct FVector& NewRelativeLocation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_SetActorLocationAndRotation(const struct FVector& NewLocation, const struct FRotator& NewRotation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport, bool ReturnValue);
	void K2_SetActorLocation(const struct FVector& NewLocation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport, bool ReturnValue);
	void K2_OnReset();
	void K2_OnEndViewTarget(class APlayerController* PC);
	void K2_OnBecomeViewTarget(class APlayerController* PC);
	void K2_GetRootComponent(class USceneComponent* ReturnValue);
	void K2_GetComponentsByClass(class UClass* ComponentClass, const TArray<class UActorComponent*>& ReturnValue);
	void K2_GetActorRotation(const struct FRotator& ReturnValue);
	void K2_GetActorLocation(const struct FVector& ReturnValue);
	void K2_DetachFromActor(enum class EDetachmentRule LocationRule, enum class EDetachmentRule RotationRule, enum class EDetachmentRule ScaleRule);
	void K2_DestroyActor();
	void K2_AttachToComponent(class USceneComponent* Parent, class FName SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies, bool ReturnValue);
	void K2_AttachToActor(class AActor* ParentActor, class FName SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies, bool ReturnValue);
	void K2_AttachRootComponentToActor(class AActor* InParentActor, class FName InSocketName, enum class EAttachLocation AttachLocationType, bool bWeldSimulatedBodies);
	void K2_AttachRootComponentTo(class USceneComponent* InParent, class FName InSocketName, enum class EAttachLocation AttachLocationType, bool bWeldSimulatedBodies);
	void K2_AddActorWorldTransformKeepScale(const struct FTransform& DeltaTransform, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_AddActorWorldTransform(const struct FTransform& DeltaTransform, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_AddActorWorldRotation(const struct FRotator& DeltaRotation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_AddActorWorldOffset(const struct FVector& DeltaLocation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_AddActorLocalTransform(const struct FTransform& NewTransform, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_AddActorLocalRotation(const struct FRotator& DeltaRotation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_AddActorLocalOffset(const struct FVector& DeltaLocation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void IsOwnedOrControlledBy(class AActor* TestOwner, bool ReturnValue);
	void IsOverlappingActor(class AActor* Other, bool ReturnValue);
	void IsChildActor(bool ReturnValue);
	void IsActorTickEnabled(bool ReturnValue);
	void IsActorBeingDestroyed(bool ReturnValue);
	void HasAuthority(bool ReturnValue);
	void GetVisibleUnhiddenComponentByClass(class UClass* ComponentClass, class UPrimitiveComponent* ReturnValue);
	void GetVisibleComponentByClass(class UClass* ComponentClass, class UPrimitiveComponent* ReturnValue);
	void GetVerticalDistanceTo(class AActor* OtherActor, float ReturnValue);
	void GetVelocity(bool bIsForRagdoll, const struct FVector& ReturnValue);
	void GetTransform(const struct FTransform& ReturnValue);
	void GetTickableWhenPaused(bool ReturnValue);
	void GetSquaredHorizontalDistanceTo(class AActor* OtherActor, float ReturnValue);
	void GetSquaredDistanceTo(class AActor* OtherActor, float ReturnValue);
	void GetRemoteRole(enum class ENetRole ReturnValue);
	void GetRayTracingGroupId(int32 ReturnValue);
	void GetParentComponent(class UChildActorComponent* ReturnValue);
	void GetParentActor(class AActor* ReturnValue);
	void GetOwnerController(class APlayerController* ReturnValue);
	void GetOwner(class AActor* ReturnValue);
	void GetOverlappingComponents(const TArray<class UPrimitiveComponent*>& OverlappingComponents);
	void GetOverlappingActors(const TArray<class AActor*>& OverlappingActors, class UClass* ClassFilter);
	void GetLocalRole(enum class ENetRole ReturnValue);
	void GetLifeSpan(float ReturnValue);
	void GetLevelTransform(const struct FTransform& ReturnValue);
	void GetLevel(class ULevel* ReturnValue);
	void GetInstigatorController(class AController* ReturnValue);
	void GetInstigator(class APawn* ReturnValue);
	void GetInputVectorAxisValue(const struct FKey& InputAxisKey, const struct FVector& ReturnValue);
	void GetInputAxisValue(class FName InputAxisName, float ReturnValue);
	void GetInputAxisKeyValue(const struct FKey& InputAxisKey, float ReturnValue);
	void GetHorizontalDotProductTo(class AActor* OtherActor, float ReturnValue);
	void GetHorizontalDistanceTo(class AActor* OtherActor, float ReturnValue);
	void GetGameTimeSinceCreation(float ReturnValue);
	void GetDotProductTo(class AActor* OtherActor, float ReturnValue);
	void GetDistanceTo(class AActor* OtherActor, float ReturnValue);
	void GetComponentsByTag(class UClass* ComponentClass, class FName Tag, const TArray<class UActorComponent*>& ReturnValue);
	void GetComponentsByInterface(class UClass* Interface, const TArray<class UActorComponent*>& ReturnValue);
	void GetComponentsByCustomTag(class FName TheTag, const TArray<class UActorComponent*>& ReturnValue);
	void GetComponentByCustomTag(class FName TheTag, class UActorComponent* ReturnValue);
	void GetComponentByClass(class UClass* ComponentClass, class UActorComponent* ReturnValue);
	void GetAttachParentSocketName(class FName ReturnValue);
	void GetAttachParentActor(class AActor* ReturnValue);
	void GetAttachedActors(const TArray<class AActor*>& OutActors, bool bResetArray, bool bRecursivelyIncludeAttachedActors);
	void GetAllChildActors(const TArray<class AActor*>& ChildActors, bool bIncludeDescendants);
	void GetActorUpVector(const struct FVector& ReturnValue);
	void GetActorTimeDilation(float ReturnValue);
	void GetActorTickInterval(float ReturnValue);
	void GetActorScale3D(const struct FVector& ReturnValue);
	void GetActorRightVector(const struct FVector& ReturnValue);
	void GetActorRelativeScale3D(const struct FVector& ReturnValue);
	void GetActorForwardVector(const struct FVector& ReturnValue);
	void GetActorEyesViewPoint(const struct FVector& OutLocation, const struct FRotator& OutRotation);
	void GetActorEnableCollision(bool ReturnValue);
	void GetActorBounds(bool bOnlyCollidingComponents, const struct FVector& Origin, const struct FVector& BoxExtent, bool bIncludeFromChildActors);
	void ForceNetUpdate(bool bDormantDontReplicateProperties, bool bAbsoluteForceNetUpdate, bool bDontUpdateChannel);
	void ForceDestroy();
	void FlushNetDormancy();
	void FinishAddComponent(class UActorComponent* Component, bool bManualAttachment, const struct FTransform& RelativeTransform);
	void EnableInput(class APlayerController* PlayerController);
	void DisableInput(class APlayerController* PlayerController);
	void DetachRootComponentFromParent(bool bMaintainWorldPosition);
	void CreateInputComponent(class UClass* InputComponentToCreate);
	void CalculateComponentsBoundingBoxInLocalSpace(bool bNonColliding, bool bIncludeFromChildActors, const struct FBox& ReturnValue);
	void BPServerHandleNetExecCommand(class APlayerController* FromPC, class FName CommandName, const struct FBPNetExecParams& ExecParams, bool ReturnValue);
	void BPIsA(class UClass* AnActorClass, bool ReturnValue);
	void BPClientHandleNetExecCommand(class FName CommandName, const struct FBPNetExecParams& ExecParams, class APlayerController* ForPC, bool ReturnValue);
	void AddTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
	void AddTickPrerequisiteActor(class AActor* PrerequisiteActor);
	void AddComponentByClass(class UClass* Class, bool bManualAttachment, const struct FTransform& RelativeTransform, bool bDeferredFinish, class UActorComponent* ReturnValue);
	void AddComponent(class FName TemplateName, bool bManualAttachment, const struct FTransform& RelativeTransform, class UObject* ComponentTemplateContext, bool bDeferredFinish, class UActorComponent* ReturnValue);
	void ActorPlaySoundUnreliable(class USoundBase* SoundAsset, bool bAttach, class FName BoneName, const struct FVector& LocOffset);
	void ActorPlaySound(class USoundBase* SoundAsset, bool bAttach, class FName BoneName, const struct FVector& LocOffset);
	void ActorHasTag(class FName Tag, bool ReturnValue);
};

// 0x0 (0x28 - 0x28)
// Class Engine.BlueprintFunctionLibrary
class UBlueprintFunctionLibrary : public UObject
{
public:

	static class UClass* StaticClass();
	static class UBlueprintFunctionLibrary* GetDefaultObj();

};

// 0xA0 (0xC8 - 0x28)
// Class Engine.StreamableRenderAsset
class UStreamableRenderAsset : public UObject
{
public:
	uint8                                        Pad_25B[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       ForceMipLevelsToBeResidentTimestamp;               // 0x40(0x8)(None)
	int32                                        NumCinematicMipLevels;                             // 0x48(0x4)(None)
	uint8                                        Pad_25D[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPerQualityLevelInt                   NoRefStreamingLODBias;                             // 0x50(0x68)(None)
	int32                                        StreamingIndex;                                    // 0xB8(0x4)(None)
	uint8                                        NeverStream : 1;                                   // Mask: 0x1, PropSize: 0x10xBC(0x1)(None)
	uint8                                        bGlobalForceMipLevelsToBeResident : 1;             // Mask: 0x2, PropSize: 0x10xBC(0x1)(None)
	uint8                                        bHasStreamingUpdatePending : 1;                    // Mask: 0x4, PropSize: 0x10xBC(0x1)(None)
	uint8                                        bForceMiplevelsToBeResident : 1;                   // Mask: 0x8, PropSize: 0x10xBC(0x1)(None)
	uint8                                        bIgnoreStreamingMipBias : 1;                       // Mask: 0x10, PropSize: 0x10xBC(0x1)(None)
	uint8                                        bUseCinematicMipLevels : 1;                        // Mask: 0x20, PropSize: 0x10xBC(0x1)(None)
	uint8                                        Pad_25E[0xB];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UStreamableRenderAsset* GetDefaultObj();

	void SetForceMipLevelsToBeResident(float Seconds, int32 CinematicLODGroupMask);
};

// 0x110 (0x1D8 - 0xC8)
// Class Engine.Texture
class UTexture : public UStreamableRenderAsset
{
public:
	uint8                                        Pad_262[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGuid                                 LightingGuid;                                      // 0xD8(0x10)(None)
	int32                                        LevelIndex;                                        // 0xE8(0x4)(None)
	struct FPerPlatformInt                       LODBias;                                           // 0xEC(0x4)(None)
	enum class ETextureCompressionSettings       CompressionSettings;                               // 0xF0(0x1)(None)
	enum class ETextureFilter                    Filter;                                            // 0xF1(0x1)(None)
	enum class ETextureMipLoadOptions            MipLoadOptions;                                    // 0xF2(0x1)(None)
	enum class ETextureCookPlatformTilingSettings CookPlatformTilingSettings;                        // 0xF3(0x1)(None)
	enum class ETextureGroup                     LODGroup;                                          // 0xF4(0x1)(None)
	uint8                                        Pad_264[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPerPlatformFloat                     Downscale;                                         // 0xF8(0x4)(None)
	enum class ETextureDownscaleOptions          DownscaleOptions;                                  // 0xFC(0x1)(None)
	uint8                                        SRGB : 1;                                          // Mask: 0x1, PropSize: 0x10xFD(0x1)(None)
	uint8                                        bNoTiling : 1;                                     // Mask: 0x2, PropSize: 0x10xFD(0x1)(None)
	uint8                                        VirtualTextureStreaming : 1;                       // Mask: 0x4, PropSize: 0x10xFD(0x1)(None)
	uint8                                        CompressionYCoCg : 1;                              // Mask: 0x8, PropSize: 0x10xFD(0x1)(None)
	uint8                                        bNotOfflineProcessed : 1;                          // Mask: 0x10, PropSize: 0x10xFD(0x1)(None)
	uint8                                        bAsyncResourceReleaseHasBeenStarted : 1;           // Mask: 0x20, PropSize: 0x10xFD(0x1)(None)
	uint8                                        BitPad_18 : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_265[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UAssetUserData*>                AssetUserData;                                     // 0x100(0x10)(None)
	uint8                                        Pad_266[0xC8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTexture* GetDefaultObj();

	void ComputeTextureSourceChannelMinMax(const struct FLinearColor& OutColorMin, const struct FLinearColor& OutColorMax, bool ReturnValue);
	void Blueprint_GetTextureSourceDiskAndMemorySize(int64 OutDiskSize, int64 OutMemorySize);
	void Blueprint_GetMemorySize(int64 ReturnValue);
};

// 0x90 (0xB8 - 0x28)
// Class Engine.ActorComponent
class UActorComponent : public UObject
{
public:
	uint8                                        Pad_292[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FActorComponentTickFunction           PrimaryComponentTick;                              // 0x30(0x38)(None)
	TArray<class FName>                          ComponentTags;                                     // 0x68(0x10)(None)
	TArray<class UAssetUserData*>                AssetUserData;                                     // 0x78(0x10)(ZeroConstructor)
	uint8                                        Pad_293[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        UCSSerializationIndex;                             // 0x8C(0x4)(None)
	uint8                                        BitPad_1B : 3;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bNetAddressable : 1;                               // Mask: 0x8, PropSize: 0x10x90(0x1)(None)
	uint8                                        bReplicateUsingRegisteredSubObjectList : 1;        // Mask: 0x10, PropSize: 0x10x90(0x1)(None)
	uint8                                        bReplicates : 1;                                   // Mask: 0x20, PropSize: 0x10x90(0x1)(None)
	uint8                                        BitPad_1C : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_294[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        BitPad_1D : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bAutoActivate : 1;                                 // Mask: 0x2, PropSize: 0x10x92(0x1)(None)
	uint8                                        bIsActive : 1;                                     // Mask: 0x4, PropSize: 0x10x92(0x1)(None)
	uint8                                        bEditableWhenInherited : 1;                        // Mask: 0x8, PropSize: 0x10x92(0x1)(None)
	uint8                                        bOnlyRelevantToOwner : 1;                          // Mask: 0x10, PropSize: 0x10x92(0x1)(None)
	uint8                                        BitPad_1E : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bCanEverAffectNavigation : 1;                      // Mask: 0x40, PropSize: 0x10x92(0x1)(None)
	uint8                                        BitPad_1F : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bIsEditorOnly : 1;                                 // Mask: 0x1, PropSize: 0x10x93(0x1)(None)
	uint8                                        BitPad_20 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_296[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EComponentCreationMethod          CreationMethod;                                    // 0x95(0x1)(None)
	FMulticastSparseDelegateProperty_            OnComponentActivated;                              // 0x96(0x1)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            OnComponentDeactivated;                            // 0x97(0x1)(None)
	uint8                                        Pad_297[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bStasisPreventUnregister : 1;                      // Mask: 0x1, PropSize: 0x10xA8(0x1)(None)
	uint8                                        bOnlyInitialReplication : 1;                       // Mask: 0x2, PropSize: 0x10xA8(0x1)(None)
	uint8                                        bPreventOnDedicatedServer : 1;                     // Mask: 0x4, PropSize: 0x10xA8(0x1)(None)
	uint8                                        bPreventOnConsoles : 1;                            // Mask: 0x8, PropSize: 0x10xA8(0x1)(None)
	uint8                                        bPreventOnClient : 1;                              // Mask: 0x10, PropSize: 0x10xA8(0x1)(None)
	uint8                                        bPreventOnNonDedicatedHost : 1;                    // Mask: 0x20, PropSize: 0x10xA8(0x1)(None)
	uint8                                        bDedicatedForceTickingEveryFrame : 1;              // Mask: 0x40, PropSize: 0x10xA8(0x1)(None)
	uint8                                        bAlwaysReplicatePropertyConditional : 1;           // Mask: 0x80, PropSize: 0x10xA8(0x1)(None)
	uint8                                        bUseBPOnComponentTick : 1;                         // Mask: 0x1, PropSize: 0x10xA9(0x1)(None)
	uint8                                        bUseBPOnComponentDestroyed : 1;                    // Mask: 0x2, PropSize: 0x10xA9(0x1)(None)
	uint8                                        bUseBPOnComponentCreated : 1;                      // Mask: 0x4, PropSize: 0x10xA9(0x1)(None)
	uint8                                        BitPad_21 : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_298[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  CustomTag;                                         // 0xAC(0x8)(None)
	int32                                        CustomData;                                        // 0xB4(0x4)(None)

	static class UClass* StaticClass();
	static class UActorComponent* GetDefaultObj();

	void ToggleActive();
	void SetTickGroup(enum class ETickingGroup NewTickGroup);
	void SetTickableWhenPaused(bool bTickableWhenPaused);
	void SetOwner(class AActor* NewOwner);
	void SetIsReplicated(bool ShouldReplicate);
	void SetComponentTickIntervalAndCooldown(float TickInterval);
	void SetComponentTickInterval(float TickInterval);
	void SetComponentTickEnabled(bool bEnabled);
	void SetAutoActivate(bool bNewAutoActivate);
	void SetActive(bool bNewActive, bool bReset);
	void ReregisterComponent();
	void RemoveTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
	void RemoveTickPrerequisiteActor(class AActor* PrerequisiteActor);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void ReceiveAsyncPhysicsTick(float DeltaSeconds, float SimSeconds);
	void OnRep_IsActive();
	void K2_DestroyComponent(class UObject* Object);
	void IsComponentTickEnabled(bool ReturnValue);
	void IsBeingDestroyed(bool ReturnValue);
	void IsActive(bool ReturnValue);
	void GetOwner(class AActor* ReturnValue);
	void GetComponentTickInterval(float ReturnValue);
	void Deactivate();
	void ComponentHasTag(class FName Tag, bool ReturnValue);
	void BPTickComponent(float DeltaTime);
	void BPOnComponentTick(float DeltaTime);
	void BPOnComponentDestroyed();
	void BPOnComponentCreated();
	void AddTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
	void AddTickPrerequisiteActor(class AActor* PrerequisiteActor);
	void AddedAsPrimalItemAttachment();
	void Activate(bool bReset);
};

// 0x210 (0x2C8 - 0xB8)
// Class Engine.SceneComponent
class USceneComponent : public UActorComponent
{
public:
	uint8                                        Pad_30D[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TWeakObjectPtr<class APhysicsVolume>         PhysicsVolume;                                     // 0xC0(0x8)(ZeroConstructor)
	class USceneComponent*                       AttachParent;                                      // 0xC8(0x8)(ZeroConstructor)
	class FName                                  AttachSocketName;                                  // 0xD0(0x8)(None)
	TArray<class USceneComponent*>               AttachChildren;                                    // 0xD8(0x10)(ZeroConstructor)
	TArray<class USceneComponent*>               ClientAttachedChildren;                            // 0xE8(0x10)(ZeroConstructor)
	uint8                                        Pad_311[0x48];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               RelativeLocation;                                  // 0x140(0x18)(None)
	struct FRotator                              RelativeRotation;                                  // 0x158(0x18)(None)
	struct FVector                               RelativeScale3D;                                   // 0x170(0x18)(None)
	struct FVector                               ComponentVelocity;                                 // 0x188(0x18)(None)
	uint8                                        bClientSyncAlwaysUpdatePhysicsCollision : 1;       // Mask: 0x1, PropSize: 0x10x1A0(0x1)(None)
	uint8                                        BitPad_29 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_314[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bComponentToWorldUpdated : 1;                      // Mask: 0x1, PropSize: 0x10x1A4(0x1)(None)
	uint8                                        BitPad_2A : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bAbsoluteLocation : 1;                             // Mask: 0x4, PropSize: 0x10x1A4(0x1)(None)
	uint8                                        bAbsoluteRotation : 1;                             // Mask: 0x8, PropSize: 0x10x1A4(0x1)(None)
	uint8                                        bAbsoluteScale : 1;                                // Mask: 0x10, PropSize: 0x10x1A4(0x1)(None)
	uint8                                        bVisible : 1;                                      // Mask: 0x20, PropSize: 0x10x1A4(0x1)(None)
	uint8                                        bShouldBeAttached : 1;                             // Mask: 0x40, PropSize: 0x10x1A4(0x1)(None)
	uint8                                        bShouldSnapLocationWhenAttached : 1;               // Mask: 0x80, PropSize: 0x10x1A4(0x1)(None)
	uint8                                        bShouldSnapRotationWhenAttached : 1;               // Mask: 0x1, PropSize: 0x10x1A5(0x1)(None)
	uint8                                        bShouldSnapScaleWhenAttached : 1;                  // Mask: 0x2, PropSize: 0x10x1A5(0x1)(None)
	uint8                                        bShouldUpdatePhysicsVolume : 1;                    // Mask: 0x4, PropSize: 0x10x1A5(0x1)(None)
	uint8                                        bHiddenInGame : 1;                                 // Mask: 0x8, PropSize: 0x10x1A5(0x1)(None)
	uint8                                        BitPad_2B : 4;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_317[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bAttachedSoundsForceHighPriority : 1;              // Mask: 0x1, PropSize: 0x10x1A8(0x1)(None)
	uint8                                        BitPad_2C : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_318[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bBoundsChangeTriggersStreamingDataRebuild : 1;     // Mask: 0x1, PropSize: 0x10x1AC(0x1)(None)
	uint8                                        bUseAttachParentBound : 1;                         // Mask: 0x2, PropSize: 0x10x1AC(0x1)(None)
	uint8                                        bComputeFastLocalBounds : 1;                       // Mask: 0x4, PropSize: 0x10x1AC(0x1)(None)
	uint8                                        bComputeBoundsOnceForGame : 1;                     // Mask: 0x8, PropSize: 0x10x1AC(0x1)(None)
	uint8                                        bComputedBoundsOnceForGame : 1;                    // Mask: 0x10, PropSize: 0x10x1AC(0x1)(None)
	uint8                                        bIsNotRenderAttachmentRoot : 1;                    // Mask: 0x20, PropSize: 0x10x1AC(0x1)(None)
	uint8                                        BitPad_2D : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_319[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EComponentMobility                Mobility;                                          // 0x1AE(0x1)(None)
	enum class EDetailMode                       DetailMode;                                        // 0x1AF(0x1)(None)
	FMulticastSparseDelegateProperty_            PhysicsVolumeChangedDelegate;                      // 0x1B0(0x1)(ZeroConstructor)
	uint8                                        Pad_31A[0x10F];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bIgnoreParentTransformUpdate : 1;                  // Mask: 0x1, PropSize: 0x10x2C0(0x1)(None)
	uint8                                        bUpdateChildOverlaps : 1;                          // Mask: 0x2, PropSize: 0x10x2C0(0x1)(None)
	uint8                                        BitPad_2E : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_31B[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        AttachmentChangedIncrementer;                      // 0x2C4(0x4)(None)

	static class UClass* StaticClass();
	static class USceneComponent* GetDefaultObj();

	void ToggleVisibility(bool bPropagateToChildren);
	void StopSound(class USoundBase* SoundToStop, float FadeOutTime);
	void SetWorldScale3D(const struct FVector& NewScale);
	void SetVisibility(bool bNewVisibility, bool bPropagateToChildren, bool bSetChildrenRenderState);
	void SetShouldUpdatePhysicsVolume(bool bInShouldUpdatePhysicsVolume);
	void SetRelativeScale3D(const struct FVector& NewScale3D);
	void SetMobility(enum class EComponentMobility NewMobility);
	void SetHiddenInGame(bool NewHidden, bool bPropagateToChildren, bool bSetChildrenRenderState);
	void SetAbsolute(bool bNewAbsoluteLocation, bool bNewAbsoluteRotation, bool bNewAbsoluteScale);
	void ResetRelativeTransform();
	void OnRep_Visibility(bool OldValue);
	void OnRep_Transform();
	void OnRep_AttachSocketName();
	void OnRep_AttachParent();
	void OnRep_AttachChildren();
	void K2_SetWorldTransform(const struct FTransform& NewTransform, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_SetWorldRotation(const struct FRotator& NewRotation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_SetWorldLocationAndRotation(const struct FVector& NewLocation, const struct FRotator& NewRotation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_SetWorldLocation(const struct FVector& NewLocation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_SetRelativeTransform(const struct FTransform& NewTransform, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_SetRelativeRotation(const struct FRotator& NewRotation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_SetRelativeLocationAndRotation(const struct FVector& NewLocation, const struct FRotator& NewRotation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_SetRelativeLocation(const struct FVector& NewLocation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_GetComponentToWorld(const struct FTransform& ReturnValue);
	void K2_GetComponentScale(const struct FVector& ReturnValue);
	void K2_GetComponentRotation(const struct FRotator& ReturnValue);
	void K2_GetComponentLocation(const struct FVector& ReturnValue);
	void K2_DetachFromComponent(enum class EDetachmentRule LocationRule, enum class EDetachmentRule RotationRule, enum class EDetachmentRule ScaleRule, bool bCallModify);
	void K2_AttachToComponent(class USceneComponent* Parent, class FName SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies, bool ReturnValue);
	void K2_AttachTo(class USceneComponent* InParent, class FName InSocketName, enum class EAttachLocation AttachType, bool bWeldSimulatedBodies, bool ReturnValue);
	void K2_AddWorldTransformKeepScale(const struct FTransform& DeltaTransform, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_AddWorldTransform(const struct FTransform& DeltaTransform, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_AddWorldRotation(const struct FRotator& DeltaRotation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_AddWorldOffset(const struct FVector& DeltaLocation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_AddRelativeRotation(const struct FRotator& DeltaRotation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_AddRelativeLocation(const struct FVector& DeltaLocation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_AddLocalTransform(const struct FTransform& DeltaTransform, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_AddLocalRotation(const struct FRotator& DeltaRotation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void K2_AddLocalOffset(const struct FVector& DeltaLocation, bool bSweep, const struct FHitResult& SweepHitResult, bool bTeleport);
	void IsVisible(bool ReturnValue);
	void IsSimulatingPhysics(class FName BoneName, bool ReturnValue);
	void IsAnySimulatingPhysics(bool ReturnValue);
	void GetUpVector(const struct FVector& ReturnValue);
	void GetSocketTransform(class FName InSocketName, enum class ERelativeTransformSpace TransformSpace, const struct FTransform& ReturnValue);
	void GetSocketRotation(class FName InSocketName, const struct FRotator& ReturnValue);
	void GetSocketQuaternion(class FName InSocketName, const struct FQuat& ReturnValue);
	void GetSocketLocation(class FName InSocketName, const struct FVector& ReturnValue);
	void GetShouldUpdatePhysicsVolume(bool ReturnValue);
	void GetRightVector(const struct FVector& ReturnValue);
	void GetRelativeTransform(const struct FTransform& ReturnValue);
	void GetPhysicsVolume(class APhysicsVolume* ReturnValue);
	void GetParentComponents(const TArray<class USceneComponent*>& Parents);
	void GetNumChildrenComponents(int32 ReturnValue);
	void GetForwardVector(const struct FVector& ReturnValue);
	void GetComponentVelocity(const struct FVector& ReturnValue);
	void GetChildrenComponents(bool bIncludeAllDescendants, const TArray<class USceneComponent*>& Children);
	void GetChildComponent(int32 ChildIndex, class USceneComponent* ReturnValue);
	void GetAttachSocketName(class FName ReturnValue);
	void GetAttachParent(class USceneComponent* ReturnValue);
	void GetAllSocketNames(const TArray<class FName>& ReturnValue);
	void DoesSocketExist(class FName InSocketName, bool ReturnValue);
	void DetachFromParent(bool bMaintainWorldPosition, bool bCallModify);
};

// 0x3B8 (0x680 - 0x2C8)
// Class Engine.PrimitiveComponent
class UPrimitiveComponent : public USceneComponent
{
public:
	uint8                                        Pad_47A[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinDrawDistance;                                   // 0x2E0(0x4)(None)
	float                                        LDMaxDrawDistance;                                 // 0x2E4(0x4)(None)
	float                                        CachedMaxDrawDistance;                             // 0x2E8(0x4)(None)
	enum class ESceneDepthPriorityGroup          DepthPriorityGroup;                                // 0x2EC(0x1)(None)
	enum class ESceneDepthPriorityGroup          ViewOwnerDepthPriorityGroup;                       // 0x2ED(0x1)(None)
	enum class EIndirectLightingCacheQuality     IndirectLightingCacheQuality;                      // 0x2EE(0x1)(None)
	enum class ELightmapType                     LightmapType;                                      // 0x2EF(0x1)(None)
	enum class EHLODBatchingPolicy               HLODBatchingPolicy;                                // 0x2F0(0x1)(None)
	uint8                                        bEnableAutoLODGeneration : 1;                      // Mask: 0x1, PropSize: 0x10x2F1(0x1)(None)
	uint8                                        bIsActorTextureStreamingBuiltData : 1;             // Mask: 0x2, PropSize: 0x10x2F1(0x1)(None)
	uint8                                        bIsValidTextureStreamingBuiltData : 1;             // Mask: 0x4, PropSize: 0x10x2F1(0x1)(None)
	uint8                                        bNeverDistanceCull : 1;                            // Mask: 0x8, PropSize: 0x10x2F1(0x1)(None)
	uint8                                        BitPad_41 : 4;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        BitPad_42 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bAlwaysCreatePhysicsState : 1;                     // Mask: 0x2, PropSize: 0x10x2F2(0x1)(None)
	uint8                                        bGenerateOverlapEvents : 1;                        // Mask: 0x4, PropSize: 0x10x2F2(0x1)(None)
	uint8                                        bMultiBodyOverlap : 1;                             // Mask: 0x8, PropSize: 0x10x2F2(0x1)(None)
	uint8                                        bTraceComplexOnMove : 1;                           // Mask: 0x10, PropSize: 0x10x2F2(0x1)(None)
	uint8                                        bReturnMaterialOnMove : 1;                         // Mask: 0x20, PropSize: 0x10x2F2(0x1)(None)
	uint8                                        bUseViewOwnerDepthPriorityGroup : 1;               // Mask: 0x40, PropSize: 0x10x2F2(0x1)(None)
	uint8                                        bAllowCullDistanceVolume : 1;                      // Mask: 0x80, PropSize: 0x10x2F2(0x1)(None)
	uint8                                        bVisibleInReflectionCaptures : 1;                  // Mask: 0x1, PropSize: 0x10x2F3(0x1)(None)
	uint8                                        bVisibleInRealTimeSkyCaptures : 1;                 // Mask: 0x2, PropSize: 0x10x2F3(0x1)(None)
	uint8                                        bVisibleInRayTracing : 1;                          // Mask: 0x4, PropSize: 0x10x2F3(0x1)(None)
	uint8                                        bRenderInMainPass : 1;                             // Mask: 0x8, PropSize: 0x10x2F3(0x1)(None)
	uint8                                        bRenderInDepthPass : 1;                            // Mask: 0x10, PropSize: 0x10x2F3(0x1)(None)
	uint8                                        bReceivesDecals : 1;                               // Mask: 0x20, PropSize: 0x10x2F3(0x1)(None)
	uint8                                        bHoldout : 1;                                      // Mask: 0x40, PropSize: 0x10x2F3(0x1)(None)
	uint8                                        bOwnerNoSee : 1;                                   // Mask: 0x80, PropSize: 0x10x2F3(0x1)(None)
	uint8                                        bOnlyOwnerSee : 1;                                 // Mask: 0x1, PropSize: 0x10x2F4(0x1)(None)
	uint8                                        bTreatAsBackgroundForOcclusion : 1;                // Mask: 0x2, PropSize: 0x10x2F4(0x1)(None)
	uint8                                        bUseAsOccluder : 1;                                // Mask: 0x4, PropSize: 0x10x2F4(0x1)(None)
	uint8                                        bSelectable : 1;                                   // Mask: 0x8, PropSize: 0x10x2F4(0x1)(None)
	uint8                                        bForceMipStreaming : 1;                            // Mask: 0x10, PropSize: 0x10x2F4(0x1)(None)
	uint8                                        bHasPerInstanceHitProxies : 1;                     // Mask: 0x20, PropSize: 0x10x2F4(0x1)(None)
	uint8                                        CastShadow : 1;                                    // Mask: 0x40, PropSize: 0x10x2F4(0x1)(None)
	uint8                                        bEmissiveLightSource : 1;                          // Mask: 0x80, PropSize: 0x10x2F4(0x1)(None)
	uint8                                        bAffectDynamicIndirectLighting : 1;                // Mask: 0x1, PropSize: 0x10x2F5(0x1)(None)
	uint8                                        bAffectIndirectLightingWhileHidden : 1;            // Mask: 0x2, PropSize: 0x10x2F5(0x1)(None)
	uint8                                        bAffectDistanceFieldLighting : 1;                  // Mask: 0x4, PropSize: 0x10x2F5(0x1)(None)
	uint8                                        bCastDynamicShadow : 1;                            // Mask: 0x8, PropSize: 0x10x2F5(0x1)(None)
	uint8                                        bCastStaticShadow : 1;                             // Mask: 0x10, PropSize: 0x10x2F5(0x1)(None)
	uint8                                        BitPad_43 : 3;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	enum class EShadowCacheInvalidationBehavior  ShadowCacheInvalidationBehavior;                   // 0x2F6(0x1)(None)
	uint8                                        bCastVolumetricTranslucentShadow : 1;              // Mask: 0x1, PropSize: 0x10x2F7(0x1)(None)
	uint8                                        bCastContactShadow : 1;                            // Mask: 0x2, PropSize: 0x10x2F7(0x1)(None)
	uint8                                        bSelfShadowOnly : 1;                               // Mask: 0x4, PropSize: 0x10x2F7(0x1)(None)
	uint8                                        bCastFarShadow : 1;                                // Mask: 0x8, PropSize: 0x10x2F7(0x1)(None)
	uint8                                        bCastInsetShadow : 1;                              // Mask: 0x10, PropSize: 0x10x2F7(0x1)(None)
	uint8                                        bCastCinematicShadow : 1;                          // Mask: 0x20, PropSize: 0x10x2F7(0x1)(None)
	uint8                                        bCastHiddenShadow : 1;                             // Mask: 0x40, PropSize: 0x10x2F7(0x1)(None)
	uint8                                        bCastShadowAsTwoSided : 1;                         // Mask: 0x80, PropSize: 0x10x2F7(0x1)(None)
	uint8                                        bLightAsIfStatic : 1;                              // Mask: 0x1, PropSize: 0x10x2F8(0x1)(None)
	uint8                                        bLightAttachmentsAsGroup : 1;                      // Mask: 0x2, PropSize: 0x10x2F8(0x1)(None)
	uint8                                        bExcludeFromLightAttachmentGroup : 1;              // Mask: 0x4, PropSize: 0x10x2F8(0x1)(None)
	uint8                                        bReceiveMobileCSMShadows : 1;                      // Mask: 0x8, PropSize: 0x10x2F8(0x1)(None)
	uint8                                        bSingleSampleShadowFromStationaryLights : 1;       // Mask: 0x10, PropSize: 0x10x2F8(0x1)(None)
	uint8                                        bIgnoreRadialImpulse : 1;                          // Mask: 0x20, PropSize: 0x10x2F8(0x1)(None)
	uint8                                        bIgnoreRadialForce : 1;                            // Mask: 0x40, PropSize: 0x10x2F8(0x1)(None)
	uint8                                        bApplyImpulseOnDamage : 1;                         // Mask: 0x80, PropSize: 0x10x2F8(0x1)(None)
	uint8                                        bReplicatePhysicsToAutonomousProxy : 1;            // Mask: 0x1, PropSize: 0x10x2F9(0x1)(None)
	uint8                                        bFillCollisionUnderneathForNavmesh : 1;            // Mask: 0x2, PropSize: 0x10x2F9(0x1)(None)
	uint8                                        AlwaysLoadOnClient : 1;                            // Mask: 0x4, PropSize: 0x10x2F9(0x1)(None)
	uint8                                        AlwaysLoadOnServer : 1;                            // Mask: 0x8, PropSize: 0x10x2F9(0x1)(None)
	uint8                                        bUseEditorCompositing : 1;                         // Mask: 0x10, PropSize: 0x10x2F9(0x1)(None)
	uint8                                        bIsBeingMovedByEditor : 1;                         // Mask: 0x20, PropSize: 0x10x2F9(0x1)(None)
	uint8                                        bRenderCustomDepth : 1;                            // Mask: 0x40, PropSize: 0x10x2F9(0x1)(None)
	uint8                                        bVisibleInSceneCaptureOnly : 1;                    // Mask: 0x80, PropSize: 0x10x2F9(0x1)(None)
	uint8                                        bHiddenInSceneCapture : 1;                         // Mask: 0x1, PropSize: 0x10x2FA(0x1)(None)
	uint8                                        bRayTracingFarField : 1;                           // Mask: 0x2, PropSize: 0x10x2FA(0x1)(None)
	uint8                                        BitPad_44 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bHasNoStreamableTextures : 1;                      // Mask: 0x8, PropSize: 0x10x2FA(0x1)(None)
	uint8                                        bStaticWhenNotMoveable : 1;                        // Mask: 0x10, PropSize: 0x10x2FA(0x1)(None)
	uint8                                        BitPad_45 : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bIgnoreUpdatingOwnersLastRenderTime : 1;           // Mask: 0x80, PropSize: 0x10x2FA(0x1)(None)
	uint8                                        Pad_481[0x1D];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EHasCustomNavigableGeometry       bHasCustomNavigableGeometry;                       // 0x318(0x1)(None)
	uint8                                        Pad_482[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	enum class ECanBeCharacterBase               CanCharacterStepUpOn;                              // 0x31A(0x1)(None)
	struct FLightingChannels                     LightingChannels;                                  // 0x31B(0x1)(None)
	int32                                        RayTracingGroupId;                                 // 0x31C(0x4)(None)
	int32                                        VisibilityId;                                      // 0x320(0x4)(None)
	int32                                        CustomDepthStencilValue;                           // 0x324(0x4)(None)
	struct FCustomPrimitiveData                  CustomPrimitiveData;                               // 0x328(0x10)(None)
	struct FCustomPrimitiveData                  CustomPrimitiveDataInternal;                       // 0x338(0x10)(None)
	uint8                                        Pad_485[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        TranslucencySortPriority;                          // 0x350(0x4)(None)
	float                                        TranslucencySortDistanceOffset;                    // 0x354(0x4)(None)
	TArray<class URuntimeVirtualTexture*>        RuntimeVirtualTextures;                            // 0x358(0x10)(ZeroConstructor)
	int8                                         VirtualTextureLodBias;                             // 0x368(0x1)(None)
	int8                                         VirtualTextureCullMips;                            // 0x369(0x1)(None)
	int8                                         VirtualTextureMinCoverage;                         // 0x36A(0x1)(None)
	enum class ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType;                      // 0x36B(0x1)(None)
	uint8                                        Pad_486[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BoundsScale;                                       // 0x37C(0x4)(None)
	uint8                                        Pad_487[0x20];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AActor*>                        MoveIgnoreActors;                                  // 0x3A0(0x10)(ZeroConstructor)
	TArray<class UPrimitiveComponent*>           MoveIgnoreComponents;                              // 0x3B0(0x10)(ZeroConstructor)
	uint8                                        Pad_488[0x60];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBodyInstance                         BodyInstance;                                      // 0x420(0x138)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            OnComponentHit;                                    // 0x558(0x1)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            OnComponentBeginOverlap;                           // 0x559(0x1)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            OnComponentEndOverlap;                             // 0x55A(0x1)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            OnComponentWake;                                   // 0x55B(0x1)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            OnComponentSleep;                                  // 0x55C(0x1)(ZeroConstructor)
	uint8                                        Pad_48B[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastSparseDelegateProperty_            OnComponentPhysicsStateChanged;                    // 0x55E(0x1)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            OnBeginCursorOver;                                 // 0x55F(0x1)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            OnEndCursorOver;                                   // 0x560(0x1)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            OnClicked;                                         // 0x561(0x1)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            OnReleased;                                        // 0x562(0x1)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            OnInputTouchBegin;                                 // 0x563(0x1)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            OnInputTouchEnd;                                   // 0x564(0x1)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            OnInputTouchEnter;                                 // 0x565(0x1)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            OnInputTouchLeave;                                 // 0x566(0x1)(ZeroConstructor)
	enum class ERayTracingGroupCullingPriority   RayTracingGroupCullingPriority;                    // 0x567(0x1)(None)
	enum class ERendererStencilMask              CustomDepthStencilWriteMask;                       // 0x568(0x1)(None)
	uint8                                        Pad_48D[0x1F];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        ExcludeFromHLODLevels;                             // 0x588(0x1)(None)
	uint8                                        Pad_48E[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UPrimitiveComponent*                   LODParentPrimitive;                                // 0x590(0x8)(ZeroConstructor)
	uint8                                        bForcePreventBlockingProjectiles : 1;              // Mask: 0x1, PropSize: 0x10x598(0x1)(None)
	uint8                                        bForceOverlapEvents : 1;                           // Mask: 0x2, PropSize: 0x10x598(0x1)(None)
	uint8                                        bIsInForeground : 1;                               // Mask: 0x4, PropSize: 0x10x598(0x1)(None)
	uint8                                        bUseInternalOctree : 1;                            // Mask: 0x8, PropSize: 0x10x598(0x1)(None)
	uint8                                        bUseInternalOctreeOnClient : 1;                    // Mask: 0x10, PropSize: 0x10x598(0x1)(None)
	uint8                                        BitPad_46 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bForceDynamicPhysics : 1;                          // Mask: 0x40, PropSize: 0x10x598(0x1)(None)
	uint8                                        bPreventCharacterBasing : 1;                       // Mask: 0x80, PropSize: 0x10x598(0x1)(None)
	uint8                                        BitPad_47 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bIsAbstractBasingComponent : 1;                    // Mask: 0x2, PropSize: 0x10x599(0x1)(None)
	uint8                                        bClimbable : 1;                                    // Mask: 0x4, PropSize: 0x10x599(0x1)(None)
	uint8                                        bUseAbsoluteMaxDrawDisatance : 1;                  // Mask: 0x8, PropSize: 0x10x599(0x1)(None)
	uint8                                        bMovableUseDynamicDrawDistance : 1;                // Mask: 0x10, PropSize: 0x10x599(0x1)(None)
	uint8                                        bIncludeBoundsRadiusInDrawDistances : 1;           // Mask: 0x20, PropSize: 0x10x599(0x1)(None)
	uint8                                        bExcludeFromLevelBounds : 1;                       // Mask: 0x40, PropSize: 0x10x599(0x1)(None)
	uint8                                        bIgnoredByCharacterEncroachment : 1;               // Mask: 0x80, PropSize: 0x10x599(0x1)(None)
	uint8                                        bPreventDamage : 1;                                // Mask: 0x1, PropSize: 0x10x59A(0x1)(None)
	uint8                                        BitPad_48 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_492[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ObjectLayer;                                       // 0x59C(0x4)(None)
	float                                        OverrideStepHeight;                                // 0x5A0(0x4)(None)
	uint8                                        Pad_493[0x98];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        InternalOctreeMask;                                // 0x63C(0x4)(None)
	uint8                                        Pad_494[0x1C];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint32                                       ProxyMeshID;                                       // 0x65C(0x4)(None)
	bool                                         bIsProxyMeshParent;                                // 0x660(0x1)(None)
	uint8                                        Pad_495[0x1F];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPrimitiveComponent* GetDefaultObj();

	void WasRecentlyVisible(bool ReturnValue);
	void WasRecentlyRendered(float Tolerance, bool ReturnValue);
	void WakeRigidBody(class FName BoneName);
	void WakeAllRigidBodies();
	void SetWalkableSlopeOverride(const struct FWalkableSlopeOverride& NewOverride);
	void SetVisibleInSceneCaptureOnly(bool bValue);
	void SetVisibleInRayTracing(bool bNewVisibleInRayTracing);
	void SetVectorParameterForDefaultCustomPrimitiveData(class FName ParameterName, const struct FVector4& Value);
	void SetVectorParameterForCustomPrimitiveData(class FName ParameterName, const struct FVector4& Value);
	void SetUseCCD(bool InUseCCD, class FName BoneName);
	void SetTranslucentSortPriority(int32 NewTranslucentSortPriority);
	void SetTranslucencySortDistanceOffset(float NewTranslucencySortDistanceOffset);
	void SetStaticWhenNotMoveable(bool bInStaticWhenNotMoveable);
	void SetSingleSampleShadowFromStationaryLights(bool bNewSingleSampleShadowFromStationaryLights);
	void SetSimulatePhysics(bool bSimulate);
	void SetScalarParameterForDefaultCustomPrimitiveData(class FName ParameterName, float Value);
	void SetScalarParameterForCustomPrimitiveData(class FName ParameterName, float Value);
	void SetRenderInMainPass(bool bValue);
	void SetRenderInDepthPass(bool bValue);
	void SetRenderCustomDepth(bool bValue);
	void SetReceivesDecals(bool bNewReceivesDecals);
	void SetPhysMaterialOverride(class UPhysicalMaterial* NewPhysMaterial);
	void SetPhysicsMaxAngularVelocityInRadians(float NewMaxAngVel, bool bAddToCurrent, class FName BoneName);
	void SetPhysicsMaxAngularVelocityInDegrees(float NewMaxAngVel, bool bAddToCurrent, class FName BoneName);
	void SetPhysicsLinearVelocity(const struct FVector& NewVel, bool bAddToCurrent, class FName BoneName);
	void SetPhysicsAngularVelocityInRadians(const struct FVector& NewAngVel, bool bAddToCurrent, class FName BoneName);
	void SetPhysicsAngularVelocityInDegrees(const struct FVector& NewAngVel, bool bAddToCurrent, class FName BoneName);
	void SetOwnerNoSee(bool bNewOwnerNoSee);
	void SetOnlyOwnerSee(bool bNewOnlyOwnerSee);
	void SetNotifyRigidBodyCollision(bool bNewNotifyRigidBodyCollision);
	void SetMaterialByName(class FName MaterialSlotName, class UMaterialInterface* Material);
	void SetMaterial(int32 ElementIndex, class UMaterialInterface* Material);
	void SetMassScale(class FName BoneName, float InMassScale);
	void SetMassOverrideInKg(class FName BoneName, float MassInKg, bool bOverrideMass);
	void SetLinearDamping(float InDamping);
	void SetLightingChannels(bool bChannel0, bool bChannel1, bool bChannel2);
	void SetLightAttachmentsAsGroup(bool bInLightAttachmentsAsGroup);
	void SetInternalOctreeMask(int32 InOctreeMask, bool bReregisterWithTree);
	void SetHoldout(bool bNewHoldout);
	void SetHiddenInSceneCapture(bool bValue);
	void SetGenerateOverlapEvents(bool bInGenerateOverlapEvents);
	void SetExcludeFromLightAttachmentGroup(bool bInExcludeFromLightAttachmentGroup);
	void SetExcludeForSpecificHLODLevels(const TArray<int32>& InExcludeForSpecificHLODLevels);
	void SetExcludedFromHLODLevel(enum class EHLODLevelExclusion HLODLevel, bool bExcluded);
	void SetEnableGravity(bool bGravityEnabled);
	void SetEmissiveLightSource(bool NewEmissiveLightSource);
	void SetDefaultCustomPrimitiveDataVector4(int32 DataIndex, const struct FVector4& Value);
	void SetDefaultCustomPrimitiveDataVector3(int32 DataIndex, const struct FVector& Value);
	void SetDefaultCustomPrimitiveDataVector2(int32 DataIndex, const struct FVector2D& Value);
	void SetDefaultCustomPrimitiveDataFloat(int32 DataIndex, float Value);
	void SetCustomPrimitiveDataVector4(int32 DataIndex, const struct FVector4& Value);
	void SetCustomPrimitiveDataVector3(int32 DataIndex, const struct FVector& Value);
	void SetCustomPrimitiveDataVector2(int32 DataIndex, const struct FVector2D& Value);
	void SetCustomPrimitiveDataFloat(int32 DataIndex, float Value);
	void SetCustomDepthStencilWriteMask(enum class ERendererStencilMask WriteMaskBit);
	void SetCustomDepthStencilValue(int32 Value);
	void SetCullDistance(float NewCullDistance);
	void SetConstraintMode(enum class EDOFMode ConstraintMode);
	void SetCollisionResponseToChannel(enum class ECollisionChannel Channel, enum class ECollisionResponse NewResponse);
	void SetCollisionResponseToAllChannels(enum class ECollisionResponse NewResponse);
	void SetCollisionResponseSet(const struct FCollisionResponseSet& Responses);
	void SetCollisionProfileName(class FName InCollisionProfileName, bool bUpdateOverlaps);
	void SetCollisionObjectType(enum class ECollisionChannel Channel);
	void SetCollisionEnabled(enum class ECollisionEnabled NewType);
	void SetCenterOfMass(const struct FVector& CenterOfMassOffset, class FName BoneName);
	void SetCastShadow(bool NewCastShadow);
	void SetCastInsetShadow(bool bInCastInsetShadow);
	void SetCastHiddenShadow(bool NewCastHiddenShadow);
	void SetCastContactShadow(bool bInCastContactShadow);
	void SetBoundsScale(float NewBoundsScale);
	void SetAngularDamping(float InDamping);
	void SetAllUseCCD(bool InUseCCD);
	void SetAllPhysicsLinearVelocity(const struct FVector& NewVel, bool bAddToCurrent);
	void SetAllPhysicsAngularVelocityInRadians(const struct FVector& NewAngVel, bool bAddToCurrent);
	void SetAllPhysicsAngularVelocityInDegrees(const struct FVector& NewAngVel, bool bAddToCurrent);
	void SetAllMassScale(float InMassScale);
	void SetAffectIndirectLightingWhileHidden(bool bNewAffectIndirectLightingWhileHidden);
	void SetAffectDynamicIndirectLighting(bool bNewAffectDynamicIndirectLighting);
	void SetAffectDistanceFieldLighting(bool NewAffectDistanceFieldLighting);
	void ScaleByMomentOfInertia(const struct FVector& InputVector, class FName BoneName, const struct FVector& ReturnValue);
	void PutRigidBodyToSleep(class FName BoneName);
	void K2_SphereTraceComponent(const struct FVector& TraceStart, const struct FVector& TraceEnd, float SphereRadius, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, const struct FVector& HitLocation, const struct FVector& HitNormal, class FName BoneName, const struct FHitResult& OutHit, bool ReturnValue);
	void K2_SphereOverlapComponent(const struct FVector& InSphereCentre, float InSphereRadius, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, const struct FVector& HitLocation, const struct FVector& HitNormal, class FName BoneName, const struct FHitResult& OutHit, bool ReturnValue);
	void K2_LineTraceComponent(const struct FVector& TraceStart, const struct FVector& TraceEnd, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, const struct FVector& HitLocation, const struct FVector& HitNormal, class FName BoneName, const struct FHitResult& OutHit, bool ReturnValue);
	void K2_IsQueryCollisionEnabled(bool ReturnValue);
	void K2_IsPhysicsCollisionEnabled(bool ReturnValue);
	void K2_IsCollisionEnabled(bool ReturnValue);
	void K2_BoxOverlapComponent(const struct FVector& InBoxCentre, const struct FBox& InBox, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, const struct FVector& HitLocation, const struct FVector& HitNormal, class FName BoneName, const struct FHitResult& OutHit, bool ReturnValue);
	void IsOverlappingComponent(class UPrimitiveComponent* OtherComp, bool ReturnValue);
	void IsOverlappingActor(class AActor* Other, bool ReturnValue);
	void IsGravityEnabled(bool ReturnValue);
	void IsExcludedFromHLODLevel(enum class EHLODLevelExclusion HLODLevel, bool ReturnValue);
	void IsAnyRigidBodyAwake(bool ReturnValue);
	void InvalidateLumenSurfaceCache();
	void IgnoreComponentWhenMoving(class UPrimitiveComponent* Component, bool bShouldIgnore);
	void IgnoreActorWhenMoving(class AActor* Actor, bool bShouldIgnore);
	void GetWalkableSlopeOverride(const struct FWalkableSlopeOverride& ReturnValue);
	void GetStaticWhenNotMoveable(bool ReturnValue);
	void GetPhysicsLinearVelocityAtPoint(const struct FVector& Point, class FName BoneName, const struct FVector& ReturnValue);
	void GetPhysicsLinearVelocity(class FName BoneName, const struct FVector& ReturnValue);
	void GetPhysicsAngularVelocityInRadians(class FName BoneName, const struct FVector& ReturnValue);
	void GetPhysicsAngularVelocityInDegrees(class FName BoneName, const struct FVector& ReturnValue);
	void GetOverlappingComponents(const TArray<class UPrimitiveComponent*>& OutOverlappingComponents);
	void GetOverlappingActors(const TArray<class AActor*>& OverlappingActors, class UClass* ClassFilter);
	void GetNumMaterials(int32 ReturnValue);
	void GetMaterialFromCollisionFaceIndex(int32 FaceIndex, int32 SectionIndex, class UMaterialInterface* ReturnValue);
	void GetMaterial(int32 ElementIndex, class UMaterialInterface* ReturnValue);
	void GetMassScale(class FName BoneName, float ReturnValue);
	void GetMass(float ReturnValue);
	void GetLinearDamping(float ReturnValue);
	void GetInertiaTensor(class FName BoneName, const struct FVector& ReturnValue);
	void GetGenerateOverlapEvents(bool ReturnValue);
	void GetExcludeForSpecificHLODLevels(const TArray<int32>& ReturnValue);
	void GetCustomPrimitiveDataIndexForVectorParameter(class FName ParameterName, int32 ReturnValue);
	void GetCustomPrimitiveDataIndexForScalarParameter(class FName ParameterName, int32 ReturnValue);
	void GetCollisionResponseToChannel(enum class ECollisionChannel Channel, enum class ECollisionResponse ReturnValue);
	void GetCollisionResponseSet(const struct FCollisionResponseSet& OutResponses);
	void GetCollisionProfileName(class FName ReturnValue);
	void GetCollisionObjectType(enum class ECollisionChannel ReturnValue);
	void GetCollisionEnabled(enum class ECollisionEnabled ReturnValue);
	void GetClosestPointOnCollision(const struct FVector& Point, const struct FVector& OutPointOnBody, class FName BoneName, float ReturnValue);
	void GetCenterOfMass(class FName BoneName, const struct FVector& ReturnValue);
	void GetBodyInstanceAsyncPhysicsTickHandle(class FName BoneName, bool bGetWelded, int32 Index, const struct FBodyInstanceAsyncPhysicsTickHandle& ReturnValue);
	void GetAngularDamping(float ReturnValue);
	void CreateDynamicMaterialInstance(int32 ElementIndex, class UMaterialInterface* SourceMaterial, class FName OptionalName, class UMaterialInstanceDynamic* ReturnValue);
	void CreateAndSetMaterialInstanceDynamicFromMaterial(int32 ElementIndex, class UMaterialInterface* Parent, class UMaterialInstanceDynamic* ReturnValue);
	void CreateAndSetMaterialInstanceDynamic(int32 ElementIndex, class UMaterialInstanceDynamic* ReturnValue);
	void CopyArrayOfMoveIgnoreComponents(const TArray<class UPrimitiveComponent*>& ReturnValue);
	void CopyArrayOfMoveIgnoreActors(const TArray<class AActor*>& ReturnValue);
	void ClearMoveIgnoreComponents();
	void ClearMoveIgnoreActors();
	void CanCharacterStepUp(class APawn* Pawn, bool ReturnValue);
	void AddVelocityChangeImpulseAtLocation(const struct FVector& Impulse, const struct FVector& Location, class FName BoneName);
	void AddTorqueInRadians(const struct FVector& Torque, class FName BoneName, bool bAccelChange);
	void AddTorqueInDegrees(const struct FVector& Torque, class FName BoneName, bool bAccelChange);
	void AddRadialImpulse(const struct FVector& Origin, float Radius, float Strength, enum class ERadialImpulseFalloff Falloff, bool bVelChange);
	void AddRadialForce(const struct FVector& Origin, float Radius, float Strength, enum class ERadialImpulseFalloff Falloff, bool bAccelChange);
	void AddImpulseAtLocation(const struct FVector& Impulse, const struct FVector& Location, class FName BoneName);
	void AddImpulse(const struct FVector& Impulse, class FName BoneName, bool bVelChange);
	void AddForceAtLocationLocal(const struct FVector& Force, const struct FVector& Location, class FName BoneName);
	void AddForceAtLocation(const struct FVector& Force, const struct FVector& Location, class FName BoneName);
	void AddForce(const struct FVector& Force, class FName BoneName, bool bAccelChange);
	void AddAngularImpulseInRadians(const struct FVector& Impulse, class FName BoneName, bool bVelChange);
	void AddAngularImpulseInDegrees(const struct FVector& Impulse, class FName BoneName, bool bVelChange);
};

// 0x0 (0x680 - 0x680)
// Class Engine.FXSystemComponent
class UFXSystemComponent : public UPrimitiveComponent
{
public:

	static class UClass* StaticClass();
	static class UFXSystemComponent* GetDefaultObj();

	void SetVectorParameter(class FName ParameterName, const struct FVector& Param);
	void SetUseAutoManageAttachment(bool bAutoManage);
	void SetIntParameter(class FName ParameterName, int32 Param);
	void SetFloatParameter(class FName ParameterName, float Param);
	void SetEmitterEnable(class FName EmitterName, bool bNewEnableState);
	void SetColorParameter(class FName ParameterName, const struct FLinearColor& Param);
	void SetBoolParameter(class FName ParameterName, bool Param);
	void SetAutoAttachmentParameters(class USceneComponent* Parent, class FName SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule, enum class EAttachmentRule ScaleRule);
	void SetActorParameter(class FName ParameterName, class AActor* Param);
	void ReleaseToPool();
	void GetFXSystemAsset(class UFXSystemAsset* ReturnValue);
};

// 0x8 (0x30 - 0x28)
// Class Engine.BlueprintAsyncActionBase
class UBlueprintAsyncActionBase : public UObject
{
public:
	uint8                                        Pad_52F[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBlueprintAsyncActionBase* GetDefaultObj();

	void Activate();
};

// 0x48 (0x70 - 0x28)
// Class Engine.FXSystemAsset
class UFXSystemAsset : public UObject
{
public:
	uint32                                       MaxPoolSize;                                       // 0x28(0x4)(None)
	uint32                                       PoolPrimeSize;                                     // 0x2C(0x4)(None)
	uint8                                        Pad_533[0x40];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFXSystemAsset* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class Engine.AnimNotifyState
class UAnimNotifyState : public UObject
{
public:
	uint8                                        Pad_544[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bIgnoreOnDediServer;                               // 0x29(0x1)(None)
	bool                                         bCanClobberEventReference;                         // 0x2A(0x1)(None)
	uint8                                        Pad_545[0x5];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotifyState* GetDefaultObj();

	void Received_NotifyTick(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float FrameDeltaTime, const struct FAnimNotifyEventReference& EventReference, bool ReturnValue);
	void Received_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, const struct FAnimNotifyEventReference& EventReference, bool ReturnValue);
	void Received_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration, const struct FAnimNotifyEventReference& EventReference, bool ReturnValue);
	void GetNotifyName(const class FString& ReturnValue);
	void GetDefaultTriggerWeightThreshold(float ReturnValue);
};

// 0x18 (0x40 - 0x28)
// Class Engine.AnimNotify
class UAnimNotify : public UObject
{
public:
	uint8                                        Pad_554[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bIgnoreOnDediServer;                               // 0x38(0x1)(None)
	bool                                         bCanClobberEventReference;                         // 0x39(0x1)(None)
	uint8                                        Pad_555[0x6];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify* GetDefaultObj();

	void Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, const struct FAnimNotifyEventReference& EventReference, bool ReturnValue);
	void GetNotifyName(const class FString& ReturnValue);
	void GetDefaultTriggerWeightThreshold(float ReturnValue);
};

// 0x0 (0x4B8 - 0x4B8)
// Class Engine.TrueSkyActorParent
class ATrueSkyActorParent : public AActor
{
public:

	static class UClass* StaticClass();
	static class ATrueSkyActorParent* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class Engine.Subsystem
class USubsystem : public UObject
{
public:
	uint8                                        Pad_559[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USubsystem* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Engine.DynamicSubsystem
class UDynamicSubsystem : public USubsystem
{
public:

	static class UClass* StaticClass();
	static class UDynamicSubsystem* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Engine.EngineSubsystem
class UEngineSubsystem : public UDynamicSubsystem
{
public:

	static class UClass* StaticClass();
	static class UEngineSubsystem* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Engine.OnlineBlueprintCallProxyBase
class UOnlineBlueprintCallProxyBase : public UBlueprintAsyncActionBase
{
public:

	static class UClass* StaticClass();
	static class UOnlineBlueprintCallProxyBase* GetDefaultObj();

};

// 0x28 (0x50 - 0x28)
// Class Engine.Player
class UPlayer : public UObject
{
public:
	uint8                                        Pad_560[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class APlayerController*                     PlayerController;                                  // 0x30(0x8)(None)
	int32                                        CurrentNetSpeed;                                   // 0x38(0x4)(None)
	int32                                        ConfiguredInternetSpeed;                           // 0x3C(0x4)(None)
	int32                                        ConfiguredLanSpeed;                                // 0x40(0x4)(None)
	uint8                                        Pad_562[0xC];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPlayer* GetDefaultObj();

};

// 0x1D98 (0x1DE8 - 0x50)
// Class Engine.NetConnection
class UNetConnection : public UPlayer
{
public:
	TArray<class UChildConnection*>              Children;                                          // 0x50(0x10)(ZeroConstructor)
	class UNetDriver*                            Driver;                                            // 0x60(0x8)(ZeroConstructor)
	class UClass*                                PackageMapClass;                                   // 0x68(0x8)(ZeroConstructor)
	class UPackageMap*                           PackageMap;                                        // 0x70(0x8)(ZeroConstructor)
	TArray<class UChannel*>                      OpenChannels;                                      // 0x78(0x10)(ZeroConstructor)
	TArray<class AActor*>                        SentTemporaries;                                   // 0x88(0x10)(ZeroConstructor)
	class AActor*                                ViewTarget;                                        // 0x98(0x8)(ZeroConstructor)
	class AActor*                                OwningActor;                                       // 0xA0(0x8)(ZeroConstructor)
	int32                                        MaxPacket;                                         // 0xA8(0x4)(None)
	uint8                                        InternalAck : 1;                                   // Mask: 0x1, PropSize: 0x10xAC(0x1)(None)
	uint8                                        BitPad_5A : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_567[0xBB];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FUniqueNetIdRepl                      PlayerID;                                          // 0x168(0x30)(None)
	uint8                                        Pad_568[0x48];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       LastReceiveTime;                                   // 0x1E0(0x8)(None)
	uint8                                        Pad_569[0x11E0];                                   // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        DefaultMaxChannelSize;                             // 0x13C8(0x4)(None)
	uint8                                        Pad_56A[0x304];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UChannel*>                      ChannelsToTick;                                    // 0x16D0(0x10)(ZeroConstructor)
	uint8                                        Pad_56B[0x700];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bHasArkLoginLock : 1;                              // Mask: 0x1, PropSize: 0x10x1DE0(0x1)(None)
	uint8                                        Pad_56C[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UNetConnection* GetDefaultObj();

};

// 0x768 (0x790 - 0x28)
// Class Engine.NetDriver
class UNetDriver : public UObject
{
public:
	uint8                                        Pad_56D[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                NetConnectionClassName;                            // 0x30(0x10)(None)
	class FString                                ReplicationDriverClassName;                        // 0x40(0x10)(None)
	class FString                                ReplicationBridgeClassName;                        // 0x50(0x10)(None)
	int32                                        MaxDownloadSize;                                   // 0x60(0x4)(None)
	uint8                                        bClampListenServerTickRate : 1;                    // Mask: 0x1, PropSize: 0x10x64(0x1)(None)
	uint8                                        BitPad_5B : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_56E[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NetServerMaxTickRate;                              // 0x68(0x4)(None)
	int32                                        MaxNetTickRate;                                    // 0x6C(0x4)(None)
	int32                                        MaxInternetClientRate;                             // 0x70(0x4)(None)
	int32                                        MaxClientRate;                                     // 0x74(0x4)(None)
	float                                        ServerTravelPause;                                 // 0x78(0x4)(None)
	float                                        SpawnPrioritySeconds;                              // 0x7C(0x4)(None)
	float                                        RelevantTimeout;                                   // 0x80(0x4)(None)
	float                                        KeepAliveTime;                                     // 0x84(0x4)(None)
	float                                        InitialConnectTimeout;                             // 0x88(0x4)(None)
	float                                        ConnectionTimeout;                                 // 0x8C(0x4)(None)
	float                                        TimeoutMultiplierForUnoptimizedBuilds;             // 0x90(0x4)(None)
	uint8                                        Pad_56F[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UNetConnection*                        ServerConnection;                                  // 0x98(0x8)(ZeroConstructor)
	TArray<class UNetConnection*>                ClientConnections;                                 // 0xA0(0x10)(ZeroConstructor)
	uint8                                        Pad_570[0x60];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        RecentlyDisconnectedTrackingTime;                  // 0x110(0x4)(None)
	uint8                                        Pad_571[0x3C];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UWorld*                                World;                                             // 0x150(0x8)(ZeroConstructor)
	class UPackage*                              WorldPackage;                                      // 0x158(0x8)(ZeroConstructor)
	uint8                                        Pad_572[0x20];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                NetConnectionClass;                                // 0x180(0x8)(ZeroConstructor)
	class UClass*                                ReplicationDriverClass;                            // 0x188(0x8)(ZeroConstructor)
	class UClass*                                ReplicationBridgeClass;                            // 0x190(0x8)(ZeroConstructor)
	uint8                                        Pad_573[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  NetDriverName;                                     // 0x1A8(0x8)(None)
	TArray<struct FChannelDefinition>            ChannelDefinitions;                                // 0x1B0(0x10)(ZeroConstructor)
	TMap<class FName, struct FChannelDefinition> ChannelDefinitionMap;                              // 0x1C0(0x50)(ZeroConstructor)
	TArray<class UChannel*>                      ActorChannelPool;                                  // 0x210(0x10)(ZeroConstructor)
	uint8                                        Pad_574[0x21];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        BitPad_5C : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bNoTimeouts : 1;                                   // Mask: 0x40, PropSize: 0x10x241(0x1)(None)
	uint8                                        bNeverApplyNetworkEmulationSettings : 1;           // Mask: 0x80, PropSize: 0x10x241(0x1)(None)
	uint8                                        Pad_575[0x4DE];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UReplicationDriver*                    ReplicationDriver;                                 // 0x720(0x8)(None)
	uint8                                        Pad_576[0x68];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UNetDriver* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.OnlineEngineInterface
class UOnlineEngineInterface : public UObject
{
public:

	static class UClass* StaticClass();
	static class UOnlineEngineInterface* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.OnlineSession
class UOnlineSession : public UObject
{
public:

	static class UClass* StaticClass();
	static class UOnlineSession* GetDefaultObj();

};

// 0x40 (0x6C0 - 0x680)
// Class Engine.MeshComponent
class UMeshComponent : public UPrimitiveComponent
{
public:
	TArray<class UMaterialInterface*>            OverrideMaterials;                                 // 0x680(0x10)(ZeroConstructor)
	class UMaterialInterface*                    OverlayMaterial;                                   // 0x690(0x8)(ZeroConstructor)
	float                                        OverlayMaterialMaxDrawDistance;                    // 0x698(0x4)(None)
	uint8                                        Pad_593[0x14];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bEnableMaterialParameterCaching : 1;               // Mask: 0x1, PropSize: 0x10x6B0(0x1)(None)
	uint8                                        BitPad_5E : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_594[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                DamageFXActorToSpawn;                              // 0x6B8(0x8)(ZeroConstructor)

	static class UClass* StaticClass();
	static class UMeshComponent* GetDefaultObj();

	void SetVectorParameterValueOnMaterials(class FName ParameterName, const struct FVector& ParameterValue);
	void SetScalarParameterValueOnMaterials(class FName ParameterName, float ParameterValue);
	void SetOverlayMaterialMaxDrawDistance(float InMaxDrawDistance);
	void SetOverlayMaterial(class UMaterialInterface* NewOverlayMaterial);
	void PrestreamTextures(float Seconds, bool bPrioritizeCharacterTextures, int32 CinematicTextureGroups);
	void MulticastShowInstance(int32 OriginalIndex);
	void MulticastHideInstance(int32 OriginalIndex, const struct FVector& HitDirection, float Damage, float TotalHealth, bool bCheckHideAttachedDecals);
	void IsMaterialSlotNameValid(class FName MaterialSlotName, bool ReturnValue);
	void GetOverlayMaterial(class UMaterialInterface* ReturnValue);
	void GetMaterialSlotNames(const TArray<class FName>& ReturnValue);
	void GetMaterials(const TArray<class UMaterialInterface*>& ReturnValue);
	void GetMaterialIndex(class FName MaterialSlotName, int32 ReturnValue);
};

// 0x88 (0xB0 - 0x28)
// Class Engine.MaterialExpression
class UMaterialExpression : public UObject
{
public:
	int32                                        MaterialExpressionEditorX;                         // 0x28(0x4)(None)
	int32                                        MaterialExpressionEditorY;                         // 0x2C(0x4)(None)
	class UEdGraphNode*                          GraphNode;                                         // 0x30(0x8)(ZeroConstructor)
	class UMaterialExpression*                   SubgraphExpression;                                // 0x38(0x8)(ZeroConstructor)
	uint8                                        Pad_599[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGuid                                 MaterialExpressionGuid;                            // 0x50(0x10)(None)
	class UMaterial*                             Material;                                          // 0x60(0x8)(ZeroConstructor)
	class UMaterialFunction*                     Function;                                          // 0x68(0x8)(None)
	class FString                                Desc;                                              // 0x70(0x10)(None)
	uint8                                        Pad_59A[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bRealtimePreview : 1;                              // Mask: 0x1, PropSize: 0x10x84(0x1)(None)
	uint8                                        bNeedToUpdatePreview : 1;                          // Mask: 0x2, PropSize: 0x10x84(0x1)(None)
	uint8                                        BitPad_5F : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_59B[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bIsParameterExpression : 1;                        // Mask: 0x1, PropSize: 0x10x88(0x1)(None)
	uint8                                        BitPad_60 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_59C[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bCommentBubbleVisible : 1;                         // Mask: 0x1, PropSize: 0x10x8C(0x1)(None)
	uint8                                        bShowOutputNameOnPin : 1;                          // Mask: 0x2, PropSize: 0x10x8C(0x1)(None)
	uint8                                        bShowMaskColorsOnPin : 1;                          // Mask: 0x4, PropSize: 0x10x8C(0x1)(None)
	uint8                                        bHidePreviewWindow : 1;                            // Mask: 0x8, PropSize: 0x10x8C(0x1)(None)
	uint8                                        bCollapsed : 1;                                    // Mask: 0x10, PropSize: 0x10x8C(0x1)(None)
	uint8                                        bShaderInputData : 1;                              // Mask: 0x20, PropSize: 0x10x8C(0x1)(None)
	uint8                                        bShowInputs : 1;                                   // Mask: 0x40, PropSize: 0x10x8C(0x1)(None)
	uint8                                        bShowOutputs : 1;                                  // Mask: 0x80, PropSize: 0x10x8C(0x1)(None)
	uint8                                        Pad_59E[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FText>                          MenuCategories;                                    // 0x90(0x10)(None)
	TArray<struct FExpressionOutput>             Outputs;                                           // 0xA0(0x10)(None)

	static class UClass* StaticClass();
	static class UMaterialExpression* GetDefaultObj();

};

// 0x48 (0x70 - 0x28)
// Class Engine.Channel
class UChannel : public UObject
{
public:
	class UNetConnection*                        Connection;                                        // 0x28(0x8)(None)
	uint8                                        Pad_59F[0x40];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UChannel* GetDefaultObj();

};

// 0x18 (0x88 - 0x70)
// Class Engine.ControlChannel
class UControlChannel : public UChannel
{
public:
	uint8                                        Pad_5A0[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UControlChannel* GetDefaultObj();

};

// 0x198 (0x1C0 - 0x28)
// Class Engine.GameInstance
class UGameInstance : public UObject
{
public:
	uint8                                        Pad_5B3[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ULocalPlayer*>                  LocalPlayers;                                      // 0x38(0x10)(ZeroConstructor)
	class UOnlineSession*                        OnlineSession;                                     // 0x48(0x8)(ZeroConstructor)
	TArray<class UObject*>                       ReferencedObjects;                                 // 0x50(0x10)(ZeroConstructor)
	uint8                                        Pad_5B4[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnPawnControllerChangedDelegates;                  // 0x78(0x10)(ZeroConstructor)
	uint8                                        Pad_5B6[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnInputDeviceConnectionChange;                     // 0xA0(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnUserInputDevicePairingChange;                    // 0xB0(0x10)(None)
	uint8                                        Pad_5B7[0x100];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UGameInstance* GetDefaultObj();

	void ReceiveShutdown();
	void ReceiveInit();
	void HandleTravelError(enum class ETravelFailure FailureType);
	void HandleNetworkError(enum class ENetworkFailure FailureType, bool bIsServer);
	void DebugRemovePlayer(int32 ControllerId);
	void DebugCreatePlayer(int32 ControllerId);
};

// 0x0 (0x30 - 0x30)
// Class Engine.GameInstanceSubsystem
class UGameInstanceSubsystem : public USubsystem
{
public:

	static class UClass* StaticClass();
	static class UGameInstanceSubsystem* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Engine.WorldSubsystem
class UWorldSubsystem : public USubsystem
{
public:

	static class UClass* StaticClass();
	static class UWorldSubsystem* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Engine.RecentPlayersWorldSubsystemBase
class URecentPlayersWorldSubsystemBase : public UWorldSubsystem
{
public:

	static class UClass* StaticClass();
	static class URecentPlayersWorldSubsystemBase* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.AssetImportData
class UAssetImportData : public UObject
{
public:

	static class UClass* StaticClass();
	static class UAssetImportData* GetDefaultObj();

};

// 0x360 (0xA20 - 0x6C0)
// Class Engine.SkinnedMeshComponent
class USkinnedMeshComponent : public UMeshComponent
{
public:
	uint8                                        Pad_62A[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class USkeletalMesh*                         SkeletalMesh;                                      // 0x6C8(0x8)(ZeroConstructor)
	class USkinnedAsset*                         SkinnedAsset;                                      // 0x6D0(0x8)(ZeroConstructor)
	TWeakObjectPtr<class USkinnedMeshComponent>  LeaderPoseComponent;                               // 0x6D8(0x8)(ZeroConstructor)
	TArray<enum class ESkinCacheUsage>           SkinCacheUsage;                                    // 0x6E0(0x10)(None)
	bool                                         bSetMeshDeformer;                                  // 0x6F0(0x1)(None)
	uint8                                        Pad_62F[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UMeshDeformer*                         MeshDeformer;                                      // 0x6F8(0x8)(ZeroConstructor)
	class UMeshDeformerInstanceSettings*         MeshDeformerInstanceSettings;                      // 0x700(0x8)(ZeroConstructor)
	class UMeshDeformerInstance*                 MeshDeformerInstance;                              // 0x708(0x8)(ZeroConstructor)
	uint8                                        Pad_631[0x178];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UPhysicsAsset*                         PhysicsAssetOverride;                              // 0x888(0x8)(ZeroConstructor)
	int32                                        ForcedLodModel;                                    // 0x890(0x4)(None)
	int32                                        MinLodModel;                                       // 0x894(0x4)(None)
	uint8                                        Pad_632[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        StreamingDistanceMultiplier;                       // 0x8A0(0x4)(None)
	uint8                                        Pad_634[0xC];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FSkelMeshComponentLODInfo>     LODInfo;                                           // 0x8B0(0x10)(None)
	uint8                                        Pad_635[0x24];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EVisibilityBasedAnimTickOption    VisibilityBasedAnimTickOption;                     // 0x8E4(0x1)(None)
	uint8                                        Pad_637[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        BitPad_6D : 3;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bOverrideMinLod : 1;                               // Mask: 0x8, PropSize: 0x10x8E6(0x1)(None)
	uint8                                        bUseBoundsFromLeaderPoseComponent : 1;             // Mask: 0x10, PropSize: 0x10x8E6(0x1)(None)
	uint8                                        bForceWireframe : 1;                               // Mask: 0x20, PropSize: 0x10x8E6(0x1)(None)
	uint8                                        bDisableMorphTarget : 1;                           // Mask: 0x40, PropSize: 0x10x8E6(0x1)(None)
	uint8                                        bHideSkin : 1;                                     // Mask: 0x80, PropSize: 0x10x8E6(0x1)(None)
	uint8                                        bPerBoneMotionBlur : 1;                            // Mask: 0x1, PropSize: 0x10x8E7(0x1)(None)
	uint8                                        bComponentUseFixedSkelBounds : 1;                  // Mask: 0x2, PropSize: 0x10x8E7(0x1)(None)
	uint8                                        bConsiderAllBodiesForBounds : 1;                   // Mask: 0x4, PropSize: 0x10x8E7(0x1)(None)
	uint8                                        bSyncAttachParentLOD : 1;                          // Mask: 0x8, PropSize: 0x10x8E7(0x1)(None)
	uint8                                        bCanHighlightSelectedSections : 1;                 // Mask: 0x10, PropSize: 0x10x8E7(0x1)(None)
	uint8                                        bRecentlyRendered : 1;                             // Mask: 0x20, PropSize: 0x10x8E7(0x1)(None)
	uint8                                        bCastCapsuleDirectShadow : 1;                      // Mask: 0x40, PropSize: 0x10x8E7(0x1)(None)
	uint8                                        bCastCapsuleIndirectShadow : 1;                    // Mask: 0x80, PropSize: 0x10x8E7(0x1)(None)
	uint8                                        bCPUSkinning : 1;                                  // Mask: 0x1, PropSize: 0x10x8E8(0x1)(None)
	uint8                                        bEnableUpdateRateOptimizations : 1;                // Mask: 0x2, PropSize: 0x10x8E8(0x1)(None)
	uint8                                        bDisplayDebugUpdateRateOptimizations : 1;          // Mask: 0x4, PropSize: 0x10x8E8(0x1)(None)
	uint8                                        bRenderStatic : 1;                                 // Mask: 0x8, PropSize: 0x10x8E8(0x1)(None)
	uint8                                        bIgnoreLeaderPoseComponentLOD : 1;                 // Mask: 0x10, PropSize: 0x10x8E8(0x1)(None)
	uint8                                        BitPad_6E : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bCachedLocalBoundsUpToDate : 1;                    // Mask: 0x80, PropSize: 0x10x8E8(0x1)(None)
	uint8                                        bCachedWorldSpaceBoundsUpToDate : 1;               // Mask: 0x1, PropSize: 0x10x8E9(0x1)(None)
	uint8                                        BitPad_6F : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bForceMeshObjectUpdate : 1;                        // Mask: 0x4, PropSize: 0x10x8E9(0x1)(None)
	uint8                                        bForceUpdateDynamicDataImmediately : 1;            // Mask: 0x8, PropSize: 0x10x8E9(0x1)(None)
	uint8                                        BitPad_70 : 4;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        BitPad_71 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bFollowerShouldTickPose : 1;                       // Mask: 0x2, PropSize: 0x10x8EA(0x1)(None)
	uint8                                        BitPad_72 : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_638[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CapsuleIndirectShadowMinVisibility;                // 0x8EC(0x4)(None)
	uint8                                        Pad_639[0x38];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBoxSphereBounds                      CachedWorldOrLocalSpaceBounds;                     // 0x928(0x38)(None)
	struct FMatrix                               CachedWorldToLocalTransform;                       // 0x960(0x80)(None)
	uint8                                        Pad_63A[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bForceUpdateKinematic : 1;                         // Mask: 0x1, PropSize: 0x10x9F8(0x1)(None)
	uint8                                        bChartDistanceFactor : 1;                          // Mask: 0x2, PropSize: 0x10x9F8(0x1)(None)
	uint8                                        bFreeSpaceBasesOnUnregister : 1;                   // Mask: 0x4, PropSize: 0x10x9F8(0x1)(None)
	uint8                                        bForceTickPoseWithinRange : 1;                     // Mask: 0x8, PropSize: 0x10x9F8(0x1)(None)
	uint8                                        bAlwaysUpdateMeshForShadowRendering : 1;           // Mask: 0x10, PropSize: 0x10x9F8(0x1)(None)
	uint8                                        bAddAttachedParentBounds : 1;                      // Mask: 0x20, PropSize: 0x10x9F8(0x1)(None)
	uint8                                        bBasedPawnsTriggerChildTick : 1;                   // Mask: 0x40, PropSize: 0x10x9F8(0x1)(None)
	uint8                                        BitPad_73 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_63B[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ForceTickPoseWithinRangeSquared;                   // 0x9FC(0x4)(None)
	class USkinnedMeshComponent*                 OverrideTickingVisiblityMesh;                      // 0xA00(0x8)(ZeroConstructor)
	float                                        ShadowedRecentlyRenderedBoundsScaleMultiplier;     // 0xA08(0x4)(None)
	uint8                                        Pad_63C[0x14];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USkinnedMeshComponent* GetDefaultObj();

	void UnsetMeshDeformer();
	void UnloadSkinWeightProfile(class FName InProfileName);
	void UnHideBoneByName(class FName BoneName);
	void TransformToBoneSpace(class FName BoneName, const struct FVector& InPosition, const struct FRotator& InRotation, const struct FVector& OutPosition, const struct FRotator& OutRotation);
	void TransformFromBoneSpace(class FName BoneName, const struct FVector& InPosition, const struct FRotator& InRotation, const struct FVector& OutPosition, const struct FRotator& OutRotation);
	void ShowMaterialSection(int32 MaterialID, int32 SectionIndex, bool bShow, int32 LODIndex);
	void ShowAllMaterialSections(int32 LODIndex);
	void SetVertexOffsetUsage(int32 LODIndex, int32 Usage);
	void SetVertexColorOverride_LinearColor(int32 LODIndex, const TArray<struct FLinearColor>& VertexColors);
	void SetSkinWeightProfile(class FName InProfileName, bool ReturnValue);
	void SetSkinWeightOverride(int32 LODIndex, const TArray<struct FSkelMeshSkinWeightInfo>& SkinWeights);
	void SetSkinnedAssetAndUpdate(class USkinnedAsset* NewMesh, bool bReinitPose);
	void SetRenderStatic(bool bNewValue);
	void SetPreSkinningOffsets(int32 LODIndex, const TArray<struct FVector>& Offsets);
	void SetPostSkinningOffsets(int32 LODIndex, const TArray<struct FVector>& Offsets);
	void SetPhysicsAsset(class UPhysicsAsset* NewPhysicsAsset, bool bForceReInit);
	void SetMinLOD(int32 InNewMinLOD);
	void SetMeshDeformer(class UMeshDeformer* InMeshDeformer);
	void SetLeaderPoseComponent(class USkinnedMeshComponent* NewLeaderBoneComponent, bool bForceUpdate, bool bInFollowerShouldTickPose);
	void SetForcedLOD(int32 InNewForcedLOD);
	void SetCastCapsuleIndirectShadow(bool bNewValue);
	void SetCastCapsuleDirectShadow(bool bNewValue);
	void SetCapsuleIndirectShadowMinVisibility(float NewValue);
	void IsUsingSkinWeightProfile(bool ReturnValue);
	void IsMaterialSectionShown(int32 MaterialID, int32 LODIndex, bool ReturnValue);
	void IsBoneHiddenByName(class FName BoneName, bool ReturnValue);
	void HideBoneByName(class FName BoneName, enum class EPhysBodyOp PhysBodyOption);
	void GetVertexOffsetUsage(int32 LODIndex, int32 ReturnValue);
	void GetTwistAndSwingAngleOfDeltaRotationFromRefPose(class FName BoneName, float OutTwistAngle, float OutSwingAngle, bool ReturnValue);
	void GetSocketBoneName(class FName InSocketName, class FName ReturnValue);
	void GetSkinnedAsset(class USkinnedAsset* ReturnValue);
	void GetSkeletalMesh_DEPRECATED(class USkeletalMesh* ReturnValue);
	void GetRefPoseTransform(int32 BoneIndex, const struct FTransform& ReturnValue);
	void GetRefPosePosition(int32 BoneIndex, const struct FVector& ReturnValue);
	void GetPredictedLODLevel(int32 ReturnValue);
	void GetParentBone(class FName BoneName, class FName ReturnValue);
	void GetNumLODs(int32 ReturnValue);
	void GetNumBones(int32 ReturnValue);
	void GetMeshDeformerInstance(class UMeshDeformerInstance* ReturnValue);
	void GetForcedLOD(int32 ReturnValue);
	void GetDeltaTransformFromRefPose(class FName BoneName, class FName BaseName, const struct FTransform& ReturnValue);
	void GetCurrentSkinWeightProfileName(class FName ReturnValue);
	void GetBoneName(int32 BoneIndex, class FName ReturnValue);
	void GetBoneIndex(class FName BoneName, int32 ReturnValue);
	void FindClosestBone_K2(const struct FVector& TestLocation, const struct FVector& BoneLocation, float IgnoreScale, bool bRequirePhysicsAsset, class FName ReturnValue);
	void ClearVertexColorOverride(int32 LODIndex);
	void ClearSkinWeightProfile();
	void ClearSkinWeightOverride(int32 LODIndex);
	void BoneIsChildOf(class FName BoneName, class FName ParentBoneName, bool ReturnValue);
};

// 0x9B8 (0x13D8 - 0xA20)
// Class Engine.SkeletalMeshComponent
class USkeletalMeshComponent : public USkinnedMeshComponent
{
public:
	uint8                                        Pad_69D[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class USkeletalMesh*                         SkeletalMeshAsset;                                 // 0xA28(0x8)(ZeroConstructor)
	class UClass*                                AnimBlueprintGeneratedClass;                       // 0xA30(0x8)(ZeroConstructor)
	class UClass*                                AnimClass;                                         // 0xA38(0x8)(ZeroConstructor)
	class UAnimInstance*                         AnimScriptInstance;                                // 0xA40(0x8)(ZeroConstructor)
	class UAnimInstance*                         PostProcessAnimInstance;                           // 0xA48(0x8)(ZeroConstructor)
	struct FSingleAnimationPlayData              AnimationData;                                     // 0xA50(0x18)(ZeroConstructor)
	uint8                                        Pad_69E[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               RootBoneTranslation;                               // 0xA78(0x18)(None)
	struct FVector                               LineCheckBoundsScale;                              // 0xA90(0x18)(None)
	uint8                                        Pad_69F[0x30];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UAnimInstance*>                 LinkedInstances;                                   // 0xAD8(0x10)(ZeroConstructor)
	TArray<struct FTransform>                    CachedBoneSpaceTransforms;                         // 0xAE8(0x10)(None)
	TArray<struct FTransform>                    CachedComponentSpaceTransforms;                    // 0xAF8(0x10)(None)
	uint8                                        Pad_6A0[0xB0];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        GlobalAnimRateScale;                               // 0xBB8(0x4)(None)
	enum class EKinematicBonesUpdateToPhysics    KinematicBonesUpdateType;                          // 0xBBC(0x1)(None)
	enum class EPhysicsTransformUpdateMode       PhysicsTransformUpdateMode;                        // 0xBBD(0x1)(None)
	uint8                                        Pad_6A1[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	enum class ECollisionEnabled                 PreSleepingKinematicsCollisionType;                // 0xBBF(0x1)(None)
	enum class EAnimationMode                    AnimationMode;                                     // 0xBC0(0x1)(None)
	uint8                                        Pad_6A2[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bDisablePostProcessBlueprint : 1;                  // Mask: 0x1, PropSize: 0x10xBC2(0x1)(None)
	uint8                                        BitPad_74 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bUpdateOverlapsOnAnimationFinalize : 1;            // Mask: 0x4, PropSize: 0x10xBC2(0x1)(None)
	uint8                                        BitPad_75 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bHasValidBodies : 1;                               // Mask: 0x10, PropSize: 0x10xBC2(0x1)(None)
	uint8                                        bBlendPhysics : 1;                                 // Mask: 0x20, PropSize: 0x10xBC2(0x1)(None)
	uint8                                        bEnablePhysicsOnDedicatedServer : 1;               // Mask: 0x40, PropSize: 0x10xBC2(0x1)(None)
	uint8                                        bUpdateMeshWhenKinematic : 1;                      // Mask: 0x80, PropSize: 0x10xBC2(0x1)(None)
	uint8                                        bUpdateJointsFromAnimation : 1;                    // Mask: 0x1, PropSize: 0x10xBC3(0x1)(None)
	uint8                                        bAllowClothActors : 1;                             // Mask: 0x2, PropSize: 0x10xBC3(0x1)(None)
	uint8                                        bDisableClothSimulation : 1;                       // Mask: 0x4, PropSize: 0x10xBC3(0x1)(None)
	uint8                                        BitPad_76 : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_6A3[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bDisableRigidBodyAnimNode : 1;                     // Mask: 0x1, PropSize: 0x10xBC8(0x1)(None)
	uint8                                        bAllowAnimCurveEvaluation : 1;                     // Mask: 0x2, PropSize: 0x10xBC8(0x1)(None)
	uint8                                        BitPad_77 : 3;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bCollideWithEnvironment : 1;                       // Mask: 0x20, PropSize: 0x10xBC8(0x1)(None)
	uint8                                        bCollideWithAttachedChildren : 1;                  // Mask: 0x40, PropSize: 0x10xBC8(0x1)(None)
	uint8                                        bForceCollisionUpdate : 1;                         // Mask: 0x80, PropSize: 0x10xBC8(0x1)(None)
	uint8                                        bLocalSpaceSimulation : 1;                         // Mask: 0x1, PropSize: 0x10xBC9(0x1)(None)
	uint8                                        bResetAfterTeleport : 1;                           // Mask: 0x2, PropSize: 0x10xBC9(0x1)(None)
	uint8                                        BitPad_78 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bDeferKinematicBoneUpdate : 1;                     // Mask: 0x8, PropSize: 0x10xBC9(0x1)(None)
	uint8                                        bNoSkeletonUpdate : 1;                             // Mask: 0x10, PropSize: 0x10xBC9(0x1)(None)
	uint8                                        bPauseAnims : 1;                                   // Mask: 0x20, PropSize: 0x10xBC9(0x1)(None)
	uint8                                        bUseRefPoseOnInitAnim : 1;                         // Mask: 0x40, PropSize: 0x10xBC9(0x1)(None)
	uint8                                        bEnablePerPolyCollision : 1;                       // Mask: 0x80, PropSize: 0x10xBC9(0x1)(None)
	uint8                                        bForceRefpose : 1;                                 // Mask: 0x1, PropSize: 0x10xBCA(0x1)(None)
	uint8                                        bOnlyAllowAutonomousTickPose : 1;                  // Mask: 0x2, PropSize: 0x10xBCA(0x1)(None)
	uint8                                        bIsAutonomousTickPose : 1;                         // Mask: 0x4, PropSize: 0x10xBCA(0x1)(None)
	uint8                                        bOldForceRefPose : 1;                              // Mask: 0x8, PropSize: 0x10xBCA(0x1)(None)
	uint8                                        bShowPrePhysBones : 1;                             // Mask: 0x10, PropSize: 0x10xBCA(0x1)(None)
	uint8                                        bRequiredBonesUpToDate : 1;                        // Mask: 0x20, PropSize: 0x10xBCA(0x1)(None)
	uint8                                        bAnimTreeInitialised : 1;                          // Mask: 0x40, PropSize: 0x10xBCA(0x1)(None)
	uint8                                        bIncludeComponentLocationIntoBounds : 1;           // Mask: 0x80, PropSize: 0x10xBCA(0x1)(None)
	uint8                                        bEnableLineCheckWithBounds : 1;                    // Mask: 0x1, PropSize: 0x10xBCB(0x1)(None)
	uint8                                        bPropagateCurvesToFollowers : 1;                   // Mask: 0x2, PropSize: 0x10xBCB(0x1)(None)
	uint8                                        bSkipKinematicUpdateWhenInterpolating : 1;         // Mask: 0x4, PropSize: 0x10xBCB(0x1)(None)
	uint8                                        bSkipBoundsUpdateWhenInterpolating : 1;            // Mask: 0x8, PropSize: 0x10xBCB(0x1)(None)
	uint8                                        bPreventDediServerAutoUnregistration : 1;          // Mask: 0x10, PropSize: 0x10xBCB(0x1)(None)
	uint8                                        BitPad_79 : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bNeedsQueuedAnimEventsDispatched : 1;              // Mask: 0x80, PropSize: 0x10xBCB(0x1)(None)
	uint8                                        Pad_6A4[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint16                                       CachedAnimCurveUidVersion;                         // 0xBCE(0x2)(None)
	float                                        ClothBlendWeight;                                  // 0xBD0(0x4)(None)
	bool                                         bWaitForParallelClothTask;                         // 0xBD4(0x1)(None)
	uint8                                        Pad_6A5[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FName>                          DisallowedAnimCurves;                              // 0xBD8(0x10)(None)
	class UBodySetup*                            BodySetup;                                         // 0xBE8(0x8)(ZeroConstructor)
	uint8                                        Pad_6A6[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ClothMaxDistanceScale;                             // 0xBF4(0x4)(None)
	FMulticastInlineDelegateProperty_            OnConstraintBroken;                                // 0xBF8(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnPlasticDeformation;                              // 0xC08(0x10)(ZeroConstructor)
	class UClass*                                ClothingSimulationFactory;                         // 0xC18(0x8)(ZeroConstructor)
	uint8                                        Pad_6A7[0xF8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TeleportDistanceThreshold;                         // 0xD18(0x4)(None)
	float                                        TeleportRotationThreshold;                         // 0xD1C(0x4)(None)
	uint8                                        Pad_6A8[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint32                                       LastPoseTickFrame;                                 // 0xD28(0x4)(None)
	uint8                                        Pad_6A9[0x94];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UClothingSimulationInteractor*         ClothingInteractor;                                // 0xDC0(0x8)(ZeroConstructor)
	uint8                                        Pad_6AA[0xC8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnAnimInitialized;                                 // 0xE90(0x10)(ZeroConstructor)
	uint8                                        Pad_6AB[0x1B0];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       PreventSoundCuesTime;                              // 0x1050(0x8)(None)
	uint8                                        Pad_6AC[0x14C];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DinoIKAnimationLegZOffsetingMultiplier;            // 0x11A4(0x4)(None)
	float                                        DinoIKDelayedTraceFreezeDurationMultiplier;        // 0x11A8(0x4)(None)
	float                                        DinoIKSlopeMatchingRootHeightOffset;               // 0x11AC(0x4)(None)
	float                                        DistanceFromGroundToStartIK;                       // 0x11B0(0x4)(None)
	float                                        DistanceFromGroundToStartIKBias;                   // 0x11B4(0x4)(None)
	float                                        FeetAlignmentLimit;                                // 0x11B8(0x4)(None)
	float                                        ForceUpdateValuesTimeLimit;                        // 0x11BC(0x4)(None)
	float                                        IkFabrikInterpSpeed;                               // 0x11C0(0x4)(None)
	float                                        IkFeetAlignmentInterpSpeed;                        // 0x11C4(0x4)(None)
	float                                        IkGroundPlaneInterpSpeed;                          // 0x11C8(0x4)(None)
	float                                        IkInterpSpeed;                                     // 0x11CC(0x4)(None)
	float                                        IkInterpSpeedUp;                                   // 0x11D0(0x4)(None)
	uint8                                        Pad_6AD[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               IkRootLocationOffset;                              // 0x11D8(0x18)(None)
	struct FRotator                              IkRootRotationOffset;                              // 0x11F0(0x18)(None)
	float                                        IkRootOffsetInterpSpeed;                           // 0x1208(0x4)(None)
	float                                        IkRootOffsetInterpSpeedUp;                         // 0x120C(0x4)(None)
	float                                        IkRootWorldOffsetInterpSpeed;                      // 0x1210(0x4)(None)
	float                                        IkRootWorldOffsetInterpSpeedUp;                    // 0x1214(0x4)(None)
	float                                        LegLimitRatioFromCylinderHeight;                   // 0x1218(0x4)(None)
	float                                        MatchSlopeRotationSpeed;                           // 0x121C(0x4)(None)
	float                                        RootPitchRotationLimit;                            // 0x1220(0x4)(None)
	float                                        RootRollRotationLimit;                             // 0x1224(0x4)(None)
	int32                                        MaxIterations;                                     // 0x1228(0x4)(None)
	uint8                                        Pad_6AE[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               TwoLegVirtualHitLocationWS;                        // 0x1230(0x18)(None)
	struct FVector                               TwoLegVirtualHitLocationWSTarget;                  // 0x1248(0x18)(None)
	struct FVector                               TwoLegVirtualHitLocationCS;                        // 0x1260(0x18)(None)
	float                                        RootOffset;                                        // 0x1278(0x4)(None)
	uint8                                        Pad_6AF[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRotator                              RootRotationOffset;                                // 0x1280(0x18)(None)
	uint8                                        bForceTickDisabled : 1;                            // Mask: 0x1, PropSize: 0x10x1298(0x1)(None)
	uint8                                        bFreezeGroundPlaneIK : 1;                          // Mask: 0x2, PropSize: 0x10x1298(0x1)(None)
	uint8                                        bSuppressAnimNotifies : 1;                         // Mask: 0x4, PropSize: 0x10x1298(0x1)(None)
	uint8                                        UseWorldSpaceFeetAlignment : 1;                    // Mask: 0x8, PropSize: 0x10x1298(0x1)(None)
	uint8                                        bRotateFeetToAlignWithGround : 1;                  // Mask: 0x10, PropSize: 0x10x1298(0x1)(None)
	uint8                                        bEnableMultiFabrik : 1;                            // Mask: 0x20, PropSize: 0x10x1298(0x1)(None)
	uint8                                        bDinoIKUseExperimentalInvalidTraceZeroing : 1;     // Mask: 0x40, PropSize: 0x10x1298(0x1)(None)
	uint8                                        bAlignRootOnlyToGround : 1;                        // Mask: 0x80, PropSize: 0x10x1298(0x1)(None)
	uint8                                        bDinoIKAnimationLegZOffseting : 1;                 // Mask: 0x1, PropSize: 0x10x1299(0x1)(None)
	uint8                                        bIKRotationEnabled : 1;                            // Mask: 0x2, PropSize: 0x10x1299(0x1)(None)
	uint8                                        bMovedLastFrame : 1;                               // Mask: 0x4, PropSize: 0x10x1299(0x1)(None)
	uint8                                        bDinoIKLerpFeet : 1;                               // Mask: 0x8, PropSize: 0x10x1299(0x1)(None)
	uint8                                        bDinoIKLerpLegs : 1;                               // Mask: 0x10, PropSize: 0x10x1299(0x1)(None)
	uint8                                        bDinoIKRootWorldSpaceLerpZ : 1;                    // Mask: 0x20, PropSize: 0x10x1299(0x1)(None)
	uint8                                        bDinoIKSmoothGroundPlaneLerping : 1;               // Mask: 0x40, PropSize: 0x10x1299(0x1)(None)
	uint8                                        bDinoIKSlopeMatchingRootHeightOffsetMultiplier : 1; // Mask: 0x80, PropSize: 0x10x1299(0x1)(None)
	uint8                                        bDinoIKUseLegLimits : 1;                           // Mask: 0x1, PropSize: 0x10x129A(0x1)(None)
	uint8                                        bEnableIkOnlyWhenIdle : 1;                         // Mask: 0x2, PropSize: 0x10x129A(0x1)(None)
	uint8                                        bEnableSimpleIK : 1;                               // Mask: 0x4, PropSize: 0x10x129A(0x1)(None)
	uint8                                        bForceSimpleIK : 1;                                // Mask: 0x8, PropSize: 0x10x129A(0x1)(None)
	uint8                                        bSetAttachmentMasterPoseComponent : 1;             // Mask: 0x10, PropSize: 0x10x129A(0x1)(None)
	uint8                                        bInterpolateRootPhys : 1;                          // Mask: 0x20, PropSize: 0x10x129A(0x1)(None)
	uint8                                        BitPad_7A : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_6B1[0x35];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                OriginalBonesOffsets;                              // 0x12D0(0x10)(None)
	TArray<struct FIKLegInfo>                    IkLegs;                                            // 0x12E0(0x10)(None)
	TArray<struct FIKGroundPlaneOverrideInfo>    IkGroundPlaneOverrides;                            // 0x12F0(0x10)(None)
	TArray<struct FIKRootAdjustmentInfo>         IkRootAdjustmentPoints;                            // 0x1300(0x10)(None)
	float                                        MinHitNormalZForFeetAlignment;                     // 0x1310(0x4)(None)
	float                                        ComponentMassScale;                                // 0x1314(0x4)(None)
	float                                        GroundBoneInstantSyncTillTime;                     // 0x1318(0x4)(None)
	float                                        MinLinearDamping;                                  // 0x131C(0x4)(None)
	float                                        MinAngularDamping;                                 // 0x1320(0x4)(None)
	float                                        CachedFootZDiff;                                   // 0x1324(0x4)(None)
	uint8                                        bOnlyTickWhenRenderedDontDisableOnDedicatedServer : 1; // Mask: 0x1, PropSize: 0x10x1328(0x1)(None)
	uint8                                        bSkipUpdateTransformIfBlendedPhysics : 1;          // Mask: 0x2, PropSize: 0x10x1328(0x1)(None)
	uint8                                        AnimationFrozen : 1;                               // Mask: 0x4, PropSize: 0x10x1328(0x1)(None)
	uint8                                        bInitOffset : 1;                                   // Mask: 0x8, PropSize: 0x10x1328(0x1)(None)
	uint8                                        bUpdatedKinematics : 1;                            // Mask: 0x10, PropSize: 0x10x1328(0x1)(None)
	uint8                                        bUpdatedKinematicsOnce : 1;                        // Mask: 0x20, PropSize: 0x10x1328(0x1)(None)
	uint8                                        bSetKinematicsSleeping : 1;                        // Mask: 0x40, PropSize: 0x10x1328(0x1)(None)
	uint8                                        bNeverTickOnDediServer : 1;                        // Mask: 0x80, PropSize: 0x10x1328(0x1)(None)
	uint8                                        bAlwaysTeleportKinematic : 1;                      // Mask: 0x1, PropSize: 0x10x1329(0x1)(None)
	uint8                                        bForceDisablePhysicsOnDediServer : 1;              // Mask: 0x2, PropSize: 0x10x1329(0x1)(None)
	uint8                                        bForceDisablePhysicsOnDediServerAllowRagdoll : 1;  // Mask: 0x4, PropSize: 0x10x1329(0x1)(None)
	uint8                                        bSleepKinematicsWhenNotRefreshingBones : 1;        // Mask: 0x8, PropSize: 0x10x1329(0x1)(None)
	uint8                                        bPhysicsRequiredOnDediServer : 1;                  // Mask: 0x10, PropSize: 0x10x1329(0x1)(None)
	uint8                                        bAlwaysForceUpdateKinematicsOnDedicatedServer : 1; // Mask: 0x20, PropSize: 0x10x1329(0x1)(None)
	uint8                                        bRotateToMatchWalkingSlope : 1;                    // Mask: 0x40, PropSize: 0x10x1329(0x1)(None)
	uint8                                        bFootZDiffIsCached : 1;                            // Mask: 0x80, PropSize: 0x10x1329(0x1)(None)
	uint8                                        bShouldCacheFootZDiff : 1;                         // Mask: 0x1, PropSize: 0x10x132A(0x1)(None)
	uint8                                        bEnableIKTraceFreezing : 1;                        // Mask: 0x2, PropSize: 0x10x132A(0x1)(None)
	uint8                                        BitPad_7B : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_6B2[0x5];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bModifyBoneAnimNodeUseCurrentBoneModifiers : 1;    // Mask: 0x1, PropSize: 0x10x1330(0x1)(None)
	uint8                                        BitPad_7C : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bHumanIKUseBoneModiferLegScalars : 1;              // Mask: 0x4, PropSize: 0x10x1330(0x1)(None)
	uint8                                        bApplyGroundBoneModifiers : 1;                     // Mask: 0x8, PropSize: 0x10x1330(0x1)(None)
	uint8                                        BitPad_7D : 4;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_6B3[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bEnableIKCartGroundConforming : 1;                 // Mask: 0x1, PropSize: 0x10x1334(0x1)(None)
	uint8                                        BitPad_7E : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_6B4[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRotator                              RotOffset;                                         // 0x1338(0x18)(None)
	uint8                                        bUseRotOffset : 1;                                 // Mask: 0x1, PropSize: 0x10x1350(0x1)(None)
	uint8                                        bUseItemSlotAttachmentTranformOffsets : 1;         // Mask: 0x2, PropSize: 0x10x1350(0x1)(None)
	uint8                                        bInitializedArticulated : 1;                       // Mask: 0x4, PropSize: 0x10x1350(0x1)(None)
	uint8                                        BitPad_7F : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_6B5[0xF];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BoneModifiersLegLengthPercentage;                  // 0x1360(0x4)(None)
	uint8                                        Pad_6B6[0x24];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       LastStartedRenderingTime;                          // 0x1388(0x8)(None)
	uint8                                        Pad_6B7[0x48];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USkeletalMeshComponent* GetDefaultObj();

	void UnlinkAnimClassLayers(class UClass* InClass);
	void UnbindClothFromLeaderPoseComponent(bool bRestoreSimulationSpace);
	void ToggleDisablePostProcessBlueprint();
	void TermBodiesBelow(class FName ParentBoneName);
	void SuspendClothingSimulation();
	void Stop();
	void SnapshotPose(const struct FPoseSnapshot& Snapshot);
	void SetUpdateClothInEditor(bool NewUpdateState);
	void SetUpdateAnimationInEditor(bool NewUpdateState);
	void SetupBetweenAnimationBlueprintBlending();
	void SetTeleportRotationThreshold(float Threshold);
	void SetTeleportDistanceThreshold(float Threshold);
	void SetSkeletalMeshAsset(class USkeletalMesh* NewMesh);
	void SetPosition(float InPos, bool bFireNotifies);
	void SetPlayRate(float Rate);
	void SetPhysicsBlendWeight(float PhysicsBlendWeight);
	void SetNotifyRigidBodyCollisionBelow(bool bNewNotifyRigidBodyCollision, class FName BoneName, bool bIncludeSelf);
	void SetMorphTarget(class FName MorphTargetName, float Value, bool bRemoveZeroWeight);
	void SetEnablePhysicsBlending(bool bNewBlendPhysics);
	void SetEnableGravityOnAllBodiesBelow(bool bEnableGravity, class FName BoneName, bool bIncludeSelf);
	void SetEnableBodyGravity(bool bEnableGravity, class FName BoneName);
	void SetDisablePostProcessBlueprint(bool bInDisablePostProcess);
	void SetDisableAnimCurves(bool bInDisableAnimCurves);
	void SetConstraintProfileForAll(class FName ProfileName, bool bDefaultIfNotFound);
	void SetConstraintProfile(class FName JointName, class FName ProfileName, bool bDefaultIfNotFound);
	void SetClothMaxDistanceScale(float Scale);
	void SetBodyNotifyRigidBodyCollision(bool bNewNotifyRigidBodyCollision, class FName BoneName);
	void SetAnimClass(class UClass* NewClass);
	void SetAnimationMode(enum class EAnimationMode InAnimationMode);
	void SetAnimation(class UAnimationAsset* NewAnimToPlay);
	void SetAngularLimits(class FName InBoneName, float Swing1LimitAngle, float TwistLimitAngle, float Swing2LimitAngle);
	void SetAllowRigidBodyAnimNode(bool bInAllow, bool bReinitAnim);
	void SetAllowedAnimCurvesEvaluation(const TArray<class FName>& List, bool bAllow);
	void SetAllowClothActors(bool bInAllow);
	void SetAllowAnimCurveEvaluation(bool bInAllow);
	void SetAllMotorsAngularVelocityDrive(bool bEnableSwingDrive, bool bEnableTwistDrive, bool bSkipCustomPhysicsType);
	void SetAllMotorsAngularPositionDrive(bool bEnableSwingDrive, bool bEnableTwistDrive, bool bSkipCustomPhysicsType);
	void SetAllMotorsAngularDriveParams(float InSpring, float InDamping, float InForceLimit, bool bSkipCustomPhysicsType);
	void SetAllBodiesSimulatePhysics(bool bNewSimulate);
	void SetAllBodiesPhysicsBlendWeight(float PhysicsBlendWeight, bool bSkipCustomPhysicsType);
	void SetAllBodiesBelowSimulatePhysics(class FName InBoneName, bool bNewSimulate, bool bIncludeSelf);
	void SetAllBodiesBelowPhysicsDisabled(class FName InBoneName, bool bDisabled, bool bIncludeSelf);
	void SetAllBodiesBelowPhysicsBlendWeight(class FName InBoneName, float PhysicsBlendWeight, bool bSkipCustomPhysicsType, bool bIncludeSelf);
	void SetAllBodiesBelowLinearVelocity(class FName InBoneName, const struct FVector& LinearVelocity, bool bIncludeSelf);
	void ResumeClothingSimulation();
	void ResetClothTeleportMode();
	void ResetAnimInstanceDynamics(enum class ETeleportType InTeleportType);
	void ResetAllowedAnimCurveEvaluation();
	void ResetAllBodiesSimulatePhysics();
	void PlayAnimation(class UAnimationAsset* NewAnimToPlay, bool bLooping);
	void Play(bool bLooping);
	void OverrideAnimationData(class UAnimationAsset* InAnimToPlay, bool bIsLooping, bool bIsPlaying, float Position, float PlayRate);
	void LinkAnimGraphByTag(class FName InTag, class UClass* InClass);
	void LinkAnimClassLayers(class UClass* InClass);
	void K2_GetClosestPointOnPhysicsAsset(const struct FVector& WorldPosition, const struct FVector& ClosestWorldPosition, const struct FVector& Normal, class FName BoneName, float Distance, bool ReturnValue);
	void IsPlayingMontage(class UAnimMontage* Montage, float TimeFromEndToConsiderFinished, bool ReturnValue);
	void IsPlayingAnimationMontagesOnSlotName(class FName SlotName, bool ReturnValue);
	void IsPlaying(bool ReturnValue);
	void IsClothingSimulationSuspended(bool ReturnValue);
	void IsBodyGravityEnabled(class FName BoneName, bool ReturnValue);
	void IncrementIKLegMute(int32 LegIndex);
	void HasValidAnimationInstance(bool ReturnValue);
	void GetTrueBasedPawns(const TArray<class APawn*>& ReturnValue);
	void GetTransformAttribute_Ref(class FName BoneName, class FName AttributeName, const struct FTransform& OutValue, enum class ECustomBoneAttributeLookup LookupType, bool ReturnValue);
	void GetTransformAttribute(class FName BoneName, class FName AttributeName, const struct FTransform& DefaultValue, const struct FTransform& OutValue, enum class ECustomBoneAttributeLookup LookupType, bool ReturnValue);
	void GetTeleportRotationThreshold(float ReturnValue);
	void GetTeleportDistanceThreshold(float ReturnValue);
	void GetStringAttribute_Ref(class FName BoneName, class FName AttributeName, const class FString& OutValue, enum class ECustomBoneAttributeLookup LookupType, bool ReturnValue);
	void GetStringAttribute(class FName BoneName, class FName AttributeName, const class FString& DefaultValue, const class FString& OutValue, enum class ECustomBoneAttributeLookup LookupType, bool ReturnValue);
	void GetSkeletalMeshAsset(class USkeletalMesh* ReturnValue);
	void GetSkeletalCenterOfMass(const struct FVector& ReturnValue);
	void GetPostProcessInstance(class UAnimInstance* ReturnValue);
	void GetPosition(float ReturnValue);
	void GetPlayRate(float ReturnValue);
	void GetMorphTarget(class FName MorphTargetName, float ReturnValue);
	void GetLinkedAnimLayerInstanceByGroup(class FName InGroup, class UAnimInstance* ReturnValue);
	void GetLinkedAnimLayerInstanceByClass(class UClass* InClass, class UAnimInstance* ReturnValue);
	void GetLinkedAnimGraphInstancesByTag(class FName InTag, const TArray<class UAnimInstance*>& OutLinkedInstances);
	void GetLinkedAnimGraphInstanceByTag(class FName InTag, class UAnimInstance* ReturnValue);
	void GetIntegerAttribute_Ref(class FName BoneName, class FName AttributeName, int32 OutValue, enum class ECustomBoneAttributeLookup LookupType, bool ReturnValue);
	void GetIntegerAttribute(class FName BoneName, class FName AttributeName, int32 DefaultValue, int32 OutValue, enum class ECustomBoneAttributeLookup LookupType, bool ReturnValue);
	void GetFloatAttribute_Ref(class FName BoneName, class FName AttributeName, float OutValue, enum class ECustomBoneAttributeLookup LookupType, bool ReturnValue);
	void GetFloatAttribute(class FName BoneName, class FName AttributeName, float DefaultValue, float OutValue, enum class ECustomBoneAttributeLookup LookupType, bool ReturnValue);
	void GetFirstBoneWithChildren(class FName ReturnValue);
	void GetDisablePostProcessBlueprint(bool ReturnValue);
	void GetDisableAnimCurves(bool ReturnValue);
	void GetCurrentJointAngles(class FName InBoneName, float Swing1Angle, float TwistAngle, float Swing2Angle);
	void GetConstraintsFromBody(class FName BodyName, bool bParentConstraints, bool bChildConstraints, bool bIncludesTerminated, const TArray<struct FConstraintInstanceAccessor>& OutConstraints);
	void GetConstraints(bool bIncludesTerminated, const TArray<struct FConstraintInstanceAccessor>& OutConstraints);
	void GetConstraintByName(class FName ConstraintName, bool bIncludesTerminated, const struct FConstraintInstanceAccessor& ReturnValue);
	void GetClothMaxDistanceScale(float ReturnValue);
	void GetClothingSimulationInteractor(class UClothingSimulationInteractor* ReturnValue);
	void GetBoneMass(class FName BoneName, bool bScaleMass, float ReturnValue);
	void GetBoneLinearVelocity(class FName InBoneName, const struct FVector& ReturnValue);
	void GetAnimInstance(class UAnimInstance* ReturnValue);
	void GetAnimClass(class UClass* ReturnValue);
	void GetAnimationMode(enum class EAnimationMode ReturnValue);
	void GetAllowRigidBodyAnimNode(bool ReturnValue);
	void GetAllowedAnimCurveEvaluate(bool ReturnValue);
	void GetAllowClothActors(bool ReturnValue);
	void ForceClothNextUpdateTeleportAndReset();
	void ForceClothNextUpdateTeleport();
	void FindConstraintBoneName(int32 ConstraintIndex, class FName ReturnValue);
	void EnableRagdoll(const struct FVector& WithVelocity);
	void DecrementIKLegMute(int32 LegIndex);
	void ClearMorphTargets();
	void BreakConstraint(const struct FVector& Impulse, const struct FVector& HitLocation, class FName InBoneName);
	void BPValidBoneToUnhide(int32 BoneIndex, bool ReturnValue);
	void BPTickPose(float DeltaTime);
	void BPSetBoneModifiers(const TArray<struct FBoneModifierNamed>& NamedBoneModifiers);
	void BPRefreshBoneTransforms();
	void BindClothToLeaderPoseComponent();
	void AllowAnimCurveEvaluation(class FName NameOfCurve, bool bAllow);
	void AddImpulseToAllBodiesBelow(const struct FVector& Impulse, class FName BoneName, bool bVelChange, bool bIncludeSelf);
	void AddForceToAllBodiesBelow(const struct FVector& Force, class FName BoneName, bool bAccelChange, bool bIncludeSelf);
	void AccumulateAllBodiesBelowPhysicsBlendWeight(class FName InBoneName, float AddPhysicsBlendWeight, bool bSkipCustomPhysicsType);
};

// 0x320 (0x348 - 0x28)
// Class Engine.AnimInstance
class UAnimInstance : public UObject
{
public:
	class USkeleton*                             CurrentSkeleton;                                   // 0x28(0x8)(ZeroConstructor)
	enum class ERootMotionMode                   RootMotionMode;                                    // 0x30(0x1)(None)
	uint8                                        bUseMultiThreadedAnimationUpdate : 1;              // Mask: 0x1, PropSize: 0x10x31(0x1)(None)
	uint8                                        bUsingCopyPoseFromMesh : 1;                        // Mask: 0x2, PropSize: 0x10x31(0x1)(None)
	uint8                                        BitPad_80 : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bReceiveNotifiesFromLinkedInstances : 1;           // Mask: 0x10, PropSize: 0x10x31(0x1)(None)
	uint8                                        bPropagateNotifiesToLinkedInstances : 1;           // Mask: 0x20, PropSize: 0x10x31(0x1)(None)
	uint8                                        bUseMainInstanceMontageEvaluationData : 1;         // Mask: 0x40, PropSize: 0x10x31(0x1)(None)
	uint8                                        bQueueMontageEvents : 1;                           // Mask: 0x80, PropSize: 0x10x31(0x1)(None)
	uint8                                        Pad_775[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnMontageBlendingOut;                              // 0x38(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnMontageStarted;                                  // 0x48(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnMontageEnded;                                    // 0x58(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnAllMontageInstancesEnded;                        // 0x68(0x10)(ZeroConstructor)
	uint8                                        Pad_777[0xD8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNotifyQueue                      NotifyQueue;                                       // 0x150(0x70)(ZeroConstructor)
	TArray<struct FAnimNotifyEvent>              ActiveAnimNotifyState;                             // 0x1C0(0x10)(ZeroConstructor)
	TArray<struct FAnimNotifyEventReference>     ActiveAnimNotifyEventReference;                    // 0x1D0(0x10)(None)
	uint8                                        Pad_778[0x168];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimInstance* GetDefaultObj();

	void WasAnimNotifyTriggeredInStateMachine(int32 MachineIndex, class UClass* AnimNotifyType, bool ReturnValue);
	void WasAnimNotifyTriggeredInSourceState(int32 MachineIndex, int32 StateIndex, class UClass* AnimNotifyType, bool ReturnValue);
	void WasAnimNotifyTriggeredInAnyState(class UClass* AnimNotifyType, bool ReturnValue);
	void WasAnimNotifyStateActiveInStateMachine(int32 MachineIndex, class UClass* AnimNotifyStateType, bool ReturnValue);
	void WasAnimNotifyStateActiveInSourceState(int32 MachineIndex, int32 StateIndex, class UClass* AnimNotifyStateType, bool ReturnValue);
	void WasAnimNotifyStateActiveInAnyState(class UClass* AnimNotifyStateType, bool ReturnValue);
	void WasAnimNotifyNameTriggeredInStateMachine(int32 MachineIndex, class FName NotifyName, bool ReturnValue);
	void WasAnimNotifyNameTriggeredInSourceState(int32 MachineIndex, int32 StateIndex, class FName NotifyName, bool ReturnValue);
	void WasAnimNotifyNameTriggeredInAnyState(class FName NotifyName, bool ReturnValue);
	void UnlockAIResources(bool bUnlockMovement, bool UnlockAILogic);
	void UnlinkAnimClassLayers(class UClass* InClass);
	void TryGetPawnOwner(class APawn* ReturnValue);
	void StopSlotAnimation(float InBlendOutTime, class FName SlotNodeName);
	void SnapshotPose(const struct FPoseSnapshot& Snapshot);
	void SetUseMainInstanceMontageEvaluationData(bool bSet);
	void SetRootMotionMode(enum class ERootMotionMode Value);
	void SetReceiveNotifiesFromLinkedInstances(bool bSet);
	void SetPropagateNotifiesToLinkedInstances(bool bSet);
	void SetMorphTarget(class FName MorphTargetName, float Value);
	void SavePoseSnapshot(class FName SnapshotName);
	void ResetDynamics(enum class ETeleportType InTeleportType);
	void RequestTransitionEvent(class FName EventName, double RequestTimeout, enum class ETransitionRequestQueueMode QueueMode, enum class ETransitionRequestOverwriteMode OverwriteMode, bool ReturnValue);
	void RequestSlotGroupInertialization(class FName InSlotGroupName, float Duration, class UBlendProfile* BlendProfile);
	void RemovePoseSnapshot(class FName SnapshotName);
	void QueryTransitionEvent(int32 MachineIndex, int32 TransitionIndex, class FName EventName, bool ReturnValue);
	void QueryAndMarkTransitionEvent(int32 MachineIndex, int32 TransitionIndex, class FName EventName, bool ReturnValue);
	void PlaySlotAnimationAsDynamicMontage_WithBlendSettings(class UAnimSequenceBase* Asset, class FName SlotNodeName, const struct FMontageBlendSettings& BlendInSettings, const struct FMontageBlendSettings& BlendOutSettings, float InPlayRate, int32 LoopCount, float BlendOutTriggerTime, float InTimeToStartMontageAt, class UAnimMontage* ReturnValue);
	void PlaySlotAnimationAsDynamicMontage_WithBlendArgs(class UAnimSequenceBase* Asset, class FName SlotNodeName, const struct FAlphaBlendArgs& BlendIn, const struct FAlphaBlendArgs& BlendOut, float InPlayRate, int32 LoopCount, float BlendOutTriggerTime, float InTimeToStartMontageAt, class UAnimMontage* ReturnValue);
	void PlaySlotAnimationAsDynamicMontage(class UAnimSequenceBase* Asset, class FName SlotNodeName, float BlendInTime, float BlendOutTime, float InPlayRate, int32 LoopCount, float BlendOutTriggerTime, float InTimeToStartMontageAt, class UAnimMontage* ReturnValue);
	void OnCharacterStepped(const struct FVector& PrevLocation, const struct FVector& NewLocation);
	void MontageSync_StopFollowing(class UAnimMontage* MontageFollower);
	void MontageSync_Follow(class UAnimMontage* MontageFollower, class UAnimInstance* OtherAnimInstance, class UAnimMontage* MontageLeader);
	void Montage_StopWithBlendSettings(const struct FMontageBlendSettings& BlendOutSettings, class UAnimMontage* Montage);
	void Montage_StopWithBlendOut(const struct FAlphaBlendArgs& BlendOut, class UAnimMontage* Montage);
	void Montage_StopGroupByName(float InBlendOutTime, class FName GroupName);
	void Montage_Stop(float InBlendOutTime, class UAnimMontage* Montage);
	void Montage_SetPosition(class UAnimMontage* Montage, float NewPosition);
	void Montage_SetPlayRate(class UAnimMontage* Montage, float NewPlayRate);
	void Montage_SetNextSection(class FName SectionNameToChange, class FName NextSection, class UAnimMontage* Montage);
	void Montage_Resume(class UAnimMontage* Montage);
	void Montage_PlayWithBlendSettings(class UAnimMontage* MontageToPlay, const struct FMontageBlendSettings& BlendInSettings, float InPlayRate, enum class EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages, float ReturnValue);
	void Montage_PlayWithBlendIn(class UAnimMontage* MontageToPlay, const struct FAlphaBlendArgs& BlendIn, float InPlayRate, enum class EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages, float ReturnValue);
	void Montage_Play_WithBlending(class UAnimMontage* MontageToPlay, float BlendInTime, float BlendOutTime, float InPlayRate, bool bPauseOnFinish, float ReturnValue);
	void Montage_Play(class UAnimMontage* MontageToPlay, float InPlayRate, enum class EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages, bool bPauseOnFinish, float ReturnValue);
	void Montage_Pause(class UAnimMontage* Montage);
	void Montage_JumpToSectionsEnd(class FName SectionName, class UAnimMontage* Montage);
	void Montage_JumpToSection(class FName SectionName, class UAnimMontage* Montage);
	void Montage_IsPlaying(class UAnimMontage* Montage, float TimeFromEndToConsiderFinished, bool ReturnValue);
	void Montage_IsActive(class UAnimMontage* Montage, bool ReturnValue);
	void Montage_GetPosition(class UAnimMontage* Montage, float ReturnValue);
	void Montage_GetPlayRate(class UAnimMontage* Montage, float ReturnValue);
	void Montage_GetIsStopped(class UAnimMontage* Montage, bool ReturnValue);
	void Montage_GetEffectivePlayRate(class UAnimMontage* Montage, float ReturnValue);
	void Montage_GetCurrentTime(class UAnimMontage* Montage, float MontageTimeRemaining, float TotalMontageDuration, bool ReturnValue);
	void Montage_GetCurrentSection(class UAnimMontage* Montage, class FName ReturnValue);
	void Montage_GetBlendTime(class UAnimMontage* Montage, float ReturnValue);
	void LockAIResources(bool bLockMovement, bool LockAILogic);
	void LinkAnimGraphByTag(class FName InTag, class UClass* InClass);
	void LinkAnimClassLayers(class UClass* InClass);
	void IsUsingRootTransform(bool ReturnValue);
	void IsUsingMainInstanceMontageEvaluationData(bool ReturnValue);
	void IsSyncGroupBetweenMarkers(class FName InSyncGroupName, class FName PreviousMarker, class FName NextMarker, bool bRespectMarkerOrder, bool ReturnValue);
	void IsPlayingSlotAnimation(class UAnimSequenceBase* Asset, class FName SlotNodeName, bool ReturnValue);
	void IsAnyMontagePlaying(bool ReturnValue);
	void HasMarkerBeenHitThisFrame(class FName SyncGroup, class FName MarkerName, bool ReturnValue);
	void GetTimeToClosestMarker(class FName SyncGroup, class FName MarkerName, float OutMarkerTime, bool ReturnValue);
	void GetSyncGroupPosition(class FName InSyncGroupName, const struct FMarkerSyncAnimPosition& ReturnValue);
	void GetRelevantAnimTimeRemainingFraction(int32 MachineIndex, int32 StateIndex, float ReturnValue);
	void GetRelevantAnimTimeRemaining(int32 MachineIndex, int32 StateIndex, float ReturnValue);
	void GetRelevantAnimTimeFraction(int32 MachineIndex, int32 StateIndex, float ReturnValue);
	void GetRelevantAnimTime(int32 MachineIndex, int32 StateIndex, float ReturnValue);
	void GetRelevantAnimLength(int32 MachineIndex, int32 StateIndex, float ReturnValue);
	void GetReceiveNotifiesFromLinkedInstances(bool ReturnValue);
	void GetPropagateNotifiesToLinkedInstances(bool ReturnValue);
	void GetOwningComponent(class USkeletalMeshComponent* ReturnValue);
	void GetOwningActor(class AActor* ReturnValue);
	void GetLinkedAnimLayerInstancesByGroup(class FName InGroup, const TArray<class UAnimInstance*>& OutLinkedInstances);
	void GetLinkedAnimLayerInstanceByGroupAndClass(class FName InGroup, class UClass* InClass, class UAnimInstance* ReturnValue);
	void GetLinkedAnimLayerInstanceByGroup(class FName InGroup, class UAnimInstance* ReturnValue);
	void GetLinkedAnimLayerInstanceByClass(class UClass* InClass, class UAnimInstance* ReturnValue);
	void GetLinkedAnimGraphInstancesByTag(class FName InTag, const TArray<class UAnimInstance*>& OutLinkedInstances);
	void GetLinkedAnimGraphInstanceByTag(class FName InTag, class UAnimInstance* ReturnValue);
	void GetInstanceTransitionTimeElapsedFraction(int32 MachineIndex, int32 TransitionIndex, float ReturnValue);
	void GetInstanceTransitionTimeElapsed(int32 MachineIndex, int32 TransitionIndex, float ReturnValue);
	void GetInstanceTransitionCrossfadeDuration(int32 MachineIndex, int32 TransitionIndex, float ReturnValue);
	void GetInstanceStateWeight(int32 MachineIndex, int32 StateIndex, float ReturnValue);
	void GetInstanceMachineWeight(int32 MachineIndex, float ReturnValue);
	void GetInstanceCurrentStateElapsedTime(int32 MachineIndex, float ReturnValue);
	void GetInstanceAssetPlayerTimeFromEndFraction(int32 AssetPlayerIndex, float ReturnValue);
	void GetInstanceAssetPlayerTimeFromEnd(int32 AssetPlayerIndex, float ReturnValue);
	void GetInstanceAssetPlayerTimeFraction(int32 AssetPlayerIndex, float ReturnValue);
	void GetInstanceAssetPlayerTime(int32 AssetPlayerIndex, float ReturnValue);
	void GetInstanceAssetPlayerLength(int32 AssetPlayerIndex, float ReturnValue);
	void GetDeltaSeconds(float ReturnValue);
	void GetCurveValueWithDefault(class FName CurveName, float DefaultValue, float OutValue, bool ReturnValue);
	void GetCurveValue(class FName CurveName, float ReturnValue);
	void GetCurrentStateName(int32 MachineIndex, class FName ReturnValue);
	void GetCurrentActiveMontage(class UAnimMontage* ReturnValue);
	void GetAllCurveNames(const TArray<class FName>& OutNames);
	void GetActiveCurveNames(enum class EAnimCurveType CurveType, const TArray<class FName>& OutNames);
	void ControlRigNotify(class FName NotifyName, class FName NotifyCustomTag, const struct FHitResult& WorldSpaceHitResult, const struct FVector& Velocity);
	void ClearTransitionEvents(class FName EventName);
	void ClearMorphTargets();
	void ClearAllTransitionEvents();
	void CalculateDirection(const struct FVector& Velocity, const struct FRotator& BaseRotation, float ReturnValue);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintTriggerAnimationEvent(class FName AnimationEventName, float PlayedAnimLength);
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime);
	void BlueprintPostEvaluateAnimation();
	void BlueprintPlayAnimationEvent(class UAnimMontage* AnimationMontage, float PlayRate, bool bPauseOnFinish, float StartPosition, float PlayedAnimLength);
	void BlueprintLinkedAnimationLayersInitialized();
	void BlueprintInitializeAnimation();
	void BlueprintBeginPlay();
};

// 0x150 (0x370 - 0x220)
// Class Engine.BlueprintGeneratedClass
class UBlueprintGeneratedClass : public UClass
{
public:
	uint8                                        Pad_7B0[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NumReplicatedProperties;                           // 0x228(0x4)(None)
	uint8                                        bHasNativizedParent : 1;                           // Mask: 0x1, PropSize: 0x10x22C(0x1)(None)
	uint8                                        bHasCookedComponentInstancingData : 1;             // Mask: 0x2, PropSize: 0x10x22C(0x1)(None)
	uint8                                        BitPad_81 : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_7B1[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UDynamicBlueprintBinding*>      DynamicBindingObjects;                             // 0x230(0x10)(ZeroConstructor)
	TArray<class UActorComponent*>               ComponentTemplates;                                // 0x240(0x10)(ZeroConstructor)
	TArray<class UTimelineTemplate*>             Timelines;                                         // 0x250(0x10)(ZeroConstructor)
	TArray<struct FBPComponentClassOverride>     ComponentClassOverrides;                           // 0x260(0x10)(ZeroConstructor)
	class USimpleConstructionScript*             SimpleConstructionScript;                          // 0x270(0x8)(ZeroConstructor)
	class UInheritableComponentHandler*          InheritableComponentHandler;                       // 0x278(0x8)(ZeroConstructor)
	class UStructProperty*                       UberGraphFramePointerProperty;                     // 0x280(0x8)(ZeroConstructor)
	uint8                                        Pad_7B4[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFunction*                             UberGraphFunction;                                 // 0x290(0x8)(ZeroConstructor)
	TMap<class FName, struct FGuid>              CookedPropertyGuids;                               // 0x298(0x50)(None)
	TMap<class FName, struct FBlueprintCookedComponentInstancingData> CookedComponentInstancingData;                     // 0x2E8(0x50)(None)
	uint8                                        Pad_7B6[0x38];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBlueprintGeneratedClass* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class Engine.TimecodeProvider
class UTimecodeProvider : public UObject
{
public:
	float                                        FrameDelay;                                        // 0x28(0x4)(None)
	uint8                                        Pad_7C6[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTimecodeProvider* GetDefaultObj();

	void GetTimecode(const struct FTimecode& ReturnValue);
	void GetSynchronizationState(enum class ETimecodeProviderSynchronizationState ReturnValue);
	void GetQualifiedFrameTime(const struct FQualifiedFrameTime& ReturnValue);
	void GetFrameRate(const struct FFrameRate& ReturnValue);
	void GetDelayedTimecode(const struct FTimecode& ReturnValue);
	void GetDelayedQualifiedFrameTime(const struct FQualifiedFrameTime& ReturnValue);
	void FetchTimecode(const struct FQualifiedFrameTime& OutFrameTime, bool ReturnValue);
	void FetchAndUpdate();
};

// 0x0 (0x28 - 0x28)
// Class Engine.MeshDeformer
class UMeshDeformer : public UObject
{
public:

	static class UClass* StaticClass();
	static class UMeshDeformer* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.MeshDeformerInstanceSettings
class UMeshDeformerInstanceSettings : public UObject
{
public:

	static class UClass* StaticClass();
	static class UMeshDeformerInstanceSettings* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.MeshDeformerInstance
class UMeshDeformerInstance : public UObject
{
public:

	static class UClass* StaticClass();
	static class UMeshDeformerInstance* GetDefaultObj();

};

// 0x0 (0x4B8 - 0x4B8)
// Class Engine.Info
class AInfo : public AActor
{
public:

	static class UClass* StaticClass();
	static class AInfo* GetDefaultObj();

};

// 0xA0 (0x558 - 0x4B8)
// Class Engine.GameModeBase
class AGameModeBase : public AInfo
{
public:
	class FString                                OptionsString;                                     // 0x4B8(0x10)(None)
	class UClass*                                GameSessionClass;                                  // 0x4C8(0x8)(ZeroConstructor)
	class UClass*                                GameStateClass;                                    // 0x4D0(0x8)(ZeroConstructor)
	class UClass*                                PlayerControllerClass;                             // 0x4D8(0x8)(ZeroConstructor)
	class UClass*                                PlayerStateClass;                                  // 0x4E0(0x8)(ZeroConstructor)
	class UClass*                                HUDClass;                                          // 0x4E8(0x8)(ZeroConstructor)
	class UClass*                                DefaultPawnClass;                                  // 0x4F0(0x8)(ZeroConstructor)
	class UClass*                                SpectatorClass;                                    // 0x4F8(0x8)(ZeroConstructor)
	class UClass*                                ReplaySpectatorPlayerControllerClass;              // 0x500(0x8)(ZeroConstructor)
	class UClass*                                ServerStatReplicatorClass;                         // 0x508(0x8)(ZeroConstructor)
	class AGameSession*                          GameSession;                                       // 0x510(0x8)(ZeroConstructor)
	class AGameStateBase*                        GameState;                                         // 0x518(0x8)(ZeroConstructor)
	class AServerStatReplicator*                 ServerStatReplicator;                              // 0x520(0x8)(ZeroConstructor)
	class FText                                  DefaultPlayerName;                                 // 0x528(0x18)(None)
	uint8                                        bUseSeamlessTravel : 1;                            // Mask: 0x1, PropSize: 0x10x540(0x1)(None)
	uint8                                        bStartPlayersAsSpectators : 1;                     // Mask: 0x2, PropSize: 0x10x540(0x1)(None)
	uint8                                        bPauseable : 1;                                    // Mask: 0x4, PropSize: 0x10x540(0x1)(None)
	uint8                                        Pad_80B[0x17];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AGameModeBase* GetDefaultObj();

	void StartPlay();
	void SpawnDefaultPawnFor(class AController* NewPlayer, class AActor* StartSpot, class APawn* ReturnValue);
	void SpawnDefaultPawnAtTransform(class AController* NewPlayer, const struct FTransform& SpawnTransform, class APawn* ReturnValue);
	void ShouldReset(class AActor* ActorToReset, bool ReturnValue);
	void ReturnToMainMenuHost();
	void RestartPlayerAtTransform(class AController* NewPlayer, const struct FTransform& SpawnTransform);
	void RestartPlayerAtPlayerStart(class AController* NewPlayer, class AActor* StartSpot);
	void RestartPlayer(class AController* NewPlayer);
	void ResetLevel();
	void PlayerCanRestart(class APlayerController* Player, bool ReturnValue);
	void MustSpectate(class APlayerController* NewPlayerController, bool ReturnValue);
	void K2_PostLogin(class APlayerController* NewPlayer);
	void K2_OnSwapPlayerControllers(class APlayerController* OldPC, class APlayerController* NewPC);
	void K2_OnRestartPlayer(class AController* NewPlayer);
	void K2_OnLogout(class AController* ExitingController);
	void K2_OnChangeName(class AController* Other, const class FString& NewName, bool bNameChange);
	void K2_FindPlayerStart(class AController* Player, const class FString& IncomingName, class AActor* ReturnValue);
	void InitStartSpot(class AActor* StartSpot, class AController* NewPlayer);
	void InitializeHUDForPlayer(class APlayerController* NewPlayer);
	void HasMatchStarted(bool ReturnValue);
	void HasMatchEnded(bool ReturnValue);
	void HandleStartingNewPlayer(class APlayerController* NewPlayer);
	void GetNumSpectators(int32 ReturnValue);
	void GetNumPlayers(int32 ReturnValue);
	void GetDefaultPawnClassForController(class AController* InController, class UClass* ReturnValue);
	void FindPlayerStart(class AController* Player, const class FString& IncomingName, class AActor* ReturnValue);
	void ChoosePlayerStart(class AController* Player, class AActor* ReturnValue);
	void ChangeName(class AController* Controller, const class FString& NewName, bool bNameChange);
	void CanSpectate(class APlayerController* Viewer, class APlayerState* ViewTarget, bool ReturnValue);
};

// 0x0 (0x28 - 0x28)
// Class Engine.EngineCustomTimeStep
class UEngineCustomTimeStep : public UObject
{
public:

	static class UClass* StaticClass();
	static class UEngineCustomTimeStep* GetDefaultObj();

};

// 0x0 (0x4B8 - 0x4B8)
// Class Engine.PartitionActor
class APartitionActor : public AActor
{
public:

	static class UClass* StaticClass();
	static class APartitionActor* GetDefaultObj();

};

// 0x10 (0x40 - 0x30)
// Class Engine.TickableWorldSubsystem
class UTickableWorldSubsystem : public UWorldSubsystem
{
public:
	uint8                                        Pad_81A[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTickableWorldSubsystem* GetDefaultObj();

};

// 0x38 (0x4F0 - 0x4B8)
// Class Engine.Brush
class ABrush : public AActor
{
public:
	enum class EBrushType                        BrushType;                                         // 0x4B8(0x1)(None)
	uint8                                        Pad_81B[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FColor                                BrushColor;                                        // 0x4BC(0x4)(None)
	int32                                        PolyFlags;                                         // 0x4C0(0x4)(None)
	uint8                                        bColored : 1;                                      // Mask: 0x1, PropSize: 0x10x4C4(0x1)(None)
	uint8                                        bSolidWhenSelected : 1;                            // Mask: 0x2, PropSize: 0x10x4C4(0x1)(None)
	uint8                                        bPlaceableFromClassBrowser : 1;                    // Mask: 0x4, PropSize: 0x10x4C4(0x1)(None)
	uint8                                        bNotForClientOrServer : 1;                         // Mask: 0x8, PropSize: 0x10x4C4(0x1)(None)
	uint8                                        BitPad_82 : 4;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_81C[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UModel*                                Brush;                                             // 0x4C8(0x8)(ZeroConstructor)
	class UBrushComponent*                       BrushComponent;                                    // 0x4D0(0x8)(ZeroConstructor)
	uint8                                        bInManipulation : 1;                               // Mask: 0x1, PropSize: 0x10x4D8(0x1)(None)
	uint8                                        BitPad_83 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_81D[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FGeomSelection>                SavedSelections;                                   // 0x4E0(0x10)(None)

	static class UClass* StaticClass();
	static class ABrush* GetDefaultObj();

};

// 0x18 (0x508 - 0x4F0)
// Class Engine.Volume
class AVolume : public ABrush
{
public:
	TArray<struct FBoxOptimization>              BoxOptimization;                                   // 0x4F0(0x10)(None)
	bool                                         bAllowCollisionComponentWithZeroRadius;            // 0x500(0x1)(None)
	uint8                                        Pad_821[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AVolume* GetDefaultObj();

	void BPEncompassesPoint(const struct FVector& Point, float OutDistanceToPoint, float SphereRadius, bool ReturnValue);
};

// 0x34F8 (0x39B0 - 0x4B8)
// Class Engine.PlayerCameraManager
class APlayerCameraManager : public AActor
{
public:
	class APlayerController*                     PCOwner;                                           // 0x4B8(0x8)(ZeroConstructor)
	class USceneComponent*                       TransformComponent;                                // 0x4C0(0x8)(ZeroConstructor)
	uint8                                        Pad_89C[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DefaultFOV;                                        // 0x4D0(0x4)(None)
	uint8                                        Pad_89D[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DefaultOrthoWidth;                                 // 0x4D8(0x4)(None)
	uint8                                        Pad_89E[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DefaultAspectRatio;                                // 0x4E0(0x4)(None)
	uint8                                        Pad_89F[0x6C];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCameraCacheEntry                     CameraCache;                                       // 0x550(0x870)(ZeroConstructor)
	struct FCameraCacheEntry                     LastFrameCameraCache;                              // 0xDC0(0x870)(ZeroConstructor)
	struct FTViewTarget                          ViewTarget;                                        // 0x1630(0x880)(ZeroConstructor)
	struct FTViewTarget                          PendingViewTarget;                                 // 0x1EB0(0x880)(ZeroConstructor)
	uint8                                        Pad_8A1[0x30];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCameraCacheEntry                     CameraCachePrivate;                                // 0x2760(0x870)(ZeroConstructor)
	struct FCameraCacheEntry                     LastFrameCameraCachePrivate;                       // 0x2FD0(0x870)(ZeroConstructor)
	TArray<class UCameraModifier*>               ModifierList;                                      // 0x3840(0x10)(ZeroConstructor)
	TArray<class UClass*>                        DefaultModifiers;                                  // 0x3850(0x10)(ZeroConstructor)
	float                                        FreeCamDistance;                                   // 0x3860(0x4)(None)
	uint8                                        Pad_8AC[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               FreeCamOffset;                                     // 0x3868(0x18)(None)
	struct FVector                               ViewTargetOffset;                                  // 0x3880(0x18)(None)
	FMulticastInlineDelegateProperty_            OnAudioFadeChangeEvent;                            // 0x3898(0x10)(ZeroConstructor)
	uint8                                        Pad_8AF[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TScriptInterface<class ICameraLensEffectInterface>> CameraLensEffects;                                 // 0x38C0(0x10)(ZeroConstructor)
	class UCameraModifier_CameraShake*           CachedCameraShakeMod;                              // 0x38D0(0x8)(ZeroConstructor)
	class UCameraAnimInst*                       AnimInstPool[0x8];                                 // 0x38D8(0x40)(ZeroConstructor)
	TArray<struct FPostProcessSettings>          PostProcessBlendCache;                             // 0x3918(0x10)(ZeroConstructor)
	uint8                                        Pad_8B4[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UCameraAnimInst*>               ActiveAnims;                                       // 0x3938(0x10)(ZeroConstructor)
	TArray<class UCameraAnimInst*>               FreeAnims;                                         // 0x3948(0x10)(ZeroConstructor)
	class ACameraActor*                          AnimCameraActor;                                   // 0x3958(0x8)(ZeroConstructor)
	uint8                                        bIsOrthographic : 1;                               // Mask: 0x1, PropSize: 0x10x3960(0x1)(None)
	uint8                                        bDefaultConstrainAspectRatio : 1;                  // Mask: 0x2, PropSize: 0x10x3960(0x1)(None)
	uint8                                        BitPad_84 : 4;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bClientSimulatingViewTarget : 1;                   // Mask: 0x40, PropSize: 0x10x3960(0x1)(None)
	uint8                                        bUseClientSideCameraUpdates : 1;                   // Mask: 0x80, PropSize: 0x10x3960(0x1)(None)
	uint8                                        BitPad_85 : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bGameCameraCutThisFrame : 1;                       // Mask: 0x4, PropSize: 0x10x3961(0x1)(None)
	uint8                                        BitPad_86 : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_8B6[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ViewPitchMin;                                      // 0x3964(0x4)(None)
	float                                        ViewPitchMax;                                      // 0x3968(0x4)(None)
	float                                        ViewYawMin;                                        // 0x396C(0x4)(None)
	float                                        ViewYawMax;                                        // 0x3970(0x4)(None)
	float                                        ViewRollMin;                                       // 0x3974(0x4)(None)
	float                                        ViewRollMax;                                       // 0x3978(0x4)(None)
	uint8                                        Pad_8B8[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ServerUpdateCameraTimeout;                         // 0x3980(0x4)(None)
	uint8                                        Pad_8BA[0xC];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               TPVCameraOffset;                                   // 0x3990(0x18)(None)
	float                                        TPVCameraCollisionHeightScaler;                    // 0x39A8(0x4)(None)
	uint8                                        Pad_8BC[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class APlayerCameraManager* GetDefaultObj();

	void SwapPendingViewTargetWhenUsingClientSideCameraUpdates();
	void StopCameraShake(class UCameraShakeBase* ShakeInstance, bool bImmediately);
	void StopCameraFade();
	void StopCameraAnimInst(class UCameraAnimInst* AnimInst, bool bImmediate);
	void StopAllInstancesOfCameraShakeFromSource(class UClass* Shake, class UCameraShakeSourceComponent* SourceComponent, bool bImmediately);
	void StopAllInstancesOfCameraShake(class UClass* Shake, bool bImmediately);
	void StopAllInstancesOfCameraAnim(class UCameraAnim* Anim, bool bImmediate);
	void StopAllCameraShakesFromSource(class UCameraShakeSourceComponent* SourceComponent, bool bImmediately);
	void StopAllCameraShakes(bool bImmediately);
	void StopAllCameraAnims(bool bImmediate);
	void StartMatineeCameraShakeFromSource(class UClass* ShakeClass, class UCameraShakeSourceComponent* SourceComponent, float Scale, enum class ECameraShakePlaySpace PlaySpace, const struct FRotator& UserPlaySpaceRot, class UCameraShakeBase* ReturnValue);
	void StartMatineeCameraShake(class UClass* ShakeClass, float Scale, enum class ECameraShakePlaySpace PlaySpace, const struct FRotator& UserPlaySpaceRot, float Speed, class UCameraShakeBase* ReturnValue);
	void StartCameraShakeFromSource(class UClass* ShakeClass, class UCameraShakeSourceComponent* SourceComponent, float Scale, enum class ECameraShakePlaySpace PlaySpace, const struct FRotator& UserPlaySpaceRot, class UCameraShakeBase* ReturnValue);
	void StartCameraShake(class UClass* ShakeClass, float Scale, enum class ECameraShakePlaySpace PlaySpace, const struct FRotator& UserPlaySpaceRot, float Speed, bool bForceUseWorldCameraShakeScale, class UCameraShakeBase* ReturnValue);
	void StartCameraFade(float FromAlpha, float ToAlpha, float Duration, const struct FLinearColor& Color, bool bShouldFadeAudio, bool bHoldWhenFinished);
	void SetManualCameraFade(float InFadeAmount, const struct FLinearColor& Color, bool bInFadeAudio);
	void SetGameCameraCutThisFrame();
	void RemoveGenericCameraLensEffect(TScriptInterface<class ICameraLensEffectInterface> Emitter);
	void RemoveCameraModifier(class UCameraModifier* ModifierToRemove, bool ReturnValue);
	void RemoveCameraLensEffect(class AEmitterCameraLensEffectBase* Emitter);
	void PlayCameraAnim(class UCameraAnim* Anim, float Rate, float Scale, float BlendInTime, float BlendOutTime, bool bLoop, bool bRandomStartTime, float Duration, enum class ECameraShakePlaySpace PlaySpace, const struct FRotator& UserPlaySpaceRot, class UCameraAnimInst* ReturnValue);
	void PhotographyCameraModify(const struct FVector& NewCameraLocation, const struct FVector& PreviousCameraLocation, const struct FVector& OriginalCameraLocation, const struct FVector& ResultCameraLocation);
	void OnPhotographySessionStart();
	void OnPhotographySessionEnd();
	void OnPhotographyMultiPartCaptureStart();
	void OnPhotographyMultiPartCaptureEnd();
	void GetWorldCameraShakeScale(bool bForceReturnUserSettingScale, float ReturnValue);
	void GetOwningPlayerController(class APlayerController* ReturnValue);
	void GetFOVAngle(float ReturnValue);
	void GetCameraRotation(const struct FRotator& ReturnValue);
	void GetCameraLocation(const struct FVector& ReturnValue);
	void FindCameraModifierByClass(class UClass* ModifierClass, class UCameraModifier* ReturnValue);
	void ClearCameraLensEffects();
	void BlueprintUpdateCamera(class AActor* CameraTarget, const struct FVector& NewCameraLocation, const struct FRotator& NewCameraRotation, float NewCameraFOV, bool ReturnValue);
	void AddNewCameraModifier(class UClass* ModifierClass, class UCameraModifier* ReturnValue);
	void AddGenericCameraLensEffect(class UClass* LensEffectEmitterClass, TScriptInterface<class ICameraLensEffectInterface> ReturnValue);
	void AddCameraLensEffect(class UClass* LensEffectEmitterClass, class AEmitterCameraLensEffectBase* ReturnValue);
};

// 0x0 (0x28 - 0x28)
// Class Engine.DynamicBlueprintBinding
class UDynamicBlueprintBinding : public UObject
{
public:

	static class UClass* StaticClass();
	static class UDynamicBlueprintBinding* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.InputDelegateBinding
class UInputDelegateBinding : public UDynamicBlueprintBinding
{
public:

	static class UClass* StaticClass();
	static class UInputDelegateBinding* GetDefaultObj();

};

// 0x88 (0x140 - 0xB8)
// Class Engine.InputComponent
class UInputComponent : public UActorComponent
{
public:
	uint8                                        Pad_8E8[0x70];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedKeyToActionInfo>        CachedKeyToActionInfo;                             // 0x128(0x10)(ZeroConstructor)
	uint8                                        Pad_8E9[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UInputComponent* GetDefaultObj();

	void WasControllerKeyJustReleased(const struct FKey& Key, bool ReturnValue);
	void WasControllerKeyJustPressed(const struct FKey& Key, bool ReturnValue);
	void OnInputOwnerEndPlayed(class AActor* InOwner, enum class EEndPlayReason EndPlayReason);
	void IsControllerKeyDown(const struct FKey& Key, bool ReturnValue);
	void GetTouchState(int32 FingerIndex, float LocationX, float LocationY, bool bIsCurrentlyPressed);
	void GetControllerVectorKeyState(const struct FKey& Key, const struct FVector& ReturnValue);
	void GetControllerMouseDelta(float DeltaX, float DeltaY);
	void GetControllerKeyTimeDown(const struct FKey& Key, float ReturnValue);
	void GetControllerAnalogStickState(enum class EControllerAnalogStick WhichStick, float StickX, float StickY);
	void GetControllerAnalogKeyState(const struct FKey& Key, float ReturnValue);
};

// 0xFA8 (0xFD0 - 0x28)
// Class Engine.Engine
class UEngine : public UObject
{
public:
	uint8                                        Pad_8EF[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFont*                                 TinyFont;                                          // 0x30(0x8)(ZeroConstructor)
	struct FSoftObjectPath                       TinyFontName;                                      // 0x38(0x20)(None)
	class UFont*                                 SmallFont;                                         // 0x58(0x8)(ZeroConstructor)
	struct FSoftObjectPath                       SmallFontName;                                     // 0x60(0x20)(None)
	class UFont*                                 MediumFont;                                        // 0x80(0x8)(ZeroConstructor)
	struct FSoftObjectPath                       MediumFontName;                                    // 0x88(0x20)(None)
	class UFont*                                 LargeFont;                                         // 0xA8(0x8)(ZeroConstructor)
	struct FSoftObjectPath                       LargeFontName;                                     // 0xB0(0x20)(None)
	class UFont*                                 SubtitleFont;                                      // 0xD0(0x8)(ZeroConstructor)
	struct FSoftObjectPath                       SubtitleFontName;                                  // 0xD8(0x20)(None)
	TArray<class UFont*>                         AdditionalFonts;                                   // 0xF8(0x10)(ZeroConstructor)
	TArray<class FString>                        AdditionalFontNames;                               // 0x108(0x10)(None)
	class UClass*                                ConsoleClass;                                      // 0x118(0x8)(ZeroConstructor)
	struct FSoftClassPath                        ConsoleClassName;                                  // 0x120(0x20)(None)
	class UClass*                                GameViewportClientClass;                           // 0x140(0x8)(ZeroConstructor)
	struct FSoftClassPath                        GameViewportClientClassName;                       // 0x148(0x20)(None)
	class UClass*                                LocalPlayerClass;                                  // 0x168(0x8)(ZeroConstructor)
	struct FSoftClassPath                        LocalPlayerClassName;                              // 0x170(0x20)(None)
	class UClass*                                WorldSettingsClass;                                // 0x190(0x8)(ZeroConstructor)
	struct FSoftClassPath                        WorldSettingsClassName;                            // 0x198(0x20)(None)
	struct FSoftClassPath                        NavigationSystemClassName;                         // 0x1B8(0x20)(None)
	class UClass*                                NavigationSystemClass;                             // 0x1D8(0x8)(ZeroConstructor)
	struct FSoftClassPath                        NavigationSystemConfigClassName;                   // 0x1E0(0x20)(None)
	class UClass*                                NavigationSystemConfigClass;                       // 0x200(0x8)(ZeroConstructor)
	struct FSoftClassPath                        AvoidanceManagerClassName;                         // 0x208(0x20)(None)
	class UClass*                                AvoidanceManagerClass;                             // 0x228(0x8)(ZeroConstructor)
	struct FSoftClassPath                        AIControllerClassName;                             // 0x230(0x20)(None)
	class UClass*                                PhysicsCollisionHandlerClass;                      // 0x250(0x8)(ZeroConstructor)
	struct FSoftClassPath                        PhysicsCollisionHandlerClassName;                  // 0x258(0x20)(None)
	struct FSoftClassPath                        GameUserSettingsClassName;                         // 0x278(0x20)(None)
	class UClass*                                GameUserSettingsClass;                             // 0x298(0x8)(ZeroConstructor)
	class UGameUserSettings*                     GameUserSettings;                                  // 0x2A0(0x8)(ZeroConstructor)
	class UClass*                                LevelScriptActorClass;                             // 0x2A8(0x8)(ZeroConstructor)
	struct FSoftClassPath                        LevelScriptActorClassName;                         // 0x2B0(0x20)(None)
	struct FSoftClassPath                        DefaultBlueprintBaseClassName;                     // 0x2D0(0x20)(None)
	struct FSoftClassPath                        GameSingletonClassName;                            // 0x2F0(0x20)(None)
	class UObject*                               GameSingleton;                                     // 0x310(0x8)(ZeroConstructor)
	struct FSoftClassPath                        AssetManagerClassName;                             // 0x318(0x20)(None)
	class UAssetManager*                         AssetManager;                                      // 0x338(0x8)(ZeroConstructor)
	class UTexture2D*                            DefaultTexture;                                    // 0x340(0x8)(ZeroConstructor)
	struct FSoftObjectPath                       DefaultTextureName;                                // 0x348(0x20)(None)
	class UTexture*                              DefaultDiffuseTexture;                             // 0x368(0x8)(ZeroConstructor)
	struct FSoftObjectPath                       DefaultDiffuseTextureName;                         // 0x370(0x20)(None)
	class UTexture2D*                            DefaultBSPVertexTexture;                           // 0x390(0x8)(ZeroConstructor)
	struct FSoftObjectPath                       DefaultBSPVertexTextureName;                       // 0x398(0x20)(None)
	class UTexture2D*                            HighFrequencyNoiseTexture;                         // 0x3B8(0x8)(ZeroConstructor)
	struct FSoftObjectPath                       HighFrequencyNoiseTextureName;                     // 0x3C0(0x20)(None)
	class UTexture2D*                            DefaultBokehTexture;                               // 0x3E0(0x8)(ZeroConstructor)
	struct FSoftObjectPath                       DefaultBokehTextureName;                           // 0x3E8(0x20)(None)
	class UTexture2D*                            DefaultBloomKernelTexture;                         // 0x408(0x8)(ZeroConstructor)
	struct FSoftObjectPath                       DefaultBloomKernelTextureName;                     // 0x410(0x20)(None)
	class UTexture2D*                            DefaultFilmGrainTexture;                           // 0x430(0x8)(ZeroConstructor)
	struct FSoftObjectPath                       DefaultFilmGrainTextureName;                       // 0x438(0x20)(None)
	class UMaterial*                             WireframeMaterial;                                 // 0x458(0x8)(ZeroConstructor)
	class FString                                WireframeMaterialName;                             // 0x460(0x10)(None)
	class UMaterial*                             DebugMeshMaterial;                                 // 0x470(0x8)(ZeroConstructor)
	struct FSoftObjectPath                       DebugMeshMaterialName;                             // 0x478(0x20)(None)
	class UMaterial*                             NaniteHiddenSectionMaterial;                       // 0x498(0x8)(ZeroConstructor)
	class FString                                NaniteHiddenSectionMaterialName;                   // 0x4A0(0x10)(None)
	class UMaterial*                             EmissiveMeshMaterial;                              // 0x4B0(0x8)(ZeroConstructor)
	struct FSoftObjectPath                       EmissiveMeshMaterialName;                          // 0x4B8(0x20)(None)
	class UMaterial*                             LevelColorationLitMaterial;                        // 0x4D8(0x8)(ZeroConstructor)
	class FString                                LevelColorationLitMaterialName;                    // 0x4E0(0x10)(None)
	class UMaterial*                             LevelColorationUnlitMaterial;                      // 0x4F0(0x8)(ZeroConstructor)
	class FString                                LevelColorationUnlitMaterialName;                  // 0x4F8(0x10)(None)
	class UMaterial*                             LightingTexelDensityMaterial;                      // 0x508(0x8)(ZeroConstructor)
	class FString                                LightingTexelDensityName;                          // 0x510(0x10)(None)
	class UMaterial*                             ShadedLevelColorationLitMaterial;                  // 0x520(0x8)(ZeroConstructor)
	class FString                                ShadedLevelColorationLitMaterialName;              // 0x528(0x10)(None)
	class UMaterial*                             ShadedLevelColorationUnlitMaterial;                // 0x538(0x8)(ZeroConstructor)
	class FString                                ShadedLevelColorationUnlitMaterialName;            // 0x540(0x10)(None)
	class UMaterial*                             RemoveSurfaceMaterial;                             // 0x550(0x8)(ZeroConstructor)
	struct FSoftObjectPath                       RemoveSurfaceMaterialName;                         // 0x558(0x20)(None)
	class UMaterial*                             VertexColorMaterial;                               // 0x578(0x8)(ZeroConstructor)
	class FString                                VertexColorMaterialName;                           // 0x580(0x10)(None)
	class UMaterial*                             VertexColorViewModeMaterial_ColorOnly;             // 0x590(0x8)(ZeroConstructor)
	class FString                                VertexColorViewModeMaterialName_ColorOnly;         // 0x598(0x10)(None)
	class UMaterial*                             VertexColorViewModeMaterial_AlphaAsColor;          // 0x5A8(0x8)(ZeroConstructor)
	class FString                                VertexColorViewModeMaterialName_AlphaAsColor;      // 0x5B0(0x10)(None)
	class UMaterial*                             VertexColorViewModeMaterial_RedOnly;               // 0x5C0(0x8)(ZeroConstructor)
	class FString                                VertexColorViewModeMaterialName_RedOnly;           // 0x5C8(0x10)(None)
	class UMaterial*                             VertexColorViewModeMaterial_GreenOnly;             // 0x5D8(0x8)(ZeroConstructor)
	class FString                                VertexColorViewModeMaterialName_GreenOnly;         // 0x5E0(0x10)(None)
	class UMaterial*                             VertexColorViewModeMaterial_BlueOnly;              // 0x5F0(0x8)(ZeroConstructor)
	class FString                                VertexColorViewModeMaterialName_BlueOnly;          // 0x5F8(0x10)(None)
	struct FSoftObjectPath                       DebugEditorMaterialName;                           // 0x608(0x20)(None)
	class UMaterial*                             ConstraintLimitMaterial;                           // 0x628(0x8)(ZeroConstructor)
	class UMaterialInstanceDynamic*              ConstraintLimitMaterialX;                          // 0x630(0x8)(ZeroConstructor)
	class UMaterialInstanceDynamic*              ConstraintLimitMaterialXAxis;                      // 0x638(0x8)(ZeroConstructor)
	class UMaterialInstanceDynamic*              ConstraintLimitMaterialY;                          // 0x640(0x8)(ZeroConstructor)
	class UMaterialInstanceDynamic*              ConstraintLimitMaterialYAxis;                      // 0x648(0x8)(ZeroConstructor)
	class UMaterialInstanceDynamic*              ConstraintLimitMaterialZ;                          // 0x650(0x8)(ZeroConstructor)
	class UMaterialInstanceDynamic*              ConstraintLimitMaterialZAxis;                      // 0x658(0x8)(ZeroConstructor)
	class UMaterialInstanceDynamic*              ConstraintLimitMaterialPrismatic;                  // 0x660(0x8)(ZeroConstructor)
	class UMaterial*                             InvalidLightmapSettingsMaterial;                   // 0x668(0x8)(ZeroConstructor)
	struct FSoftObjectPath                       InvalidLightmapSettingsMaterialName;               // 0x670(0x20)(None)
	class UMaterial*                             PreviewShadowsIndicatorMaterial;                   // 0x690(0x8)(ZeroConstructor)
	struct FSoftObjectPath                       PreviewShadowsIndicatorMaterialName;               // 0x698(0x20)(None)
	class UMaterial*                             ArrowMaterial;                                     // 0x6B8(0x8)(ZeroConstructor)
	class UMaterialInstanceDynamic*              ArrowMaterialYellow;                               // 0x6C0(0x8)(ZeroConstructor)
	struct FSoftObjectPath                       ArrowMaterialName;                                 // 0x6C8(0x20)(None)
	struct FLinearColor                          LightingOnlyBrightness;                            // 0x6E8(0x10)(None)
	TArray<struct FLinearColor>                  ShaderComplexityColors;                            // 0x6F8(0x10)(None)
	TArray<struct FLinearColor>                  QuadComplexityColors;                              // 0x708(0x10)(None)
	TArray<struct FLinearColor>                  LightComplexityColors;                             // 0x718(0x10)(None)
	TArray<struct FLinearColor>                  StationaryLightOverlapColors;                      // 0x728(0x10)(None)
	TArray<struct FLinearColor>                  LODColorationColors;                               // 0x738(0x10)(None)
	TArray<struct FLinearColor>                  HLODColorationColors;                              // 0x748(0x10)(None)
	TArray<struct FLinearColor>                  StreamingAccuracyColors;                           // 0x758(0x10)(None)
	struct FLinearColor                          GPUSkinCacheVisualizationExcludedColor;            // 0x768(0x10)(None)
	struct FLinearColor                          GPUSkinCacheVisualizationIncludedColor;            // 0x778(0x10)(None)
	struct FLinearColor                          GPUSkinCacheVisualizationRecomputeTangentsColor;   // 0x788(0x10)(None)
	float                                        GPUSkinCacheVisualizationLowMemoryThresholdInMB;   // 0x798(0x4)(None)
	float                                        GPUSkinCacheVisualizationHighMemoryThresholdInMB;  // 0x79C(0x4)(None)
	struct FLinearColor                          GPUSkinCacheVisualizationLowMemoryColor;           // 0x7A0(0x10)(None)
	struct FLinearColor                          GPUSkinCacheVisualizationMidMemoryColor;           // 0x7B0(0x10)(None)
	struct FLinearColor                          GPUSkinCacheVisualizationHighMemoryColor;          // 0x7C0(0x10)(None)
	TArray<struct FLinearColor>                  GPUSkinCacheVisualizationRayTracingLODOffsetColors; // 0x7D0(0x10)(None)
	float                                        MaxPixelShaderAdditiveComplexityCount;             // 0x7E0(0x4)(None)
	float                                        MaxES3PixelShaderAdditiveComplexityCount;          // 0x7E4(0x4)(None)
	float                                        MinLightMapDensity;                                // 0x7E8(0x4)(None)
	float                                        IdealLightMapDensity;                              // 0x7EC(0x4)(None)
	float                                        MaxLightMapDensity;                                // 0x7F0(0x4)(None)
	uint8                                        bRenderLightMapDensityGrayscale : 1;               // Mask: 0x1, PropSize: 0x10x7F4(0x1)(None)
	uint8                                        BitPad_87 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_900[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RenderLightMapDensityGrayscaleScale;               // 0x7F8(0x4)(None)
	float                                        RenderLightMapDensityColorScale;                   // 0x7FC(0x4)(None)
	struct FLinearColor                          LightMapDensityVertexMappedColor;                  // 0x800(0x10)(None)
	struct FLinearColor                          LightMapDensitySelectedColor;                      // 0x810(0x10)(None)
	TArray<struct FStatColorMapping>             StatColorMappings;                                 // 0x820(0x10)(None)
	class UPhysicalMaterial*                     DefaultPhysMaterial;                               // 0x830(0x8)(ZeroConstructor)
	struct FSoftObjectPath                       DefaultPhysMaterialName;                           // 0x838(0x20)(None)
	class UPhysicalMaterial*                     DefaultDestructiblePhysMaterial;                   // 0x858(0x8)(ZeroConstructor)
	struct FSoftObjectPath                       DefaultDestructiblePhysMaterialName;               // 0x860(0x20)(None)
	TArray<struct FGameNameRedirect>             ActiveGameNameRedirects;                           // 0x880(0x10)(None)
	TArray<struct FClassRedirect>                ActiveClassRedirects;                              // 0x890(0x10)(None)
	TArray<struct FPluginRedirect>               ActivePluginRedirects;                             // 0x8A0(0x10)(None)
	TArray<struct FStructRedirect>               ActiveStructRedirects;                             // 0x8B0(0x10)(None)
	class UTexture2D*                            PreIntegratedSkinBRDFTexture;                      // 0x8C0(0x8)(ZeroConstructor)
	struct FSoftObjectPath                       PreIntegratedSkinBRDFTextureName;                  // 0x8C8(0x20)(None)
	class UTexture2D*                            BlueNoiseScalarTexture;                            // 0x8E8(0x8)(ZeroConstructor)
	class UTexture2D*                            BlueNoiseVec2Texture;                              // 0x8F0(0x8)(ZeroConstructor)
	struct FSoftObjectPath                       BlueNoiseScalarTextureName;                        // 0x8F8(0x20)(None)
	struct FSoftObjectPath                       BlueNoiseVec2TextureName;                          // 0x918(0x20)(None)
	class UTexture2D*                            MiniFontTexture;                                   // 0x938(0x8)(ZeroConstructor)
	struct FSoftObjectPath                       MiniFontTextureName;                               // 0x940(0x20)(None)
	class UTexture*                              WeightMapPlaceholderTexture;                       // 0x960(0x8)(ZeroConstructor)
	struct FSoftObjectPath                       WeightMapPlaceholderTextureName;                   // 0x968(0x20)(None)
	class UTexture2D*                            LightMapDensityTexture;                            // 0x988(0x8)(ZeroConstructor)
	struct FSoftObjectPath                       LightMapDensityTextureName;                        // 0x990(0x20)(None)
	uint8                                        Pad_902[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UGameViewportClient*                   GameViewport;                                      // 0x9B8(0x8)(ZeroConstructor)
	TArray<class FString>                        DeferredCommands;                                  // 0x9C0(0x10)(None)
	float                                        NearClipPlane;                                     // 0x9D0(0x4)(None)
	uint8                                        bSubtitlesEnabled : 1;                             // Mask: 0x1, PropSize: 0x10x9D4(0x1)(None)
	uint8                                        bSubtitlesForcedOff : 1;                           // Mask: 0x2, PropSize: 0x10x9D4(0x1)(None)
	uint8                                        BitPad_88 : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_903[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MaximumLoopIterationCount;                         // 0x9D8(0x4)(None)
	uint8                                        bCanBlueprintsTickByDefault : 1;                   // Mask: 0x1, PropSize: 0x10x9DC(0x1)(None)
	uint8                                        bOptimizeAnimBlueprintMemberVariableAccess : 1;    // Mask: 0x2, PropSize: 0x10x9DC(0x1)(None)
	uint8                                        bAllowMultiThreadedAnimationUpdate : 1;            // Mask: 0x4, PropSize: 0x10x9DC(0x1)(None)
	uint8                                        bEnableEditorPSysRealtimeLOD : 1;                  // Mask: 0x8, PropSize: 0x10x9DC(0x1)(None)
	uint8                                        BitPad_89 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bSmoothFrameRate : 1;                              // Mask: 0x20, PropSize: 0x10x9DC(0x1)(None)
	uint8                                        bUseFixedFrameRate : 1;                            // Mask: 0x40, PropSize: 0x10x9DC(0x1)(None)
	uint8                                        BitPad_8A : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_904[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FixedFrameRate;                                    // 0x9E0(0x4)(None)
	struct FFloatRange                           SmoothedFrameRateRange;                            // 0x9E4(0x10)(None)
	uint8                                        Pad_905[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UEngineCustomTimeStep*                 CustomTimeStep;                                    // 0x9F8(0x8)(ZeroConstructor)
	uint8                                        Pad_906[0x20];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSoftClassPath                        CustomTimeStepClassName;                           // 0xA20(0x20)(None)
	class UTimecodeProvider*                     TimecodeProvider;                                  // 0xA40(0x8)(None)
	uint8                                        Pad_907[0x20];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSoftClassPath                        TimecodeProviderClassName;                         // 0xA68(0x20)(None)
	bool                                         bGenerateDefaultTimecode;                          // 0xA88(0x1)(None)
	uint8                                        Pad_908[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFrameRate                            GenerateDefaultTimecodeFrameRate;                  // 0xA8C(0x8)(None)
	float                                        GenerateDefaultTimecodeFrameDelay;                 // 0xA94(0x4)(None)
	uint8                                        bCheckForMultiplePawnsSpawnedInAFrame : 1;         // Mask: 0x1, PropSize: 0x10xA98(0x1)(None)
	uint8                                        BitPad_8B : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_909[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NumPawnsAllowedToBeSpawnedInAFrame;                // 0xA9C(0x4)(None)
	uint8                                        bShouldGenerateLowQualityLightmaps : 1;            // Mask: 0x1, PropSize: 0x10xAA0(0x1)(None)
	uint8                                        BitPad_8C : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_90A[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FColor                                C_WorldBox;                                        // 0xAA4(0x4)(None)
	struct FColor                                C_BrushWire;                                       // 0xAA8(0x4)(None)
	struct FColor                                C_AddWire;                                         // 0xAAC(0x4)(None)
	struct FColor                                C_SubtractWire;                                    // 0xAB0(0x4)(None)
	struct FColor                                C_SemiSolidWire;                                   // 0xAB4(0x4)(None)
	struct FColor                                C_NonSolidWire;                                    // 0xAB8(0x4)(None)
	struct FColor                                C_WireBackground;                                  // 0xABC(0x4)(None)
	struct FColor                                C_ScaleBoxHi;                                      // 0xAC0(0x4)(None)
	struct FColor                                C_VolumeCollision;                                 // 0xAC4(0x4)(None)
	struct FColor                                C_BSPCollision;                                    // 0xAC8(0x4)(None)
	struct FColor                                C_OrthoBackground;                                 // 0xACC(0x4)(None)
	struct FColor                                C_Volume;                                          // 0xAD0(0x4)(None)
	struct FColor                                C_BrushShape;                                      // 0xAD4(0x4)(None)
	uint8                                        Pad_90F[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDirectoryPath                        GameScreenshotSaveDirectory;                       // 0xAE0(0x10)(None)
	bool                                         UseStaticMeshMinLODPerQualityLevels;               // 0xAF0(0x1)(None)
	bool                                         UseSkeletalMeshMinLODPerQualityLevels;             // 0xAF1(0x1)(None)
	bool                                         UseGrassVarityPerQualityLevels;                    // 0xAF2(0x1)(None)
	enum class ETransitionType                   TransitionType;                                    // 0xAF3(0x1)(None)
	uint8                                        Pad_910[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                TransitionDescription;                             // 0xAF8(0x10)(None)
	class FString                                TransitionGameMode;                                // 0xB08(0x10)(None)
	uint8                                        bAllowMatureLanguage : 1;                          // Mask: 0x1, PropSize: 0x10xB18(0x1)(None)
	uint8                                        BitPad_8D : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_911[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CameraRotationThreshold;                           // 0xB1C(0x4)(None)
	float                                        CameraTranslationThreshold;                        // 0xB20(0x4)(None)
	float                                        PrimitiveProbablyVisibleTime;                      // 0xB24(0x4)(None)
	float                                        MaxOcclusionPixelsFraction;                        // 0xB28(0x4)(None)
	uint8                                        bPauseOnLossOfFocus : 1;                           // Mask: 0x1, PropSize: 0x10xB2C(0x1)(None)
	uint8                                        BitPad_8E : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_913[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MaxParticleResize;                                 // 0xB30(0x4)(None)
	int32                                        MaxParticleResizeWarn;                             // 0xB34(0x4)(None)
	TArray<struct FDropNoteInfo>                 PendingDroppedNotes;                               // 0xB38(0x10)(None)
	float                                        NetClientTicksPerSecond;                           // 0xB48(0x4)(None)
	float                                        DisplayGamma;                                      // 0xB4C(0x4)(None)
	float                                        MinDesiredFrameRate;                               // 0xB50(0x4)(None)
	struct FLinearColor                          DefaultSelectedMaterialColor;                      // 0xB54(0x10)(None)
	struct FLinearColor                          SelectedMaterialColor;                             // 0xB64(0x10)(None)
	struct FLinearColor                          SelectionOutlineColor;                             // 0xB74(0x10)(None)
	struct FLinearColor                          SubduedSelectionOutlineColor;                      // 0xB84(0x10)(None)
	struct FLinearColor                          SelectedMaterialColorOverride;                     // 0xB94(0x10)(None)
	bool                                         bIsOverridingSelectedColor;                        // 0xBA4(0x1)(None)
	uint8                                        Pad_915[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bEnableOnScreenDebugMessages : 1;                  // Mask: 0x1, PropSize: 0x10xBA8(0x1)(None)
	uint8                                        bEnableOnScreenDebugMessagesDisplay : 1;           // Mask: 0x2, PropSize: 0x10xBA8(0x1)(None)
	uint8                                        bSuppressMapWarnings : 1;                          // Mask: 0x4, PropSize: 0x10xBA8(0x1)(None)
	uint8                                        bDisableAILogging : 1;                             // Mask: 0x8, PropSize: 0x10xBA8(0x1)(None)
	uint8                                        BitPad_8F : 4;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_919[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint32                                       bEnableVisualLogRecordingOnStart;                  // 0xBAC(0x4)(None)
	int32                                        ScreenSaverInhibitorSemaphore;                     // 0xBB0(0x4)(None)
	uint8                                        bLockReadOnlyLevels : 1;                           // Mask: 0x1, PropSize: 0x10xBB4(0x1)(None)
	uint8                                        BitPad_90 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_91B[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                ParticleEventManagerClassPath;                     // 0xBB8(0x10)(None)
	float                                        SelectionHighlightIntensity;                       // 0xBC8(0x4)(None)
	float                                        BSPSelectionHighlightIntensity;                    // 0xBCC(0x4)(None)
	float                                        SelectionHighlightIntensityBillboards;             // 0xBD0(0x4)(None)
	uint8                                        Pad_91C[0x294];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	uint32                                       GlobalNetTravelCount;                              // 0xE68(0x4)(None)
	uint8                                        Pad_91D[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FNetDriverDefinition>          NetDriverDefinitions;                              // 0xE70(0x10)(None)
	TArray<struct FIrisNetDriverConfig>          IrisNetDriverConfigs;                              // 0xE80(0x10)(None)
	TArray<class FString>                        ServerActors;                                      // 0xE90(0x10)(None)
	TArray<class FString>                        RuntimeServerActors;                               // 0xEA0(0x10)(None)
	float                                        NetErrorLogInterval;                               // 0xEB0(0x4)(None)
	uint8                                        bStartedLoadMapMovie : 1;                          // Mask: 0x1, PropSize: 0x10xEB4(0x1)(None)
	uint8                                        BitPad_91 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_921[0x1B];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NextWorldContextHandle;                            // 0xED0(0x4)(None)
	uint8                                        Pad_923[0xF4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        NetworkStressTestClientMode_MinFPS;                // 0xFC8(0x4)(None)
	float                                        NetworkStressTestClientMode_MaxFPS;                // 0xFCC(0x4)(None)


	static class UEngine* GetEngine();
	static class UClass* StaticClass();
	static class UEngine* GetDefaultObj();

};

// 0x468 (0x4B8 - 0x50)
// Class Engine.LocalPlayer
class ULocalPlayer : public UPlayer
{
public:
	uint8                                        Pad_932[0x30];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UGameViewportClient*                   ViewportClient;                                    // 0x80(0x8)(ZeroConstructor)
	uint8                                        Pad_933[0x38];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EAspectRatioAxisConstraint        AspectRatioAxisConstraint;                         // 0xC0(0x1)(None)
	uint8                                        Pad_934[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                PendingLevelPlayerControllerClass;                 // 0xC8(0x8)(ZeroConstructor)
	uint8                                        bSentSplitJoin : 1;                                // Mask: 0x1, PropSize: 0x10xD0(0x1)(None)
	uint8                                        BitPad_92 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_935[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bValidCachedViewFrustum;                           // 0xD4(0x1)(None)
	uint8                                        Pad_936[0x21B];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ControllerId;                                      // 0x2F0(0x4)(None)
	uint8                                        Pad_937[0x1C4];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ULocalPlayer* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Engine.LocalPlayerSubsystem
class ULocalPlayerSubsystem : public USubsystem
{
public:

	static class UClass* StaticClass();
	static class ULocalPlayerSubsystem* GetDefaultObj();

};

// 0x4C0 (0x4E8 - 0x28)
// Class Engine.PlayerInput
class UPlayerInput : public UObject
{
public:
	uint8                                        Pad_952[0x178];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FKeyBind>                      DebugExecBindings;                                 // 0x1A0(0x10)(None)
	uint8                                        Pad_953[0x30];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FName>                          InvertedAxis;                                      // 0x1E0(0x10)(None)
	uint8                                        Pad_954[0x2F8];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPlayerInput* GetDefaultObj();

	void SetMouseSensitivity(float Sensitivity);
	void SetBind(class FName BindName, const class FString& Command);
	void InvertAxisKey(const struct FKey& AxisKey);
	void InvertAxis(class FName AxisName);
	void GetOuterAPlayerController(class APlayerController* ReturnValue);
	void ClearSmoothing();
};

// 0x8 (0x30 - 0x28)
// Class Engine.DataAsset
class UDataAsset : public UObject
{
public:
	class UClass*                                NativeClass;                                       // 0x28(0x8)(None)

	static class UClass* StaticClass();
	static class UDataAsset* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Engine.PrimaryDataAsset
class UPrimaryDataAsset : public UDataAsset
{
public:

	static class UClass* StaticClass();
	static class UPrimaryDataAsset* GetDefaultObj();

};

// 0x68 (0x120 - 0xB8)
// Class Engine.MovementComponent
class UMovementComponent : public UActorComponent
{
public:
	class USceneComponent*                       UpdatedComponent;                                  // 0xB8(0x8)(ZeroConstructor)
	class UPrimitiveComponent*                   UpdatedPrimitive;                                  // 0xC0(0x8)(ZeroConstructor)
	uint8                                        Pad_9DF[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               Velocity;                                          // 0xD0(0x18)(None)
	struct FVector                               PlaneConstraintNormal;                             // 0xE8(0x18)(None)
	struct FVector                               PlaneConstraintOrigin;                             // 0x100(0x18)(None)
	uint8                                        bUpdateOnlyIfRendered : 1;                         // Mask: 0x1, PropSize: 0x10x118(0x1)(None)
	uint8                                        bAutoUpdateTickRegistration : 1;                   // Mask: 0x2, PropSize: 0x10x118(0x1)(None)
	uint8                                        bTickBeforeOwner : 1;                              // Mask: 0x4, PropSize: 0x10x118(0x1)(None)
	uint8                                        bAutoRegisterUpdatedComponent : 1;                 // Mask: 0x8, PropSize: 0x10x118(0x1)(None)
	uint8                                        bConstrainToPlane : 1;                             // Mask: 0x10, PropSize: 0x10x118(0x1)(None)
	uint8                                        bSnapToPlaneAtStart : 1;                           // Mask: 0x20, PropSize: 0x10x118(0x1)(None)
	uint8                                        bAutoRegisterPhysicsVolumeUpdates : 1;             // Mask: 0x40, PropSize: 0x10x118(0x1)(None)
	uint8                                        bComponentShouldUpdatePhysicsVolume : 1;           // Mask: 0x80, PropSize: 0x10x118(0x1)(None)
	uint8                                        Pad_9E3[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EPlaneConstraintAxisSetting       PlaneConstraintAxisSetting;                        // 0x11B(0x1)(None)
	uint8                                        Pad_9E4[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UMovementComponent* GetDefaultObj();

	void StopMovementImmediately();
	void SnapUpdatedComponentToPlane();
	void SetUpdatedComponent(class USceneComponent* NewUpdatedComponent);
	void SetPlaneConstraintOrigin(const struct FVector& PlaneOrigin);
	void SetPlaneConstraintNormal(const struct FVector& PlaneNormal);
	void SetPlaneConstraintFromVectors(const struct FVector& Forward, const struct FVector& Up);
	void SetPlaneConstraintEnabled(bool bEnabled);
	void SetPlaneConstraintAxisSetting(enum class EPlaneConstraintAxisSetting NewAxisSetting);
	void PhysicsVolumeChanged(class APhysicsVolume* NewVolume);
	void K2_MoveUpdatedComponent(const struct FVector& Delta, const struct FRotator& NewRotation, const struct FHitResult& OutHit, bool bSweep, bool bTeleport, bool ReturnValue);
	void IsExceedingMaxSpeed(float MaxSpeed, bool ReturnValue);
	void GetPlaneConstraintOrigin(const struct FVector& ReturnValue);
	void GetPlaneConstraintNormal(const struct FVector& ReturnValue);
	void GetPlaneConstraintAxisSetting(enum class EPlaneConstraintAxisSetting ReturnValue);
	void GetPhysicsVolume(class APhysicsVolume* ReturnValue);
	void GetMaxSpeed(float ReturnValue);
	void GetGravityZ(float ReturnValue);
	void ConstrainNormalToPlane(const struct FVector& Normal, const struct FVector& ReturnValue);
	void ConstrainLocationToPlane(const struct FVector& Location, const struct FVector& ReturnValue);
	void ConstrainDirectionToPlane(const struct FVector& Direction, const struct FVector& ReturnValue);
};

// 0x48 (0x168 - 0x120)
// Class Engine.NavMovementComponent
class UNavMovementComponent : public UMovementComponent
{
public:
	struct FNavAgentProperties                   NavAgentProps;                                     // 0x120(0x38)(None)
	float                                        FixedPathBrakingDistance;                          // 0x158(0x4)(None)
	uint8                                        bUpdateNavAgentWithOwnersCollision : 1;            // Mask: 0x1, PropSize: 0x10x15C(0x1)(None)
	uint8                                        bUseAccelerationForPaths : 1;                      // Mask: 0x2, PropSize: 0x10x15C(0x1)(None)
	uint8                                        bUseFixedBrakingDistanceForPaths : 1;              // Mask: 0x4, PropSize: 0x10x15C(0x1)(None)
	uint8                                        BitPad_93 : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	struct FMovementProperties                   MovementState;                                     // 0x15D(0x1)(None)
	uint8                                        Pad_9F5[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UObject*                               PathFollowingComp;                                 // 0x160(0x8)(ZeroConstructor)

	static class UClass* StaticClass();
	static class UNavMovementComponent* GetDefaultObj();

	void StopMovementKeepPathing();
	void StopActiveMovement();
	void IsSwimming(bool ReturnValue);
	void IsMovingOnGround(bool ReturnValue);
	void IsFlying(bool ReturnValue);
	void IsFalling(bool ReturnValue);
	void IsCrouching(bool ReturnValue);
};

// 0x8 (0x170 - 0x168)
// Class Engine.PawnMovementComponent
class UPawnMovementComponent : public UNavMovementComponent
{
public:
	class APawn*                                 PawnOwner;                                         // 0x168(0x8)(ZeroConstructor)

	static class UClass* StaticClass();
	static class UPawnMovementComponent* GetDefaultObj();

	void IsMoveInputIgnored(bool ReturnValue);
	void GetPendingInputVector(const struct FVector& ReturnValue);
	void GetPawnOwner(class APawn* ReturnValue);
	void GetLastInputVector(const struct FVector& ReturnValue);
	void ConsumeInputVector(const struct FVector& ReturnValue);
	void AddInputVector(const struct FVector& WorldVector, bool bForce);
};

// 0x18 (0x188 - 0x170)
// Class Engine.FloatingPawnMovement
class UFloatingPawnMovement : public UPawnMovementComponent
{
public:
	float                                        MaxSpeed;                                          // 0x170(0x4)(None)
	float                                        Acceleration;                                      // 0x174(0x4)(None)
	float                                        Deceleration;                                      // 0x178(0x4)(None)
	float                                        TurningBoost;                                      // 0x17C(0x4)(None)
	uint8                                        bPositionCorrected : 1;                            // Mask: 0x1, PropSize: 0x10x180(0x1)(None)
	uint8                                        Pad_A02[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFloatingPawnMovement* GetDefaultObj();

};

// 0x8 (0x190 - 0x188)
// Class Engine.SpectatorPawnMovement
class USpectatorPawnMovement : public UFloatingPawnMovement
{
public:
	uint8                                        bIgnoreTimeDilation : 1;                           // Mask: 0x1, PropSize: 0x10x188(0x1)(None)
	uint8                                        Pad_A06[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USpectatorPawnMovement* GetDefaultObj();

};

// 0x98 (0x550 - 0x4B8)
// Class Engine.Pawn
class APawn : public AActor
{
public:
	uint8                                        Pad_A42[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bUseControllerRotationPitch : 1;                   // Mask: 0x1, PropSize: 0x10x4C0(0x1)(None)
	uint8                                        bUseControllerRotationYaw : 1;                     // Mask: 0x2, PropSize: 0x10x4C0(0x1)(None)
	uint8                                        bUseControllerRotationRoll : 1;                    // Mask: 0x4, PropSize: 0x10x4C0(0x1)(None)
	uint8                                        bCanAffectNavigationGeneration : 1;                // Mask: 0x8, PropSize: 0x10x4C0(0x1)(None)
	uint8                                        bForceUseCustomCameraComponent : 1;                // Mask: 0x10, PropSize: 0x10x4C0(0x1)(None)
	uint8                                        bDisableControllerDesiredRotation : 1;             // Mask: 0x20, PropSize: 0x10x4C0(0x1)(None)
	uint8                                        BitPad_94 : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bIsLocalViewTarget : 1;                            // Mask: 0x1, PropSize: 0x10x4C1(0x1)(None)
	uint8                                        BitPad_95 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_A43[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BaseEyeHeight;                                     // 0x4C4(0x4)(None)
	enum class EAutoReceiveInput                 AutoPossessPlayer;                                 // 0x4C8(0x1)(None)
	enum class EAutoPossessAI                    AutoPossessAI;                                     // 0x4C9(0x1)(None)
	uint8                                        RemoteViewPitch;                                   // 0x4CA(0x1)(None)
	uint8                                        Pad_A44[0x5];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                AIControllerClass;                                 // 0x4D0(0x8)(ZeroConstructor)
	class APlayerState*                          PlayerState;                                       // 0x4D8(0x8)(ZeroConstructor)
	uint8                                        Pad_A46[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AController*                           LastHitBy;                                         // 0x4E8(0x8)(ZeroConstructor)
	class AController*                           Controller;                                        // 0x4F0(0x8)(ZeroConstructor)
	class AController*                           PreviousController;                                // 0x4F8(0x8)(ZeroConstructor)
	uint8                                        Pad_A47[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastSparseDelegateProperty_            ReceiveControllerChangedDelegate;                  // 0x504(0x1)(ZeroConstructor)
	FMulticastSparseDelegateProperty_            ReceiveRestartedDelegate;                          // 0x505(0x1)(ZeroConstructor)
	uint8                                        Pad_A48[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               ControlInputVector;                                // 0x508(0x18)(None)
	struct FVector                               LastControlInputVector;                            // 0x520(0x18)(None)
	class UClass*                                OverrideInputComponentClass;                       // 0x538(0x8)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnMovementTetherSet;                               // 0x540(0x10)(ZeroConstructor)

	static class UClass* StaticClass();
	static class APawn* GetDefaultObj();

	void SpawnDefaultController();
	void SetCanAffectNavigationGeneration(bool bNewValue, bool bForceUpdate);
	void ReceiveUnpossessed(class AController* OldController);
	void ReceiveRestarted();
	void ReceivePossessed(class AController* NewController);
	void ReceiveControllerChanged(class AController* OldController, class AController* NewController);
	void PossessedBy(class AController* NewController);
	void PawnMakeNoise(float Loudness, const struct FVector& NoiseLocation, bool bUseNoiseMakerLocation, class AActor* NoiseMaker);
	void OnRep_PlayerState();
	void OnRep_Controller();
	void IsPlayerControlled(bool ReturnValue);
	void IsPawnControlled(bool ReturnValue);
	void IsMoveInputIgnored(bool ReturnValue);
	void IsLocallyViewed(bool ReturnValue);
	void IsLocallyControlled(bool ReturnValue);
	void IsControlled(bool ReturnValue);
	void IsBotControlled(bool ReturnValue);
	void GetPlatformUserId(const struct FPlatformUserId& ReturnValue);
	void GetPendingMovementInputVector(const struct FVector& ReturnValue);
	void GetOverrideInputComponentClass(class UClass* ReturnValue);
	void GetNavAgentLocation(const struct FVector& ReturnValue);
	void GetMovementComponent(class UPawnMovementComponent* ReturnValue);
	void GetMovementBaseActor(class APawn* Pawn, class AActor* ReturnValue);
	void GetLocalViewingPlayerController(class APlayerController* ReturnValue);
	void GetLastMovementInputVector(const struct FVector& ReturnValue);
	void GetControlRotation(const struct FRotator& ReturnValue);
	void GetController(class AController* ReturnValue);
	void GetBaseAimRotation(const struct FRotator& ReturnValue);
	void DetachFromControllerPendingDestroy();
	void ConsumeMovementInputVector(const struct FVector& ReturnValue);
	void AddMovementInput(const struct FVector& WorldDirection, float ScaleValue, bool bForce);
	void AddControllerYawInput(float Val);
	void AddControllerRollInput(float Val);
	void AddControllerPitchInput(float Val);
};

// 0x20 (0x570 - 0x550)
// Class Engine.PrimalPawn
class APrimalPawn : public APawn
{
public:
	struct FRotator_NetQuantizeSmartPitch        LastMovementDesiredRotation;                       // 0x550(0x18)(None)
	uint8                                        bUseBPPreventMovementMode : 1;                     // Mask: 0x1, PropSize: 0x10x568(0x1)(None)
	uint8                                        bReplicateDesiredRotation : 1;                     // Mask: 0x2, PropSize: 0x10x568(0x1)(None)
	uint8                                        bIsPlayingTurningAnim : 1;                         // Mask: 0x4, PropSize: 0x10x568(0x1)(None)
	uint8                                        bClearOnConsume : 1;                               // Mask: 0x8, PropSize: 0x10x568(0x1)(None)
	uint8                                        bUse_ModifySavedMoveAcceleration_PreRep : 1;       // Mask: 0x10, PropSize: 0x10x568(0x1)(None)
	uint8                                        bUse_ModifySavedMoveAcceleration_PostRep : 1;      // Mask: 0x20, PropSize: 0x10x568(0x1)(None)
	uint8                                        BitPad_96 : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_A82[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        HarvestingDestructionMeshRangeMultipler;           // 0x56C(0x4)(None)

	static class UClass* StaticClass();
	static class APrimalPawn* GetDefaultObj();

	void ShouldIKBeForceDisabled(bool ReturnValue);
	void InterceptInputEvent(const class FString& InputName);
	void InitInputComponent();
	void GetLastMovementDesiredRotation(const struct FRotator& ReturnValue);
	void CanMove(bool ReturnValue);
	void BPSetupPlayerInputComponent(class UInputComponent* ForInputComponent);
	void BPModifyRootMotionDeltaRotation(const struct FRotator& Delta, const struct FRotator& ReturnValue);
	void BPAcknowledgeServerCorrection(float Timestamp, const struct FVector& NewLoc, const struct FVector& NewVel, class UPrimitiveComponent* NewBase, class FName NewBaseBoneName, bool bHasBase, bool bBaseRelativePosition, uint8 ServerMovementMode, bool ReturnValue);
	void BP_PreventMovementMode(enum class EMovementMode NewMovementMode, uint8 NewCustomMode, bool ReturnValue);
};

// 0x28 (0x598 - 0x570)
// Class Engine.DefaultPawn
class ADefaultPawn : public APrimalPawn
{
public:
	float                                        BaseTurnRate;                                      // 0x570(0x4)(None)
	float                                        BaseLookUpRate;                                    // 0x574(0x4)(None)
	class UPawnMovementComponent*                MovementComponent;                                 // 0x578(0x8)(ZeroConstructor)
	class USphereComponent*                      CollisionComponent;                                // 0x580(0x8)(ZeroConstructor)
	class UStaticMeshComponent*                  MeshComponent;                                     // 0x588(0x8)(ZeroConstructor)
	uint8                                        bAddDefaultMovementBindings : 1;                   // Mask: 0x1, PropSize: 0x10x590(0x1)(None)
	uint8                                        Pad_A86[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ADefaultPawn* GetDefaultObj();

	void TurnAtRate(float Rate);
	void MoveUp_World(float Val);
	void MoveRight(float Val);
	void MoveForward(float Val);
	void LookUpAtRate(float Rate);
};

// 0xC8 (0xF0 - 0x28)
// Class Engine.CameraShakeBase
class UCameraShakeBase : public UObject
{
public:
	bool                                         bSingleInstance;                                   // 0x28(0x1)(None)
	uint8                                        Pad_A88[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ShakeScale;                                        // 0x2C(0x4)(None)
	class UCameraShakePattern*                   RootShakePattern;                                  // 0x30(0x8)(ZeroConstructor)
	class APlayerCameraManager*                  CameraManager;                                     // 0x38(0x8)(None)
	uint8                                        Pad_A89[0xA8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Speed;                                             // 0xE8(0x4)(None)
	uint8                                        bIgnoreWhenBasedOnDino : 1;                        // Mask: 0x1, PropSize: 0x10xEC(0x1)(None)
	uint8                                        bIgnoreWorldShakeScaling : 1;                      // Mask: 0x2, PropSize: 0x10xEC(0x1)(None)
	uint8                                        bForceUseCameraShakeScale : 1;                     // Mask: 0x4, PropSize: 0x10xEC(0x1)(None)
	uint8                                        Pad_A8A[0x3];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCameraShakeBase* GetDefaultObj();

	void SetRootShakePattern(class UCameraShakePattern* InPattern);
	void GetRootShakePattern(class UCameraShakePattern* ReturnValue);
};

// 0x0 (0x28 - 0x28)
// Class Engine.CameraShakePattern
class UCameraShakePattern : public UObject
{
public:

	static class UClass* StaticClass();
	static class UCameraShakePattern* GetDefaultObj();

};

// 0x20 (0x48 - 0x28)
// Class Engine.CameraModifier
class UCameraModifier : public UObject
{
public:
	uint8                                        bDebug : 1;                                        // Mask: 0x1, PropSize: 0x10x28(0x1)(None)
	uint8                                        bExclusive : 1;                                    // Mask: 0x2, PropSize: 0x10x28(0x1)(None)
	uint8                                        BitPad_97 : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_AA4[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        Priority;                                          // 0x2C(0x1)(None)
	uint8                                        Pad_AA5[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class APlayerCameraManager*                  CameraOwner;                                       // 0x30(0x8)(None)
	float                                        AlphaInTime;                                       // 0x38(0x4)(None)
	float                                        AlphaOutTime;                                      // 0x3C(0x4)(None)
	float                                        Alpha;                                             // 0x40(0x4)(None)
	uint8                                        Pad_AA6[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCameraModifier* GetDefaultObj();

	void OnCameraOwnerDestroyed(class AActor* InOwner);
	void IsDisabled(bool ReturnValue);
	void GetViewTarget(class AActor* ReturnValue);
	void EnableModifier();
	void DisableModifier(bool bImmediate);
	void BlueprintModifyPostProcess(float DeltaTime, float PostProcessBlendWeight, const struct FPostProcessSettings& PostProcessSettings);
	void BlueprintModifyCamera(float DeltaTime, const struct FVector& ViewLocation, const struct FRotator& ViewRotation, float FOV, const struct FVector& NewViewLocation, const struct FRotator& NewViewRotation, float NewFOV);
};

// 0x58 (0x80 - 0x28)
// Class Engine.Commandlet
class UCommandlet : public UObject
{
public:
	class FString                                HelpDescription;                                   // 0x28(0x10)(None)
	class FString                                HelpUsage;                                         // 0x38(0x10)(None)
	class FString                                HelpWebLink;                                       // 0x48(0x10)(None)
	TArray<class FString>                        HelpParamNames;                                    // 0x58(0x10)(None)
	TArray<class FString>                        HelpParamDescriptions;                             // 0x68(0x10)(None)
	uint8                                        IsServer : 1;                                      // Mask: 0x1, PropSize: 0x10x78(0x1)(None)
	uint8                                        IsClient : 1;                                      // Mask: 0x2, PropSize: 0x10x78(0x1)(None)
	uint8                                        IsEditor : 1;                                      // Mask: 0x4, PropSize: 0x10x78(0x1)(None)
	uint8                                        LogToConsole : 1;                                  // Mask: 0x8, PropSize: 0x10x78(0x1)(None)
	uint8                                        ShowErrorCount : 1;                                // Mask: 0x10, PropSize: 0x10x78(0x1)(None)
	uint8                                        ShowProgress : 1;                                  // Mask: 0x20, PropSize: 0x10x78(0x1)(None)
	uint8                                        FastExit : 1;                                      // Mask: 0x40, PropSize: 0x10x78(0x1)(None)
	uint8                                        Pad_AA7[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCommandlet* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Engine.AssetUserData
class UAssetUserData : public UObject
{
public:

	static class UClass* StaticClass();
	static class UAssetUserData* GetDefaultObj();

};

// 0x50 (0x78 - 0x28)
// Class Engine.Exporter
class UExporter : public UObject
{
public:
	class UClass*                                SupportedClass;                                    // 0x28(0x8)(ZeroConstructor)
	class UObject*                               ExportRootScope;                                   // 0x30(0x8)(ZeroConstructor)
	TArray<class FString>                        FormatExtension;                                   // 0x38(0x10)(None)
	TArray<class FString>                        FormatDescription;                                 // 0x48(0x10)(None)
	int32                                        PreferredFormatIndex;                              // 0x58(0x4)(None)
	int32                                        TextIndent;                                        // 0x5C(0x4)(None)
	uint8                                        bText : 1;                                         // Mask: 0x1, PropSize: 0x10x60(0x1)(None)
	uint8                                        bSelectedOnly : 1;                                 // Mask: 0x2, PropSize: 0x10x60(0x1)(None)
	uint8                                        bForceFileOperations : 1;                          // Mask: 0x4, PropSize: 0x10x60(0x1)(None)
	uint8                                        BitPad_98 : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_AB8[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UAssetExportTask*                      ExportTask;                                        // 0x68(0x8)(None)
	uint8                                        Pad_AB9[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UExporter* GetDefaultObj();

	void ScriptRunAssetExportTask(class UAssetExportTask* Task, bool ReturnValue);
	void RunAssetExportTasks(const TArray<class UAssetExportTask*>& ExportTasks, bool ReturnValue);
	void RunAssetExportTask(class UAssetExportTask* Task, bool ReturnValue);
};

// 0x38 (0x60 - 0x28)
// Class Engine.EdGraph
class UEdGraph : public UObject
{
public:
	class UClass*                                Schema;                                            // 0x28(0x8)(ZeroConstructor)
	TArray<class UEdGraphNode*>                  Nodes;                                             // 0x30(0x10)(None)
	uint8                                        bEditable : 1;                                     // Mask: 0x1, PropSize: 0x10x40(0x1)(None)
	uint8                                        bAllowDeletion : 1;                                // Mask: 0x2, PropSize: 0x10x40(0x1)(None)
	uint8                                        bAllowRenaming : 1;                                // Mask: 0x4, PropSize: 0x10x40(0x1)(None)
	uint8                                        Pad_ABE[0x1F];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UEdGraph* GetDefaultObj();

};

// 0x140 (0x168 - 0x28)
// Class Engine.SoundBase
class USoundBase : public UObject
{
public:
	uint8                                        Pad_AC0[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class USoundClass*                           SoundClassObject;                                  // 0x30(0x8)(ZeroConstructor)
	uint8                                        bDebug : 1;                                        // Mask: 0x1, PropSize: 0x10x38(0x1)(None)
	uint8                                        bOverrideConcurrency : 1;                          // Mask: 0x2, PropSize: 0x10x38(0x1)(None)
	uint8                                        bEnableBusSends : 1;                               // Mask: 0x4, PropSize: 0x10x38(0x1)(None)
	uint8                                        bEnableBaseSubmix : 1;                             // Mask: 0x8, PropSize: 0x10x38(0x1)(None)
	uint8                                        bEnableSubmixSends : 1;                            // Mask: 0x10, PropSize: 0x10x38(0x1)(None)
	uint8                                        bHasDelayNode : 1;                                 // Mask: 0x20, PropSize: 0x10x38(0x1)(None)
	uint8                                        bHasConcatenatorNode : 1;                          // Mask: 0x40, PropSize: 0x10x38(0x1)(None)
	uint8                                        bBypassVolumeScaleForPriority : 1;                 // Mask: 0x80, PropSize: 0x10x38(0x1)(None)
	enum class EVirtualizationMode               VirtualizationMode;                                // 0x39(0x1)(None)
	uint8                                        Pad_AC1[0x56];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSet<class USoundConcurrency*>               ConcurrencySet;                                    // 0x90(0x50)(ZeroConstructor)
	struct FSoundConcurrencySettings             ConcurrencyOverrides;                              // 0xE0(0x20)(None)
	float                                        Duration;                                          // 0x100(0x4)(None)
	float                                        MaxDistance;                                       // 0x104(0x4)(None)
	float                                        TotalSamples;                                      // 0x108(0x4)(None)
	float                                        Priority;                                          // 0x10C(0x4)(None)
	class USoundAttenuation*                     AttenuationSettings;                               // 0x110(0x8)(ZeroConstructor)
	class USoundSubmixBase*                      SoundSubmixObject;                                 // 0x118(0x8)(ZeroConstructor)
	TArray<struct FSoundSubmixSendInfo>          SoundSubmixSends;                                  // 0x120(0x10)(ZeroConstructor)
	class USoundEffectSourcePresetChain*         SourceEffectChain;                                 // 0x130(0x8)(ZeroConstructor)
	TArray<struct FSoundSourceBusSendInfo>       BusSends;                                          // 0x138(0x10)(ZeroConstructor)
	TArray<struct FSoundSourceBusSendInfo>       PreEffectBusSends;                                 // 0x148(0x10)(ZeroConstructor)
	TArray<class UAssetUserData*>                AssetUserData;                                     // 0x158(0x10)(None)

	static class UClass* StaticClass();
	static class USoundBase* GetDefaultObj();

};

// 0x300 (0x468 - 0x168)
// Class Engine.SoundWave
class USoundWave : public USoundBase
{
public:
	uint8                                        Pad_ACA[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CompressionQuality;                                // 0x178(0x4)(None)
	int32                                        StreamingPriority;                                 // 0x17C(0x4)(None)
	enum class ESoundwaveSampleRateSettings      SampleRateQuality;                                 // 0x180(0x1)(None)
	uint8                                        Pad_ACC[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	enum class ESoundGroup                       SoundGroup;                                        // 0x182(0x1)(None)
	uint8                                        bLooping : 1;                                      // Mask: 0x1, PropSize: 0x10x183(0x1)(None)
	uint8                                        bStreaming : 1;                                    // Mask: 0x2, PropSize: 0x10x183(0x1)(None)
	uint8                                        BitPad_99 : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	enum class ESoundAssetCompressionType        SoundAssetCompressionType;                         // 0x184(0x1)(None)
	uint8                                        bSeekableStreaming : 1;                            // Mask: 0x1, PropSize: 0x10x185(0x1)(None)
	uint8                                        bUseBinkAudio : 1;                                 // Mask: 0x2, PropSize: 0x10x185(0x1)(None)
	uint8                                        BitPad_9A : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_ACD[0x1A];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSoundModulationDefaultRoutingSettings ModulationSettings;                                // 0x1A0(0x188)(ZeroConstructor)
	TArray<float>                                FrequenciesToAnalyze;                              // 0x328(0x10)(None)
	TArray<struct FSoundWaveSpectralTimeData>    CookedSpectralTimeData;                            // 0x338(0x10)(None)
	TArray<struct FSoundWaveEnvelopeTimeData>    CookedEnvelopeTimeData;                            // 0x348(0x10)(None)
	int32                                        InitialChunkSize;                                  // 0x358(0x4)(None)
	uint8                                        Pad_ACE[0x40];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        BitPad_9B : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bMature : 1;                                       // Mask: 0x20, PropSize: 0x10x39C(0x1)(None)
	uint8                                        bManualWordWrap : 1;                               // Mask: 0x40, PropSize: 0x10x39C(0x1)(None)
	uint8                                        bSingleLine : 1;                                   // Mask: 0x80, PropSize: 0x10x39C(0x1)(None)
	uint8                                        bIsAmbisonics : 1;                                 // Mask: 0x1, PropSize: 0x10x39D(0x1)(None)
	uint8                                        BitPad_9C : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
