#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------

enum class ETextGender : uint8
{
	Masculine                      = 0,
	Feminine                       = 1,
	Neuter                         = 2,
	ETextGender_MAX                = 3,
};

enum class EFormatArgumentType : uint8
{
	Int                            = 0,
	UInt                           = 1,
	Float                          = 2,
	Double                         = 3,
	Text                           = 4,
	Gender                         = 5,
	EFormatArgumentType_MAX        = 6,
};

enum class EAnimDataModelNotifyType : uint8
{
	BracketOpened                  = 0,
	BracketClosed                  = 1,
	TrackAdded                     = 2,
	TrackChanged                   = 3,
	TrackRemoved                   = 4,
	SequenceLengthChanged          = 5,
	FrameRateChanged               = 6,
	CurveAdded                     = 7,
	CurveChanged                   = 8,
	CurveRemoved                   = 9,
	CurveFlagsChanged              = 10,
	CurveRenamed                   = 11,
	CurveScaled                    = 12,
	CurveColorChanged              = 13,
	AttributeAdded                 = 14,
	AttributeRemoved               = 15,
	AttributeChanged               = 16,
	Populated                      = 17,
	Reset                          = 18,
	Invalid                        = 19,
	EAnimDataModelNotifyType_MAX   = 20,
};

enum class EMovementMode : uint8
{
	MOVE_None                      = 0,
	MOVE_Walking                   = 1,
	MOVE_NavWalking                = 2,
	MOVE_Falling                   = 3,
	MOVE_Swimming                  = 4,
	MOVE_Flying                    = 5,
	MOVE_Custom                    = 6,
	MOVE_MAX                       = 7,
};

enum class EAudioComponentPlayState : uint8
{
	Playing                        = 0,
	Stopped                        = 1,
	Paused                         = 2,
	FadingIn                       = 3,
	FadingOut                      = 4,
	Count                          = 5,
	EAudioComponentPlayState_MAX   = 6,
};

enum class EDataLayerRuntimeState : uint8
{
	Unloaded                       = 0,
	Loaded                         = 1,
	Activated                      = 2,
	EDataLayerRuntimeState_MAX     = 3,
};

enum class EQuartzCommandDelegateSubType : uint8
{
	CommandOnFailedToQueue         = 0,
	CommandOnQueued                = 1,
	CommandOnCanceled              = 2,
	CommandOnAboutToStart          = 3,
	CommandOnStarted               = 4,
	Count                          = 5,
	EQuartzCommandDelegateSubType_MAX = 6,
};

enum class EQuartzCommandQuantization : uint8
{
	Bar                            = 0,
	Beat                           = 1,
	ThirtySecondNote               = 2,
	SixteenthNote                  = 3,
	EighthNote                     = 4,
	QuarterNote                    = 5,
	HalfNote                       = 6,
	WholeNote                      = 7,
	DottedSixteenthNote            = 8,
	DottedEighthNote               = 9,
	DottedQuarterNote              = 10,
	DottedHalfNote                 = 11,
	DottedWholeNote                = 12,
	SixteenthNoteTriplet           = 13,
	EighthNoteTriplet              = 14,
	QuarterNoteTriplet             = 15,
	HalfNoteTriplet                = 16,
	Tick                           = 17,
	Count                          = 18,
	None                           = 19,
	EQuartzCommandQuantization_MAX = 20,
};

enum class EPlatformInterfaceDataType : uint8
{
	PIDT_None                      = 0,
	PIDT_Int                       = 1,
	PIDT_Float                     = 2,
	PIDT_String                    = 3,
	PIDT_Object                    = 4,
	PIDT_Custom                    = 5,
	PIDT_MAX                       = 6,
};

enum class EEndPlayReason : uint8
{
	Destroyed                      = 0,
	LevelTransition                = 1,
	EndPlayInEditor                = 2,
	RemovedFromWorld               = 3,
	Quit                           = 4,
	EEndPlayReason_MAX             = 5,
};

enum class ETickingGroup : uint8
{
	TG_PrePhysics                  = 0,
	TG_StartPhysics                = 1,
	TG_DuringPhysics               = 2,
	TG_EndPhysics                  = 3,
	TG_PostPhysics                 = 4,
	TG_PostUpdateWork              = 5,
	TG_LastDemotable               = 6,
	TG_NewlySpawned                = 7,
	TG_MAX                         = 8,
};

enum class EComponentCreationMethod : uint8
{
	Native                         = 0,
	SimpleConstructionScript       = 1,
	UserConstructionScript         = 2,
	Instance                       = 3,
	EComponentCreationMethod_MAX   = 4,
};

enum class ETemperatureSeverityType : uint8
{
	Unknown                        = 0,
	Good                           = 1,
	Bad                            = 2,
	Serious                        = 3,
	Critical                       = 4,
	NumSeverities                  = 5,
	ETemperatureSeverityType_MAX   = 6,
};

enum class EPlaneConstraintAxisSetting : uint8
{
	Custom                         = 0,
	X                              = 1,
	Y                              = 2,
	Z                              = 3,
	UseGlobalPhysicsSetting        = 4,
	EPlaneConstraintAxisSetting_MAX = 5,
};

enum class EInterpToBehaviourType : uint8
{
	OneShot                        = 0,
	OneShot_Reverse                = 1,
	Loop_Reset                     = 2,
	PingPong                       = 3,
	EInterpToBehaviourType_MAX     = 4,
};

enum class ETeleportType : uint8
{
	None                           = 0,
	TeleportPhysics                = 1,
	ResetPhysics                   = 2,
	ETeleportType_MAX              = 3,
};

enum class EObjectTypeQuery : uint8
{
	ObjectTypeQuery1               = 0,
	ObjectTypeQuery2               = 1,
	ObjectTypeQuery3               = 2,
	ObjectTypeQuery4               = 3,
	ObjectTypeQuery5               = 4,
	ObjectTypeQuery6               = 5,
	ObjectTypeQuery7               = 6,
	ObjectTypeQuery8               = 7,
	ObjectTypeQuery9               = 8,
	ObjectTypeQuery10              = 9,
	ObjectTypeQuery11              = 10,
	ObjectTypeQuery12              = 11,
	ObjectTypeQuery13              = 12,
	ObjectTypeQuery14              = 13,
	ObjectTypeQuery15              = 14,
	ObjectTypeQuery16              = 15,
	ObjectTypeQuery17              = 16,
	ObjectTypeQuery18              = 17,
	ObjectTypeQuery19              = 18,
	ObjectTypeQuery20              = 19,
	ObjectTypeQuery21              = 20,
	ObjectTypeQuery22              = 21,
	ObjectTypeQuery23              = 22,
	ObjectTypeQuery24              = 23,
	ObjectTypeQuery25              = 24,
	ObjectTypeQuery26              = 25,
	ObjectTypeQuery27              = 26,
	ObjectTypeQuery28              = 27,
	ObjectTypeQuery29              = 28,
	ObjectTypeQuery30              = 29,
	ObjectTypeQuery31              = 30,
	ObjectTypeQuery32              = 31,
	ObjectTypeQuery_MAX            = 32,
	EObjectTypeQuery_MAX           = 33,
};

enum class EDrawDebugTrace : uint8
{
	None                           = 0,
	ForOneFrame                    = 1,
	ForDuration                    = 2,
	Persistent                     = 3,
	EDrawDebugTrace_MAX            = 4,
};

enum class ETraceTypeQuery : uint8
{
	TraceTypeQuery1                = 0,
	TraceTypeQuery2                = 1,
	TraceTypeQuery3                = 2,
	TraceTypeQuery4                = 3,
	TraceTypeQuery5                = 4,
	TraceTypeQuery6                = 5,
	TraceTypeQuery7                = 6,
	TraceTypeQuery8                = 7,
	TraceTypeQuery9                = 8,
	TraceTypeQuery10               = 9,
	TraceTypeQuery11               = 10,
	TraceTypeQuery12               = 11,
	TraceTypeQuery13               = 12,
	TraceTypeQuery14               = 13,
	TraceTypeQuery15               = 14,
	TraceTypeQuery16               = 15,
	TraceTypeQuery17               = 16,
	TraceTypeQuery18               = 17,
	TraceTypeQuery19               = 18,
	TraceTypeQuery20               = 19,
	TraceTypeQuery21               = 20,
	TraceTypeQuery22               = 21,
	TraceTypeQuery23               = 22,
	TraceTypeQuery24               = 23,
	TraceTypeQuery25               = 24,
	TraceTypeQuery26               = 25,
	TraceTypeQuery27               = 26,
	TraceTypeQuery28               = 27,
	TraceTypeQuery29               = 28,
	TraceTypeQuery30               = 29,
	TraceTypeQuery31               = 30,
	TraceTypeQuery32               = 31,
	TraceTypeQuery_MAX             = 32,
	ETraceTypeQuery_MAX            = 33,
};

enum class ENetworkModeResult : uint8
{
	Yes                            = 0,
	No                             = 1,
	ENetworkModeResult_MAX         = 2,
};

enum class EMoveComponentAction : uint8
{
	Move                           = 0,
	Stop                           = 1,
	Return                         = 2,
	EMoveComponentAction_MAX       = 3,
};

enum class EQuitPreference : uint8
{
	Quit                           = 0,
	Background                     = 1,
	EQuitPreference_MAX            = 2,
};

enum class ENetModeBP : uint8
{
	Standalone                     = 0,
	DedicatedServer                = 1,
	ListenServer                   = 2,
	Client                         = 3,
	ENetModeBP_MAX                 = 4,
};

enum class ETravelFailure : uint8
{
	NoLevel                        = 0,
	LoadMapFailure                 = 1,
	InvalidURL                     = 2,
	PackageMissing                 = 3,
	PackageVersion                 = 4,
	NoDownload                     = 5,
	TravelFailure                  = 6,
	CheatCommands                  = 7,
	PendingNetGameCreateFailure    = 8,
	CloudSaveFailure               = 9,
	ServerTravelFailure            = 10,
	ClientTravelFailure            = 11,
	ETravelFailure_MAX             = 12,
};

enum class EScreenOrientation : uint8
{
	Unknown                        = 0,
	Portrait                       = 1,
	PortraitUpsideDown             = 2,
	LandscapeLeft                  = 3,
	LandscapeRight                 = 4,
	FaceUp                         = 5,
	FaceDown                       = 6,
	PortraitSensor                 = 7,
	LandscapeSensor                = 8,
	FullSensor                     = 9,
	EScreenOrientation_MAX         = 10,
};

enum class EApplicationState : uint8
{
	Unknown                        = 0,
	Inactive                       = 1,
	Background                     = 2,
	Active                         = 3,
	EApplicationState_MAX          = 4,
};

enum class EComponentPhysicsStateChange : uint8
{
	Created                        = 0,
	Destroyed                      = 1,
	EComponentPhysicsStateChange_MAX = 2,
};

enum class EMouseLockMode : uint8
{
	DoNotLock                      = 0,
	LockOnCapture                  = 1,
	LockAlways                     = 2,
	LockInFullscreen               = 3,
	EMouseLockMode_MAX             = 4,
};

enum class EWindowTitleBarMode : uint8
{
	Overlay                        = 0,
	VerticalBox                    = 1,
	EWindowTitleBarMode_MAX        = 2,
};

enum class EInputEvent : uint8
{
	IE_Pressed                     = 0,
	IE_Released                    = 1,
	IE_Repeat                      = 2,
	IE_DoubleClick                 = 3,
	IE_Axis                        = 4,
	IE_MAX                         = 5,
};

enum class ERelativeTransformSpace : uint8
{
	RTS_World                      = 0,
	RTS_Actor                      = 1,
	RTS_Component                  = 2,
	RTS_ParentBoneSpace            = 3,
	RTS_MAX                        = 4,
};

enum class EAttachLocation : uint8
{
	KeepRelativeOffset             = 0,
	KeepWorldPosition              = 1,
	SnapToTarget                   = 2,
	SnapToTargetIncludingScale     = 3,
	EAttachLocation_MAX            = 4,
};

enum class EAttachmentRule : uint8
{
	KeepRelative                   = 0,
	KeepWorld                      = 1,
	SnapToTarget                   = 2,
	KeepWorldLegacy                = 3,
	EAttachmentRule_MAX            = 4,
};

enum class EDetachmentRule : uint8
{
	KeepRelative                   = 0,
	KeepWorld                      = 1,
	EDetachmentRule_MAX            = 2,
};

enum class EComponentMobility : uint8
{
	Static                         = 0,
	Stationary                     = 1,
	Movable                        = 2,
	EComponentMobility_MAX         = 3,
};

enum class EDetailMode : uint8
{
	DM_Low                         = 0,
	DM_Medium                      = 1,
	DM_High                        = 2,
	DM_MAX                         = 3,
};

enum class ECollisionEnabled : uint8
{
	NoCollision                    = 0,
	QueryOnly                      = 1,
	PhysicsOnly                    = 2,
	QueryAndPhysics                = 3,
	ProbeOnly                      = 4,
	QueryAndProbe                  = 5,
	ECollisionEnabled_MAX          = 6,
};

enum class ECollisionChannel : uint8
{
	ECC_WorldStatic                = 0,
	ECC_WorldDynamic               = 1,
	ECC_Visibility                 = 2,
	ECC_PhysicsBody                = 3,
	ECC_Destructible               = 4,
	ECC_GameTraceChannel1          = 5,
	ECC_GameTraceChannel2          = 6,
	ECC_GameTraceChannel3          = 7,
	ECC_GameTraceChannel4          = 8,
	ECC_GameTraceChannel5          = 9,
	ECC_GameTraceChannel6          = 10,
	ECC_GameTraceChannel7          = 11,
	ECC_GameTraceChannel8          = 12,
	ECC_GameTraceChannel9          = 13,
	ECC_GameTraceChannel10         = 14,
	ECC_GameTraceChannel11         = 15,
	ECC_GameTraceChannel12         = 16,
	ECC_GameTraceChannel13         = 17,
	ECC_GameTraceChannel14         = 18,
	ECC_GameTraceChannel15         = 19,
	ECC_GameTraceChannel16         = 20,
	ECC_GameTraceChannel17         = 21,
	ECC_GameTraceChannel18         = 22,
	ECC_GameTraceChannel19         = 23,
	ECC_GameTraceChannel20         = 24,
	ECC_GameTraceChannel21         = 25,
	ECC_GameTraceChannel22         = 26,
	ECC_GameTraceChannel23         = 27,
	ECC_GameTraceChannel24         = 28,
	ECC_GameTraceChannel25         = 29,
	ECC_GameTraceChannel26         = 30,
	ECC_GameTraceChannel27         = 31,
	ECC_OverlapAll_Deprecated      = 32,
	ECC_MAX                        = 33,
};

enum class ECollisionResponse : uint8
{
	ECR_Ignore                     = 0,
	ECR_Overlap                    = 1,
	ECR_Block                      = 2,
	ECR_MAX                        = 3,
};

enum class EWalkableSlopeBehavior : uint8
{
	WalkableSlope_Default          = 0,
	WalkableSlope_Increase         = 1,
	WalkableSlope_Decrease         = 2,
	WalkableSlope_Unwalkable       = 3,
	WalkableSlope_Max              = 4,
};

enum class EHLODLevelExclusion : uint8
{
	HLOD0                          = 1,
	HLOD1                          = 2,
	HLOD2                          = 4,
	HLOD3                          = 8,
	HLOD4                          = 16,
	HLOD5                          = 32,
	HLOD6                          = 64,
	HLOD7                          = 128,
	EHLODLevelExclusion_MAX        = 129,
};

enum class EDOFMode : uint8
{
	Default                        = 0,
	SixDOF                         = 1,
	YZPlane                        = 2,
	XZPlane                        = 3,
	XYPlane                        = 4,
	CustomPlane                    = 5,
	None                           = 6,
	EDOFMode_MAX                   = 7,
};

enum class ERendererStencilMask : uint8
{
	ERSM_Default                   = 0,
	ERSM_255                       = 1,
	ERSM_1                         = 2,
	ERSM_2                         = 3,
	ERSM_4                         = 4,
	ERSM_8                         = 5,
	ERSM_16                        = 6,
	ERSM_32                        = 7,
	ERSM_64                        = 8,
	ERSM_128                       = 9,
	ERSM_MAX                       = 10,
};

enum class ERayTracingGroupCullingPriority : uint8
{
	CP_0_NEVER_CULL                = 0,
	CP_1                           = 1,
	CP_2                           = 2,
	CP_3                           = 3,
	CP_4_DEFAULT                   = 4,
	CP_5                           = 5,
	CP_6                           = 6,
	CP_7                           = 7,
	CP_8_QUICKLY_CULL              = 8,
	CP_MAX                         = 9,
};

enum class EPrimalEquipmentType : uint8
{
	Hat                            = 0,
	Shirt                          = 1,
	Pants                          = 2,
	Boots                          = 3,
	Gloves                         = 4,
	DinoSaddle                     = 5,
	Trophy                         = 6,
	Costume                        = 7,
	Shield                         = 8,
	Weapon                         = 9,
	Snapshot                       = 10,
	Pet                            = 11,
	MAX                            = 12,
};

enum class ERuntimeVirtualTextureMainPassType : uint8
{
	Never                          = 0,
	Exclusive                      = 1,
	Always                         = 2,
	ERuntimeVirtualTextureMainPassType_MAX = 3,
};

enum class ECanBeCharacterBase : uint8
{
	ECB_No                         = 0,
	ECB_Yes                        = 1,
	ECB_Owner                      = 2,
	ECB_MAX                        = 3,
};

enum class EHasCustomNavigableGeometry : uint8
{
	No                             = 0,
	Yes                            = 1,
	EvenIfNotCollidable            = 2,
	DontExport                     = 3,
	EHasCustomNavigableGeometry_MAX = 4,
};

enum class EShadowCacheInvalidationBehavior : uint8
{
	Auto                           = 0,
	Always                         = 1,
	Rigid                          = 2,
	Static                         = 3,
	EShadowCacheInvalidationBehavior_MAX = 4,
};

enum class EHLODBatchingPolicy : uint8
{
	None                           = 0,
	MeshSection                    = 1,
	Instancing                     = 2,
	EHLODBatchingPolicy_MAX        = 3,
};

enum class ELightmapType : uint8
{
	Default                        = 0,
	ForceSurface                   = 1,
	ForceVolumetric                = 2,
	ELightmapType_MAX              = 3,
};

enum class EIndirectLightingCacheQuality : uint8
{
	ILCQ_Off                       = 0,
	ILCQ_Point                     = 1,
	ILCQ_Volume                    = 2,
	ILCQ_MAX                       = 3,
};

enum class ESceneDepthPriorityGroup : uint8
{
	SDPG_World                     = 0,
	SDPG_Foreground                = 1,
	SDPG_MAX                       = 2,
};

enum class EAnimationKeyFormat : uint8
{
	AKF_ConstantKeyLerp            = 0,
	AKF_VariableKeyLerp            = 1,
	AKF_PerTrackCompression        = 2,
	AKF_MAX                        = 3,
};

enum class EAnimCurveType : uint8
{
	AttributeCurve                 = 0,
	MaterialCurve                  = 1,
	MorphTargetCurve               = 2,
	MaxAnimCurveType               = 3,
	EAnimCurveType_MAX             = 4,
};

enum class EAnimAssetCurveFlags : uint8
{
	AACF_NONE                      = 0,
	AACF_DriveMorphTarget_DEPRECATED = 1,
	AACF_DriveAttribute_DEPRECATED = 2,
	AACF_Editable                  = 4,
	AACF_DriveMaterial_DEPRECATED  = 8,
	AACF_Metadata                  = 16,
	AACF_DriveTrack                = 32,
	AACF_Disabled                  = 64,
	AACF_MAX                       = 65,
};

enum class ERawCurveTrackTypes : uint8
{
	RCT_Float                      = 0,
	RCT_Vector                     = 1,
	RCT_Transform                  = 2,
	RCT_MAX                        = 3,
};

enum class ERootMotionRootLock : uint8
{
	RefPose                        = 0,
	AnimFirstFrame                 = 1,
	Zero                           = 2,
	ERootMotionRootLock_MAX        = 3,
};

enum class ERootMotionMode : uint8
{
	NoRootMotionExtraction         = 0,
	IgnoreRootMotion               = 1,
	RootMotionFromEverything       = 2,
	RootMotionFromMontagesOnly     = 3,
	ERootMotionMode_MAX            = 4,
};

enum class EAdditiveBasePoseType : uint8
{
	ABPT_None                      = 0,
	ABPT_RefPose                   = 1,
	ABPT_AnimScaled                = 2,
	ABPT_AnimFrame                 = 3,
	ABPT_LocalAnimFrame            = 4,
	ABPT_MAX                       = 5,
};

enum class EAnimationCompressionFormat : uint8
{
	ACF_None                       = 0,
	ACF_Float96NoW                 = 1,
	ACF_Fixed48NoW                 = 2,
	ACF_IntervalFixed32NoW         = 3,
	ACF_Fixed32NoW                 = 4,
	ACF_Float32NoW                 = 5,
	ACF_Identity                   = 6,
	ACF_MAX                        = 7,
};

enum class EAnimPhysTwistAxis : uint8
{
	AxisX                          = 0,
	AxisY                          = 1,
	AxisZ                          = 2,
	AnimPhysTwistAxis_MAX          = 3,
};

enum class EAnimPhysCollisionType : uint8
{
	CoM                            = 0,
	CustomSphere                   = 1,
	InnerSphere                    = 2,
	OuterSphere                    = 3,
	AnimPhysCollisionType_MAX      = 4,
};

enum class ETypeAdvanceAnim : uint8
{
	ETAA_Default                   = 0,
	ETAA_Finished                  = 1,
	ETAA_Looped                    = 2,
	ETAA_MAX                       = 3,
};

enum class EBoneAxis : uint8
{
	BA_X                           = 0,
	BA_Y                           = 1,
	BA_Z                           = 2,
	BA_MAX                         = 3,
};

enum class EBoneControlSpace : uint8
{
	BCS_WorldSpace                 = 0,
	BCS_ComponentSpace             = 1,
	BCS_ParentBoneSpace            = 2,
	BCS_BoneSpace                  = 3,
	BCS_MAX                        = 4,
};

enum class EBoneRotationSource : uint8
{
	BRS_KeepComponentSpaceRotation = 0,
	BRS_KeepLocalSpaceRotation     = 1,
	BRS_CopyFromTarget             = 2,
	BRS_MAX                        = 3,
};

enum class EMontageNotifyTickType : uint8
{
	Queued                         = 0,
	BranchingPoint                 = 1,
	EMontageNotifyTickType_MAX     = 2,
};

enum class ENotifyFilterType : uint8
{
	NoFiltering                    = 0,
	LOD                            = 1,
	ENotifyFilterType_MAX          = 2,
};

enum class EAdditiveAnimationType : uint8
{
	AAT_None                       = 0,
	AAT_LocalSpaceBase             = 1,
	AAT_RotationOffsetMeshSpace    = 2,
	AAT_MAX                        = 3,
};

enum class ECurveBlendOption : uint8
{
	Override                       = 0,
	DoNotOverride                  = 1,
	NormalizeByWeight              = 2,
	BlendByWeight                  = 3,
	UseBasePose                    = 4,
	UseMaxValue                    = 5,
	UseMinValue                    = 6,
	ECurveBlendOption_MAX          = 7,
};

enum class EAnimInterpolationType : uint8
{
	Linear                         = 0,
	Step                           = 1,
	EAnimInterpolationType_MAX     = 2,
};

enum class EAxisOption : uint8
{
	X                              = 0,
	Y                              = 1,
	Z                              = 2,
	X_Neg                          = 3,
	Y_Neg                          = 4,
	Z_Neg                          = 5,
	Custom                         = 6,
	EAxisOption_MAX                = 7,
};

enum class EComponentType : uint8
{
	None                           = 0,
	TranslationX                   = 1,
	TranslationY                   = 2,
	TranslationZ                   = 3,
	RotationX                      = 4,
	RotationY                      = 5,
	RotationZ                      = 6,
	Scale                          = 7,
	ScaleX                         = 8,
	ScaleY                         = 9,
	ScaleZ                         = 10,
	EComponentType_MAX             = 11,
};

enum class EAudioOutputTarget : uint8
{
	Speaker                        = 0,
	Controller                     = 1,
	ControllerFallbackToSpeaker    = 2,
	EAudioOutputTarget_MAX         = 3,
};

enum class EAuxSceneTextures : uint8
{
	AST_2D_00                      = 0,
	AST_2D_01                      = 1,
	AST_2D_02                      = 2,
	AST_2D_03                      = 3,
	AST_2D_04                      = 4,
	AST_2D_05                      = 5,
	AST_2D_06                      = 6,
	AST_2D_07                      = 7,
	AST_2D_08                      = 8,
	AST_2D_09                      = 9,
	AST_2D_10                      = 10,
	AST_2D_11                      = 11,
	AST_2D_12                      = 12,
	AST_2D_13                      = 13,
	AST_2D_14                      = 14,
	AST_2D_15                      = 15,
	AST_2D_16                      = 16,
	AST_2D_17                      = 17,
	AST_2D_18                      = 18,
	AST_2D_19                      = 19,
	AST_2D_20                      = 20,
	AST_2D_21                      = 21,
	AST_2D_22                      = 22,
	AST_2D_23                      = 23,
	AST_2D_24                      = 24,
	AST_3D_00                      = 25,
	AST_3D_01                      = 26,
	AST_3D_02                      = 27,
	AST_3D_03                      = 28,
	AST_3D_04                      = 29,
	AST_3D_05                      = 30,
	AST_3D_06                      = 31,
	AST_3D_07                      = 32,
	AST_3D_08                      = 33,
	AST_3D_09                      = 34,
	AST_3D_10                      = 35,
	AST_3D_11                      = 36,
	AST_3D_12                      = 37,
	AST_3D_13                      = 38,
	AST_3D_14                      = 39,
	AST_3D_15                      = 40,
	AST_3D_16                      = 41,
	AST_3D_17                      = 42,
	AST_3D_18                      = 43,
	AST_3D_19                      = 44,
	AST_3D_20                      = 45,
	AST_3D_21                      = 46,
	AST_3D_22                      = 47,
	AST_3D_23                      = 48,
	AST_3D_24                      = 49,
	AST_Tot_Num                    = 50,
	AST_2D_Start                   = 0,
	AST_2D_End                     = 25,
	AST_3D_Start                   = 25,
	AST_3D_End                     = 50,
	AST_2D_Num                     = 25,
	AST_3D_Num                     = 25,
	AST_MAX                        = 51,
};

enum class EActorListsBP : uint8
{
	AL_PLAYERS                     = 0,
	AL_PLAYERSTATES                = 1,
	AL_FLOATINGHUD                 = 2,
	AL_UNSTASISEDACTORS            = 3,
	AL_NPC                         = 4,
	AL_NPC_ACTIVE                  = 5,
	AL_FORCEDHUD                   = 6,
	AL_NPCZONEMANAGERS             = 7,
	AL_PLAYERCONTROLLERS           = 8,
	AL_BEDS                        = 9,
	AL_BIOMEZONEVOLUMES            = 10,
	AL_NPC_DEAD                    = 11,
	AL_DAYCYCLEAMBIENTSOUNDS       = 12,
	AL_STRUCTURESCLIENT            = 13,
	AL_STRUCTUREPREVENTIONVOLUMES  = 14,
	AL_TRANSPONDERS                = 15,
	AL_CUSTOMACTORLISTS            = 16,
	AL_BLOCKINGVOLUMES             = 17,
	AL_AMBIENTSOUNDS               = 18,
	AL_CONNECTEDSHOOTERCHARACTERS  = 19,
	AL_EXPLORERNOTECHESTS          = 20,
	AL_SUPPLYCRATEVOLUMES          = 21,
	AL_TAMED_DINOS                 = 22,
	MAX                            = 23,
};

enum class EBlendableLocation : uint8
{
	BL_AfterTonemapping            = 0,
	BL_BeforeTonemapping           = 1,
	BL_BeforeTranslucency          = 2,
	BL_ReplacingTonemapper         = 3,
	BL_SSRInput                    = 4,
	BL_MAX                         = 5,
};

enum class EBlendSpaceAxis : uint8
{
	BSA_None                       = 0,
	BSA_X                          = 1,
	BSA_Y                          = 2,
	BSA_MAX                        = 3,
};

enum class EPreferredTriangulationDirection : uint8
{
	None                           = 0,
	Tangential                     = 1,
	Radial                         = 2,
	EPreferredTriangulationDirection_MAX = 3,
};

enum class EBlendSpacePerBoneBlendMode : uint8
{
	ManualPerBoneOverride          = 0,
	BlendProfile                   = 1,
	EBlendSpacePerBoneBlendMode_MAX = 2,
};

enum class ENotifyTriggerMode : uint8
{
	AllAnimations                  = 0,
	HighestWeightedAnimation       = 1,
	None                           = 2,
	ENotifyTriggerMode_MAX         = 3,
};

enum class EBlueprintStatus : uint8
{
	BS_Unknown                     = 0,
	BS_Dirty                       = 1,
	BS_Error                       = 2,
	BS_UpToDate                    = 3,
	BS_BeingCreated                = 4,
	BS_UpToDateWithWarnings        = 5,
	BS_MAX                         = 6,
};

enum class EBlueprintType : uint8
{
	BPTYPE_Normal                  = 0,
	BPTYPE_Const                   = 1,
	BPTYPE_MacroLibrary            = 2,
	BPTYPE_Interface               = 3,
	BPTYPE_LevelScript             = 4,
	BPTYPE_FunctionLibrary         = 5,
	BPTYPE_MAX                     = 6,
};

enum class EBlueprintCompileMode : uint8
{
	Default                        = 0,
	Development                    = 1,
	FinalRelease                   = 2,
	EBlueprintCompileMode_MAX      = 3,
};

enum class EBlueprintNativizationFlag : uint8
{
	Disabled                       = 0,
	Dependency                     = 1,
	ExplicitlyEnabled              = 2,
	EBlueprintNativizationFlag_MAX = 3,
};

enum class EShouldCookBlueprintPropertyGuids : uint8
{
	No                             = 0,
	Yes                            = 1,
	Inherit                        = 2,
	EShouldCookBlueprintPropertyGuids_MAX = 3,
};

enum class ECsgOper : uint8
{
	CSG_Active                     = 0,
	CSG_Add                        = 1,
	CSG_Subtract                   = 2,
	CSG_Intersect                  = 3,
	CSG_Deintersect                = 4,
	CSG_None                       = 5,
	CSG_MAX                        = 6,
};

enum class EBrushType : uint8
{
	Brush_Default                  = 0,
	Brush_Add                      = 1,
	Brush_Subtract                 = 2,
	Brush_MAX                      = 3,
};

enum class ECameraProjectionMode : uint8
{
	Perspective                    = 0,
	Orthographic                   = 1,
	ECameraProjectionMode_MAX      = 2,
};

enum class ECameraShakePlaySpace : uint8
{
	CameraLocal                    = 0,
	World                          = 1,
	UserDefined                    = 2,
	ECameraShakePlaySpace_MAX      = 3,
};

enum class ECloudStorageDelegate : uint8
{
	CSD_KeyValueReadComplete       = 0,
	CSD_KeyValueWriteComplete      = 1,
	CSD_ValueChanged               = 2,
	CSD_DocumentQueryComplete      = 3,
	CSD_DocumentReadComplete       = 4,
	CSD_DocumentWriteComplete      = 5,
	CSD_DocumentConflictDetected   = 6,
	CSD_MAX                        = 7,
};

enum class EContentBundleClientState : uint8
{
	Unregistered                   = 0,
	Registered                     = 1,
	ContentInjectionRequested      = 2,
	ContentRemovalRequested        = 3,
	RegistrationFailed             = 4,
	EContentBundleClientState_MAX  = 5,
};

enum class EWorldContentState : uint8
{
	NoContent                      = 0,
	ContentBundleInjected          = 1,
	EWorldContentState_MAX         = 2,
};

enum class EContentBundleStatus : uint8
{
	Registered                     = 0,
	ReadyToInject                  = 1,
	FailedToInject                 = 2,
	ContentInjected                = 3,
	Unknown                        = -1,
	EContentBundleStatus_MAX       = 4,
};

enum class ECustomAttributeBlendType : uint8
{
	Override                       = 0,
	Blend                          = 1,
	ECustomAttributeBlendType_MAX  = 2,
};

enum class EDataLayerType : uint8
{
	Runtime                        = 0,
	Editor                         = 1,
	Unknown                        = 2,
	Size                           = 3,
	EDataLayerType_MAX             = 4,
};

enum class EDistributionParamMode : uint8
{
	DPM_Normal                     = 0,
	DPM_Abs                        = 1,
	DPM_Direct                     = 2,
	DPM_MAX                        = 3,
};

enum class EDistributionVectorLockFlags : uint8
{
	EDVLF_None                     = 0,
	EDVLF_XY                       = 1,
	EDVLF_XZ                       = 2,
	EDVLF_YZ                       = 3,
	EDVLF_XYZ                      = 4,
	EDVLF_MAX                      = 5,
};

enum class EDistributionVectorMirrorFlags : uint8
{
	EDVMF_Same                     = 0,
	EDVMF_Different                = 1,
	EDVMF_Mirror                   = 2,
	EDVMF_MAX                      = 3,
};

enum class EEdGraphPinDirection : uint8
{
	EGPD_Input                     = 0,
	EGPD_Output                    = 1,
	EGPD_MAX                       = 2,
};

enum class EPinContainerType : uint8
{
	None                           = 0,
	Array                          = 1,
	Set                            = 2,
	Map                            = 3,
	EPinContainerType_MAX          = 4,
};

enum class ENodeTitleType : uint8
{
	FullTitle                      = 0,
	ListView                       = 1,
	EditableTitle                  = 2,
	MenuTitle                      = 3,
	MAX_TitleTypes                 = 4,
	ENodeTitleType_MAX             = 5,
};

enum class ENodeAdvancedPins : uint8
{
	NoPins                         = 0,
	Shown                          = 1,
	Hidden                         = 2,
	ENodeAdvancedPins_MAX          = 3,
};

enum class ENodeEnabledState : uint8
{
	Enabled                        = 0,
	Disabled                       = 1,
	DevelopmentOnly                = 2,
	ENodeEnabledState_MAX          = 3,
};

enum class EBlueprintPinStyleType : uint8
{
	BPST_Original                  = 0,
	BPST_VariantA                  = 1,
	BPST_MAX                       = 2,
};

enum class EGraphType : uint8
{
	GT_Function                    = 0,
	GT_Ubergraph                   = 1,
	GT_Macro                       = 2,
	GT_Animation                   = 3,
	GT_StateMachine                = 4,
	GT_MAX                         = 5,
};

enum class ECanCreateConnectionResponse : uint8
{
	CONNECT_RESPONSE_MAKE          = 0,
	CONNECT_RESPONSE_DISALLOW      = 1,
	CONNECT_RESPONSE_BREAK_OTHERS_A = 2,
	CONNECT_RESPONSE_BREAK_OTHERS_B = 3,
	CONNECT_RESPONSE_BREAK_OTHERS_AB = 4,
	CONNECT_RESPONSE_MAKE_WITH_CONVERSION_NODE = 5,
	CONNECT_RESPONSE_MAKE_WITH_PROMOTION = 6,
	CONNECT_RESPONSE_MAX           = 7,
};

enum class EFullyLoadPackageType : uint8
{
	FULLYLOAD_Map                  = 0,
	FULLYLOAD_Game_PreLoadClass    = 1,
	FULLYLOAD_Game_PostLoadClass   = 2,
	FULLYLOAD_Always               = 3,
	FULLYLOAD_Mutator              = 4,
	FULLYLOAD_MAX                  = 5,
};

enum class ETransitionType : uint8
{
	None                           = 0,
	Paused                         = 1,
	Loading                        = 2,
	Saving                         = 3,
	Connecting                     = 4,
	Precaching                     = 5,
	WaitingToConnect               = 6,
	MAX                            = 7,
};

enum class EMouseCaptureMode : uint8
{
	NoCapture                      = 0,
	CapturePermanently             = 1,
	CapturePermanently_IncludingInitialMouseDown = 2,
	CaptureDuringMouseDown         = 3,
	CaptureDuringRightMouseDown    = 4,
	EMouseCaptureMode_MAX          = 5,
};

enum class ENetworkLagState : uint8
{
	NotLagging                     = 0,
	Lagging                        = 1,
	ENetworkLagState_MAX           = 2,
};

enum class ETravelType : uint8
{
	TRAVEL_Absolute                = 0,
	TRAVEL_Partial                 = 1,
	TRAVEL_Relative                = 2,
	TRAVEL_MAX                     = 3,
};

enum class EDemoPlayFailure : uint8
{
	Generic                        = 0,
	DemoNotFound                   = 1,
	Corrupt                        = 2,
	InvalidVersion                 = 3,
	InitBase                       = 4,
	GameSpecificHeader             = 5,
	ReplayStreamerInternal         = 6,
	LoadMap                        = 7,
	Serialization                  = 8,
	EDemoPlayFailure_MAX           = 9,
};

enum class EViewModeIndex : uint8
{
	VMI_BrushWireframe             = 0,
	VMI_Wireframe                  = 1,
	VMI_Unlit                      = 2,
	VMI_Lit                        = 3,
	VMI_Lit_DetailLighting         = 4,
	VMI_LightingOnly               = 5,
	VMI_LightComplexity            = 6,
	VMI_ShaderComplexity           = 8,
	VMI_LightmapDensity            = 9,
	VMI_LitLightmapDensity         = 10,
	VMI_ReflectionOverride         = 11,
	VMI_VisualizeBuffer            = 12,
	VMI_StationaryLightOverlap     = 14,
	VMI_CollisionPawn              = 15,
	VMI_CollisionVisibility        = 16,
	VMI_LODColoration              = 18,
	VMI_QuadOverdraw               = 19,
	VMI_PrimitiveDistanceAccuracy  = 20,
	VMI_MeshUVDensityAccuracy      = 21,
	VMI_ShaderComplexityWithQuadOverdraw = 22,
	VMI_HLODColoration             = 23,
	VMI_GroupLODColoration         = 24,
	VMI_MaterialTextureScaleAccuracy = 25,
	VMI_RequiredTextureResolution  = 26,
	VMI_PathTracing                = 27,
	VMI_RayTracingDebug            = 28,
	VMI_VisualizeNanite            = 29,
	VMI_VirtualTexturePendingMips  = 30,
	VMI_VisualizeLumen             = 31,
	VMI_VisualizeVirtualShadowMap  = 32,
	VMI_VisualizeGPUSkinCache      = 33,
	VMI_VisualizeSubstrate         = 34,
	VMI_VisualizeGroom             = 35,
	VMI_Max                        = 36,
	VMI_Unknown                    = 255,
};

enum class EAspectRatioAxisConstraint : uint8
{
	AspectRatio_MaintainYFOV       = 0,
	AspectRatio_MaintainXFOV       = 1,
	AspectRatio_MajorAxisFOV       = 2,
	AspectRatio_MAX                = 3,
};

enum class EOcclusionCombineMode : uint8
{
	OCM_Minimum                    = 0,
	OCM_Multiply                   = 1,
	OCM_MAX                        = 2,
};

enum class EBlendMode : uint8
{
	BLEND_Opaque                   = 0,
	BLEND_Masked                   = 1,
	BLEND_Translucent              = 2,
	BLEND_Additive                 = 3,
	BLEND_Modulate                 = 4,
	BLEND_AlphaComposite           = 5,
	BLEND_AlphaHoldout             = 6,
	BLEND_TranslucentColoredTransmittance = 7,
	BLEND_MAX                      = 8,
	BLEND_TranslucentGreyTransmittance = 2,
	BLEND_ColoredTransmittanceOnly = 4,
};

enum class EMaterialFloatPrecisionMode : uint8
{
	MFPM_Default                   = 0,
	MFPM_Full_MaterialExpressionOnly = 1,
	MFPM_Full                      = 2,
	MFPM_Half                      = 3,
	MFPM_MAX                       = 4,
};

enum class ESamplerSourceMode : uint8
{
	SSM_FromTextureAsset           = 0,
	SSM_Wrap_WorldGroupSettings    = 1,
	SSM_Clamp_WorldGroupSettings   = 2,
	SSM_TerrainWeightmapGroupSettings = 3,
	SSM_MAX                        = 4,
};

enum class ETextureMipValueMode : uint8
{
	TMVM_None                      = 0,
	TMVM_MipLevel                  = 1,
	TMVM_MipBias                   = 2,
	TMVM_Derivative                = 3,
	TMVM_MAX                       = 4,
};

enum class ETranslucencyLightingMode : uint8
{
	TLM_VolumetricNonDirectional   = 0,
	TLM_VolumetricDirectional      = 1,
	TLM_VolumetricPerVertexNonDirectional = 2,
	TLM_VolumetricPerVertexDirectional = 3,
	TLM_Surface                    = 4,
	TLM_SurfacePerPixelLighting    = 5,
	TLM_MAX                        = 6,
};

enum class ERefractionMode : uint8
{
	RM_IndexOfRefraction           = 0,
	RM_PixelNormalOffset           = 1,
	RM_2DOffset                    = 2,
	RM_None                        = 3,
	RM_MAX                         = 4,
};

enum class ETranslucentSortPolicy : uint8
{
	SortByDistance                 = 0,
	SortByProjectedZ               = 1,
	SortAlongAxis                  = 2,
	ETranslucentSortPolicy_MAX     = 3,
};

enum class EDynamicGlobalIlluminationMethod : uint8
{
	None                           = 0,
	Lumen                          = 1,
	ScreenSpace                    = 2,
	RayTraced                      = 3,
	Plugin                         = 4,
	EDynamicGlobalIlluminationMethod_MAX = 5,
};

enum class EReflectionMethod : uint8
{
	None                           = 0,
	Lumen                          = 1,
	ScreenSpace                    = 2,
	RayTraced                      = 3,
	EReflectionMethod_MAX          = 4,
};

enum class EShadowMapMethod : uint8
{
	ShadowMaps                     = 0,
	VirtualShadowMaps              = 1,
	EShadowMapMethod_MAX           = 2,
};

enum class ECastRayTracedShadow : uint8
{
	Disabled                       = 0,
	UseProjectSetting              = 1,
	Enabled                        = 2,
	ECastRayTracedShadow_MAX       = 3,
};

enum class ESceneCaptureSource : uint8
{
	SCS_SceneColorHDR              = 0,
	SCS_SceneColorHDRNoAlpha       = 1,
	SCS_FinalColorLDR              = 2,
	SCS_SceneColorSceneDepth       = 3,
	SCS_SceneDepth                 = 4,
	SCS_DeviceDepth                = 5,
	SCS_Normal                     = 6,
	SCS_BaseColor                  = 7,
	SCS_FinalColorHDR              = 8,
	SCS_FinalToneCurveHDR          = 9,
	SCS_MAX                        = 10,
};

enum class ESceneCaptureCompositeMode : uint8
{
	SCCM_Overwrite                 = 0,
	SCCM_Additive                  = 1,
	SCCM_Composite                 = 2,
	SCCM_MAX                       = 3,
};

enum class EGBufferFormat : uint8
{
	Force8BitsPerChannel           = 0,
	Default                        = 1,
	HighPrecisionNormals           = 3,
	Force16BitsPerChannel          = 5,
	EGBufferFormat_MAX             = 6,
};

enum class ETrailWidthMode : uint8
{
	ETrailWidthMode_FromCentre     = 0,
	ETrailWidthMode_FromFirst      = 1,
	ETrailWidthMode_FromSecond     = 2,
	ETrailWidthMode_MAX            = 3,
};

enum class EParticleCollisionMode : uint8
{
	SceneDepth                     = 0,
	DistanceField                  = 1,
	EParticleCollisionMode_MAX     = 2,
};

enum class EMaterialShadingModel : uint8
{
	MSM_Unlit                      = 0,
	MSM_DefaultLit                 = 1,
	MSM_Subsurface                 = 2,
	MSM_PreintegratedSkin          = 3,
	MSM_ClearCoat                  = 4,
	MSM_SubsurfaceProfile          = 5,
	MSM_TwoSidedFoliage            = 6,
	MSM_Hair                       = 7,
	MSM_Cloth                      = 8,
	MSM_Eye                        = 9,
	MSM_SingleLayerWater           = 10,
	MSM_ThinTranslucent            = 11,
	MSM_Strata                     = 12,
	MSM_NUM                        = 13,
	MSM_FromMaterialExpression     = 14,
	MSM_MAX                        = 15,
};

enum class EStrataShadingModel : uint8
{
	SSM_Unlit                      = 0,
	SSM_DefaultLit                 = 1,
	SSM_SubsurfaceLit              = 2,
	SSM_VolumetricFogCloud         = 3,
	SSM_Hair                       = 4,
	SSM_Eye                        = 5,
	SSM_SingleLayerWater           = 6,
	SSM_LightFunction              = 7,
	SSM_PostProcess                = 8,
	SSM_Decal                      = 9,
	SSM_UI                         = 10,
	SSM_NUM                        = 11,
};

enum class EMaterialSamplerType : uint8
{
	SAMPLERTYPE_Color              = 0,
	SAMPLERTYPE_Grayscale          = 1,
	SAMPLERTYPE_Alpha              = 2,
	SAMPLERTYPE_Normal             = 3,
	SAMPLERTYPE_Masks              = 4,
	SAMPLERTYPE_DistanceFieldFont  = 5,
	SAMPLERTYPE_LinearColor        = 6,
	SAMPLERTYPE_LinearGrayscale    = 7,
	SAMPLERTYPE_Data               = 8,
	SAMPLERTYPE_External           = 9,
	SAMPLERTYPE_VirtualColor       = 10,
	SAMPLERTYPE_VirtualGrayscale   = 11,
	SAMPLERTYPE_VirtualAlpha       = 12,
	SAMPLERTYPE_VirtualNormal      = 13,
	SAMPLERTYPE_VirtualMasks       = 14,
	SAMPLERTYPE_VirtualLinearColor = 15,
	SAMPLERTYPE_VirtualLinearGrayscale = 16,
	SAMPLERTYPE_MAX                = 17,
};

enum class EMaterialStencilCompare : uint8
{
	MSC_Less                       = 0,
	MSC_LessEqual                  = 1,
	MSC_Greater                    = 2,
	MSC_GreaterEqual               = 3,
	MSC_Equal                      = 4,
	MSC_NotEqual                   = 5,
	MSC_Never                      = 6,
	MSC_Always                     = 7,
	MSC_Count                      = 8,
	MSC_MAX                        = 9,
};

enum class EMaterialShadingRate : uint8
{
	MSR_1x1                        = 0,
	MSR_2x1                        = 1,
	MSR_1x2                        = 2,
	MSR_2x2                        = 3,
	MSR_4x2                        = 4,
	MSR_2x4                        = 5,
	MSR_4x4                        = 6,
	MSR_Count                      = 7,
	MSR_MAX                        = 8,
};

enum class ELightingBuildQuality : uint8
{
	Quality_Preview                = 0,
	Quality_Medium                 = 1,
	Quality_High                   = 2,
	Quality_Production             = 3,
	Quality_MAX                    = 4,
};

enum class ENetworkSmoothingMode : uint8
{
	Disabled                       = 0,
	Linear                         = 1,
	Exponential                    = 2,
	ENetworkSmoothingMode_MAX      = 3,
};

enum class EOverlapFilterOption : uint8
{
	OverlapFilter_All              = 0,
	OverlapFilter_DynamicOnly      = 1,
	OverlapFilter_StaticOnly       = 2,
	OverlapFilter_MAX              = 3,
};

enum class EFilterInterpolationType : uint8
{
	BSIT_Average                   = 0,
	BSIT_Linear                    = 1,
	BSIT_Cubic                     = 2,
	BSIT_EaseInOut                 = 3,
	BSIT_ExponentialDecay          = 4,
	BSIT_SpringDamper              = 5,
	BSIT_MAX                       = 6,
};

enum class ETimelineSigType : uint8
{
	ETS_EventSignature             = 0,
	ETS_FloatSignature             = 1,
	ETS_VectorSignature            = 2,
	ETS_LinearColorSignature       = 3,
	ETS_InvalidSignature           = 4,
	ETS_MAX                        = 5,
};

enum class ELightMapPaddingType : uint8
{
	LMPT_NormalPadding             = 0,
	LMPT_PrePadding                = 1,
	LMPT_NoPadding                 = 2,
	LMPT_MAX                       = 3,
};

enum class EShadowMapFlags : uint8
{
	SMF_None                       = 0,
	SMF_Streamed                   = 1,
	SMF_MAX                        = 2,
};

enum class EUpdateRateShiftBucket : uint8
{
	ShiftBucket0                   = 0,
	ShiftBucket1                   = 1,
	ShiftBucket2                   = 2,
	ShiftBucket3                   = 3,
	ShiftBucket4                   = 4,
	ShiftBucket5                   = 5,
	ShiftBucketMax                 = 6,
	EUpdateRateShiftBucket_MAX     = 7,
};

enum class ENetRole : uint8
{
	ROLE_None                      = 0,
	ROLE_SimulatedProxy            = 1,
	ROLE_AutonomousProxy           = 2,
	ROLE_Authority                 = 3,
	ROLE_MAX                       = 4,
};

enum class ENetDormancy : uint8
{
	DORM_Never                     = 0,
	DORM_Awake                     = 1,
	DORM_DormantAll                = 2,
	DORM_DormantPartial            = 3,
	DORM_Initial                   = 4,
	DORM_MAX                       = 5,
};

enum class EAutoReceiveInput : uint8
{
	Disabled                       = 0,
	Player0                        = 1,
	Player1                        = 2,
	Player2                        = 3,
	Player3                        = 4,
	Player4                        = 5,
	Player5                        = 6,
	Player6                        = 7,
	Player7                        = 8,
	EAutoReceiveInput_MAX          = 9,
};

enum class EAutoPossessAI : uint8
{
	Disabled                       = 0,
	PlacedInWorld                  = 1,
	Spawned                        = 2,
	PlacedInWorldOrSpawned         = 3,
	EAutoPossessAI_MAX             = 4,
};

enum class EPhysicalMaterialMaskColor : uint8
{
	Red                            = 0,
	Green                          = 1,
	Blue                           = 2,
	Cyan                           = 3,
	Magenta                        = 4,
	Yellow                         = 5,
	White                          = 6,
	Black                          = 7,
	MAX                            = 8,
};

enum class EComponentSocketType : uint8
{
	Invalid                        = 0,
	Bone                           = 1,
	Socket                         = 2,
	EComponentSocketType_MAX       = 3,
};

enum class ESpawnActorCollisionHandlingMethod : uint8
{
	Undefined                      = 0,
	AlwaysSpawn                    = 1,
	AdjustIfPossibleButAlwaysSpawn = 2,
	AdjustIfPossibleButDontSpawnIfColliding = 3,
	DontSpawnIfColliding           = 4,
	ESpawnActorCollisionHandlingMethod_MAX = 5,
};

enum class EMeshBufferAccess : uint8
{
	Default                        = 0,
	ForceCPUAndGPU                 = 1,
	EMeshBufferAccess_MAX          = 2,
};

enum class EFontImportCharacterSet : uint8
{
	FontICS_Default                = 0,
	FontICS_Ansi                   = 1,
	FontICS_Symbol                 = 2,
	FontICS_MAX                    = 3,
};

enum class EStandbyType : uint8
{
	STDBY_Rx                       = 0,
	STDBY_Tx                       = 1,
	STDBY_BadPing                  = 2,
	STDBY_MAX                      = 3,
};

enum class ESuggestProjVelocityTraceOption : uint8
{
	DoNotTrace                     = 0,
	TraceFullPath                  = 1,
	OnlyTraceWhileAscending        = 2,
	ESuggestProjVelocityTraceOption_MAX = 3,
};

enum class EHISMViewRelevanceType : uint8
{
	Grass                          = 0,
	Foliage                        = 1,
	HISM                           = 2,
	EHISMViewRelevanceType_MAX     = 3,
};

enum class EHitProxyPriority : uint8
{
	HPP_World                      = 0,
	HPP_Wireframe                  = 1,
	HPP_Foreground                 = 2,
	HPP_UI                         = 3,
	HPP_MAX                        = 4,
};

enum class EAdManagerDelegate : uint8
{
	AMD_ClickedBanner              = 0,
	AMD_UserClosedAd               = 1,
	AMD_MAX                        = 2,
};

enum class ETrackActiveCondition : uint8
{
	ETAC_Always                    = 0,
	ETAC_GoreEnabled               = 1,
	ETAC_GoreDisabled              = 2,
	ETAC_MAX                       = 3,
};

enum class ETrackInterpMode : uint8
{
	FTI_Set                        = 0,
	FTI_Add                        = 1,
	FTI_Multiply                   = 2,
	FTI_MAX                        = 3,
};

enum class EInterpTrackMoveRotMode : uint8
{
	IMR_Keyframed                  = 0,
	IMR_LookAtGroup                = 1,
	IMR_Ignore                     = 2,
	IMR_MAX                        = 3,
};

enum class EInterpMoveAxis : uint8
{
	AXIS_TranslationX              = 0,
	AXIS_TranslationY              = 1,
	AXIS_TranslationZ              = 2,
	AXIS_RotationX                 = 3,
	AXIS_RotationY                 = 4,
	AXIS_RotationZ                 = 5,
	AXIS_MAX                       = 6,
};

enum class ETrackToggleAction : uint8
{
	ETTA_Off                       = 0,
	ETTA_On                        = 1,
	ETTA_Toggle                    = 2,
	ETTA_Trigger                   = 3,
	ETTA_MAX                       = 4,
};

enum class EVisibilityTrackAction : uint8
{
	EVTA_Hide                      = 0,
	EVTA_Show                      = 1,
	EVTA_Toggle                    = 2,
	EVTA_MAX                       = 3,
};

enum class EVisibilityTrackCondition : uint8
{
	EVTC_Always                    = 0,
	EVTC_GoreEnabled               = 1,
	EVTC_GoreDisabled              = 2,
	EVTC_MAX                       = 3,
};

enum class ERoundingMode : uint8
{
	HalfToEven                     = 0,
	HalfFromZero                   = 1,
	HalfToZero                     = 2,
	FromZero                       = 3,
	ToZero                         = 4,
	ToNegativeInfinity             = 5,
	ToPositiveInfinity             = 6,
	ERoundingMode_MAX              = 7,
};

enum class EScreenPercentageMode : uint8
{
	Manual                         = 0,
	BasedOnDisplayResolution       = 1,
	BasedOnDPIScale                = 2,
	EScreenPercentageMode_MAX      = 3,
};

enum class ELevelInstanceRuntimeBehavior : uint8
{
	None                           = 0,
	Embedded_Deprecated            = 1,
	Partitioned                    = 2,
	LevelStreaming                 = 3,
	ELevelInstanceRuntimeBehavior_MAX = 4,
};

enum class ELevelInstanceCreationType : uint8
{
	LevelInstance                  = 0,
	PackedLevelActor               = 1,
	ELevelInstanceCreationType_MAX = 2,
};

enum class ELevelInstancePivotType : uint8
{
	CenterMinZ                     = 0,
	Center                         = 1,
	Actor                          = 2,
	WorldOrigin                    = 3,
	ELevelInstancePivotType_MAX    = 4,
};

enum class EStreamingVolumeUsage : uint8
{
	SVB_Loading                    = 0,
	SVB_LoadingAndVisibility       = 1,
	SVB_VisibilityBlockingOnLoad   = 2,
	SVB_BlockingOnLoad             = 3,
	SVB_LoadingNotVisible          = 4,
	SVB_MAX                        = 5,
};

enum class EMaterialDomain : uint8
{
	MD_Surface                     = 0,
	MD_DeferredDecal               = 1,
	MD_LightFunction               = 2,
	MD_Volume                      = 3,
	MD_PostProcess                 = 4,
	MD_UI                          = 5,
	MD_RuntimeVirtualTexture       = 6,
	MD_Compute                     = 7,
	MD_MAX                         = 8,
};

enum class ECustomDataInputType : uint8
{
	CIT_None                       = 0,
	CIT_Float1                     = 1,
	CIT_Float2                     = 2,
	CIT_Float3                     = 4,
	CIT_Float4                     = 8,
	CIT_MAX                        = 9,
};

enum class ETextureColorChannel : uint8
{
	TCC_Red                        = 0,
	TCC_Green                      = 1,
	TCC_Blue                       = 2,
	TCC_Alpha                      = 3,
	TCC_MAX                        = 4,
};

enum class EMaterialAttributeBlend : uint8
{
	Blend                          = 0,
	UseA                           = 1,
	UseB                           = 2,
	EMaterialAttributeBlend_MAX    = 3,
};

enum class EChannelMaskParameterColor : uint8
{
	Red                            = 0,
	Green                          = 1,
	Blue                           = 2,
	Alpha                          = 3,
	EChannelMaskParameterColor_MAX = 4,
};

enum class EClampMode : uint8
{
	CMODE_Clamp                    = 0,
	CMODE_ClampMin                 = 1,
	CMODE_ClampMax                 = 2,
	CMODE_MAX                      = 3,
};

enum class ECustomMaterialOutputType : uint8
{
	CMOT_Float1                    = 0,
	CMOT_Float2                    = 1,
	CMOT_Float3                    = 2,
	CMOT_Float4                    = 3,
	CMOT_MaterialAttributes        = 4,
	CMOT_MAX                       = 5,
};

enum class EDataDrivenShaderPlatformInfoCondition : uint8
{
	COND_True                      = 0,
	COND_False                     = 1,
	COND_Max                       = 2,
};

enum class EDBufferTextureId : uint8
{
	DBT_A                          = 0,
	DBT_B                          = 1,
	DBT_C                          = 2,
	DBT_MAX                        = 3,
};

enum class EDepthOfFieldFunctionValue : uint8
{
	TDOF_NearAndFarMask            = 0,
	TDOF_NearMask                  = 1,
	TDOF_FarMask                   = 2,
	TDOF_CircleOfConfusionRadius   = 3,
	TDOF_MAX                       = 4,
};

enum class EFunctionInputType : uint8
{
	FunctionInput_Scalar           = 0,
	FunctionInput_Vector2          = 1,
	FunctionInput_Vector3          = 2,
	FunctionInput_Vector4          = 3,
	FunctionInput_Texture2D        = 4,
	FunctionInput_TextureCube      = 5,
	FunctionInput_Texture2DArray   = 6,
	FunctionInput_VolumeTexture    = 7,
	FunctionInput_StaticBool       = 8,
	FunctionInput_MaterialAttributes = 9,
	FunctionInput_TextureExternal  = 10,
	FunctionInput_Bool             = 11,
	FunctionInput_Substrate        = 12,
	FunctionInput_MAX              = 13,
};

enum class ESplatBlendOp : uint8
{
	SBO_None                       = 0,
	SBO_Min                        = 1,
	SBO_Max                        = 2,
	SBO_Add                        = 3,
	SBO_Avg                        = 4,
};

enum class ENoiseFunction : uint8
{
	NOISEFUNCTION_SimplexTex       = 0,
	NOISEFUNCTION_GradientTex      = 1,
	NOISEFUNCTION_GradientTex3D    = 2,
	NOISEFUNCTION_GradientALU      = 3,
	NOISEFUNCTION_ValueALU         = 4,
	NOISEFUNCTION_VoronoiALU       = 5,
	NOISEFUNCTION_MAX              = 6,
};

enum class ECustomDataRowCountMethod : uint8
{
	RCM_Constant                   = 0,
	RCM_ScalarParam                = 1,
	RCM_TextureParamWidth          = 2,
	RCM_TextureParamHeight         = 3,
	RCM_TextureParamSize           = 4,
	RCM_MAX                        = 5,
};

enum class ERuntimeVirtualTextureMipValueMode : uint8
{
	RVTMVM_None                    = 0,
	RVTMVM_MipLevel                = 1,
	RVTMVM_MipBias                 = 2,
	RVTMVM_RecalculateDerivatives  = 3,
	RVTMVM_MAX                     = 4,
};

enum class ERuntimeVirtualTextureTextureAddressMode : uint8
{
	RVTTA_Clamp                    = 0,
	RVTTA_Wrap                     = 1,
	RVTTA_MAX                      = 2,
};

enum class EMaterialSceneAttributeInputMode : uint8
{
	Coordinates                    = 0,
	OffsetFraction                 = 1,
	EMaterialSceneAttributeInputMode_MAX = 2,
};

enum class ESpeedTreeGeometryType : uint8
{
	STG_Branch                     = 0,
	STG_Frond                      = 1,
	STG_Leaf                       = 2,
	STG_FacingLeaf                 = 3,
	STG_Billboard                  = 4,
	STG_MAX                        = 5,
};

enum class ESpeedTreeWindType : uint8
{
	STW_None                       = 0,
	STW_Fastest                    = 1,
	STW_Fast                       = 2,
	STW_Better                     = 3,
	STW_Best                       = 4,
	STW_Palm                       = 5,
	STW_BestPlus                   = 6,
	STW_MAX                        = 7,
};

enum class ESpeedTreeLODType : uint8
{
	STLOD_Pop                      = 0,
	STLOD_Smooth                   = 1,
	STLOD_MAX                      = 2,
};

enum class ESwitchMaterialOutputType : uint8
{
	TMMOT_Float1                   = 0,
	TMMOT_Float2                   = 1,
	TMMOT_Float3                   = 2,
	TMMOT_Float4                   = 3,
	TMMOT_MAX                      = 4,
};

enum class EMaterialExposedTextureProperty : uint8
{
	TMTM_TextureSize               = 0,
	TMTM_TexelSize                 = 1,
	TMTM_MAX                       = 2,
};

enum class EMaterialVectorCoordTransformSource : uint8
{
	TRANSFORMSOURCE_Tangent        = 0,
	TRANSFORMSOURCE_Local          = 1,
	TRANSFORMSOURCE_World          = 2,
	TRANSFORMSOURCE_View           = 3,
	TRANSFORMSOURCE_Camera         = 4,
	TRANSFORMSOURCE_ParticleWorld  = 5,
	TRANSFORMSOURCE_Instance       = 6,
	TRANSFORMSOURCE_RefPose        = 7,
	TRANSFORMSOURCE_MAX            = 8,
};

enum class EMaterialVectorCoordTransform : uint8
{
	TRANSFORM_Tangent              = 0,
	TRANSFORM_Local                = 1,
	TRANSFORM_World                = 2,
	TRANSFORM_View                 = 3,
	TRANSFORM_Camera               = 4,
	TRANSFORM_ParticleWorld        = 5,
	TRANSFORM_Instance             = 6,
	TRANSFORM_MAX                  = 7,
};

enum class EMaterialPositionTransformSource : uint8
{
	TRANSFORMPOSSOURCE_Local       = 0,
	TRANSFORMPOSSOURCE_World       = 1,
	TRANSFORMPOSSOURCE_TranslatedWorld = 2,
	TRANSFORMPOSSOURCE_View        = 3,
	TRANSFORMPOSSOURCE_Camera      = 4,
	TRANSFORMPOSSOURCE_Particle    = 5,
	TRANSFORMPOSSOURCE_Instance    = 6,
	TRANSFORMPOSSOURCE_MAX         = 7,
};

enum class EVectorNoiseFunction : uint8
{
	VNF_CellnoiseALU               = 0,
	VNF_VectorALU                  = 1,
	VNF_GradientALU                = 2,
	VNF_CurlALU                    = 3,
	VNF_VoronoiALU                 = 4,
	VNF_MAX                        = 5,
};

enum class EMaterialExposedViewProperty : uint8
{
	MEVP_BufferSize                = 0,
	MEVP_FieldOfView               = 1,
	MEVP_TanHalfFieldOfView        = 2,
	MEVP_ViewSize                  = 3,
	MEVP_WorldSpaceViewPosition    = 4,
	MEVP_WorldSpaceCameraPosition  = 5,
	MEVP_ViewportOffset            = 6,
	MEVP_TemporalSampleCount       = 7,
	MEVP_TemporalSampleIndex       = 8,
	MEVP_TemporalSampleOffset      = 9,
	MEVP_RuntimeVirtualTextureOutputLevel = 10,
	MEVP_RuntimeVirtualTextureOutputDerivative = 11,
	MEVP_PreExposure               = 12,
	MEVP_RuntimeVirtualTextureMaxLevel = 13,
	MEVP_ResolutionFraction        = 14,
	MEVP_MAX                       = 15,
};

enum class EWorldPositionIncludedOffsets : uint8
{
	WPT_Default                    = 0,
	WPT_ExcludeAllShaderOffsets    = 1,
	WPT_CameraRelative             = 2,
	WPT_CameraRelativeNoOffsets    = 3,
	WPT_MAX                        = 4,
};

enum class EMaterialFunctionUsage : uint8
{
	Default                        = 0,
	MaterialLayer                  = 1,
	MaterialLayerBlend             = 2,
	EMaterialFunctionUsage_MAX     = 3,
};

enum class EMaterialUsage : uint8
{
	MATUSAGE_SkeletalMesh          = 0,
	MATUSAGE_ParticleSprites       = 1,
	MATUSAGE_BeamTrails            = 2,
	MATUSAGE_MeshParticles         = 3,
	MATUSAGE_StaticLighting        = 4,
	MATUSAGE_MorphTargets          = 5,
	MATUSAGE_SplineMesh            = 6,
	MATUSAGE_InstancedStaticMeshes = 7,
	MATUSAGE_GeometryCollections   = 8,
	MATUSAGE_Clothing              = 9,
	MATUSAGE_NiagaraSprites        = 10,
	MATUSAGE_NiagaraRibbons        = 11,
	MATUSAGE_NiagaraMeshParticles  = 12,
	MATUSAGE_GeometryCache         = 13,
	MATUSAGE_Water                 = 14,
	MATUSAGE_HairStrands           = 15,
	MATUSAGE_LidarPointCloud       = 16,
	MATUSAGE_VirtualHeightfieldMesh = 17,
	MATUSAGE_Nanite                = 18,
	MATUSAGE_VolumetricCloud       = 19,
	MATUSAGE_MAX                   = 20,
};

enum class EMaterialLayerLinkState : uint8
{
	Uninitialized                  = 0,
	LinkedToParent                 = 1,
	UnlinkedFromParent             = 2,
	NotFromParent                  = 3,
	EMaterialLayerLinkState_MAX    = 4,
};

enum class ETextureSizingType : uint8
{
	TextureSizingType_UseSingleTextureSize = 0,
	TextureSizingType_UseAutomaticBiasedSizes = 1,
	TextureSizingType_UseManualOverrideTextureSize = 2,
	TextureSizingType_UseSimplygonAutomaticSizing = 3,
	TextureSizingType_AutomaticFromTexelDensity = 4,
	TextureSizingType_AutomaticFromMeshScreenSize = 5,
	TextureSizingType_AutomaticFromMeshDrawDistance = 6,
	TextureSizingType_MAX          = 7,
};

enum class EMaterialMergeType : uint8
{
	MaterialMergeType_Default      = 0,
	MaterialMergeType_Simplygon    = 1,
	MaterialMergeType_MAX          = 2,
};

enum class ESceneTextureId : uint8
{
	PPI_SceneColor                 = 0,
	PPI_SceneDepth                 = 1,
	PPI_DiffuseColor               = 2,
	PPI_SpecularColor              = 3,
	PPI_SubsurfaceColor            = 4,
	PPI_BaseColor                  = 5,
	PPI_Specular                   = 6,
	PPI_Metallic                   = 7,
	PPI_WorldNormal                = 8,
	PPI_SeparateTranslucency       = 9,
	PPI_Opacity                    = 10,
	PPI_Roughness                  = 11,
	PPI_MaterialAO                 = 12,
	PPI_CustomDepth                = 13,
	PPI_PostProcessInput0          = 14,
	PPI_PostProcessInput1          = 15,
	PPI_PostProcessInput2          = 16,
	PPI_PostProcessInput3          = 17,
	PPI_PostProcessInput4          = 18,
	PPI_PostProcessInput5          = 19,
	PPI_PostProcessInput6          = 20,
	PPI_DecalMask                  = 21,
	PPI_ShadingModelColor          = 22,
	PPI_ShadingModelID             = 23,
	PPI_AmbientOcclusion           = 24,
	PPI_CustomStencil              = 25,
	PPI_StoredBaseColor            = 26,
	PPI_StoredSpecular             = 27,
	PPI_Velocity                   = 28,
	PPI_WorldTangent               = 29,
	PPI_Anisotropy                 = 30,
	PPI_MAX                        = 31,
};

enum class EMaterialParameterAssociation : uint8
{
	LayerParameter                 = 0,
	BlendParameter                 = 1,
	GlobalParameter                = 2,
	EMaterialParameterAssociation_MAX = 3,
};

enum class EMicroTransactionDelegate : uint8
{
	MTD_PurchaseQueryComplete      = 0,
	MTD_PurchaseComplete           = 1,
	MTD_MAX                        = 2,
};

enum class EMicroTransactionResult : uint8
{
	MTR_Succeeded                  = 0,
	MTR_Failed                     = 1,
	MTR_Canceled                   = 2,
	MTR_RestoredFromServer         = 3,
	MTR_MAX                        = 4,
};

enum class ENavigationDataResolution : uint8
{
	Low                            = 0,
	Default                        = 1,
	High                           = 2,
	Invalid                        = 3,
	MAX                            = 3,
};

enum class ENavLinkDirection : uint8
{
	BothWays                       = 0,
	LeftToRight                    = 1,
	RightToLeft                    = 2,
	ENavLinkDirection_MAX          = 3,
};

enum class EPingType : uint8
{
	None                           = 0,
	RoundTrip                      = 1,
	RoundTripExclFrame             = 2,
	ICMP                           = 4,
	UDPQoS                         = 8,
	Max                            = 8,
	Count                          = 4,
};

enum class EPingAverageType : uint8
{
	None                           = 0,
	MovingAverage                  = 1,
	PlayerStateAvg                 = 2,
	EPingAverageType_MAX           = 3,
};

enum class EParticleBurstMethod : uint8
{
	EPBM_Instant                   = 0,
	EPBM_Interpolated              = 1,
	EPBM_MAX                       = 2,
};

enum class EParticleSubUVInterpMethod : uint8
{
	PSUVIM_None                    = 0,
	PSUVIM_Linear                  = 1,
	PSUVIM_Linear_Blend            = 2,
	PSUVIM_Random                  = 3,
	PSUVIM_Random_Blend            = 4,
	PSUVIM_MAX                     = 5,
};

enum class EEmitterRenderMode : uint8
{
	ERM_Normal                     = 0,
	ERM_Point                      = 1,
	ERM_Cross                      = 2,
	ERM_LightsOnly                 = 3,
	ERM_None                       = 4,
	ERM_MAX                        = 5,
};

enum class EParticleDetailMode : uint8
{
	PDM_Low                        = 0,
	PDM_Medium                     = 1,
	PDM_High                       = 2,
	PDM_MAX                        = 3,
};

enum class EParticleSignificanceLevel : uint8
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Critical                       = 3,
	Num                            = 4,
	EParticleSignificanceLevel_MAX = 5,
};

enum class EParticleSystemInsignificanceReaction : uint8
{
	Auto                           = 0,
	Complete                       = 1,
	DisableTick                    = 2,
	DisableTickAndKill             = 3,
	Num                            = 4,
	EParticleSystemInsignificanceReaction_MAX = 5,
};

enum class EModuleType : uint8
{
	EPMT_General                   = 0,
	EPMT_TypeData                  = 1,
	EPMT_Beam                      = 2,
	EPMT_Trail                     = 3,
	EPMT_Spawn                     = 4,
	EPMT_Required                  = 5,
	EPMT_Event                     = 6,
	EPMT_Light                     = 7,
	EPMT_SubUV                     = 8,
	EPMT_MAX                       = 9,
};

enum class EParticleSourceSelectionMethod : uint8
{
	EPSSM_Random                   = 0,
	EPSSM_Sequential               = 1,
	EPSSM_MAX                      = 2,
};

enum class EAttractorParticleSelectionMethod : uint8
{
	EAPSM_Random                   = 0,
	EAPSM_Sequential               = 1,
	EAPSM_MAX                      = 2,
};

enum class EBeam2SourceTargetMethod : uint8
{
	PEB2STM_Default                = 0,
	PEB2STM_UserSet                = 1,
	PEB2STM_Emitter                = 2,
	PEB2STM_Particle               = 3,
	PEB2STM_Actor                  = 4,
	PEB2STM_MAX                    = 5,
};

enum class EBeam2SourceTargetTangentMethod : uint8
{
	PEB2STTM_Direct                = 0,
	PEB2STTM_UserSet               = 1,
	PEB2STTM_Distribution          = 2,
	PEB2STTM_Emitter               = 3,
	PEB2STTM_MAX                   = 4,
};

enum class EBeamModifierType : uint8
{
	PEB2MT_Source                  = 0,
	PEB2MT_Target                  = 1,
	PEB2MT_MAX                     = 2,
};

enum class EParticleCameraOffsetUpdateMethod : uint8
{
	EPCOUM_DirectSet               = 0,
	EPCOUM_Additive                = 1,
	EPCOUM_Scalar                  = 2,
	EPCOUM_MAX                     = 3,
};

enum class EParticleCollisionComplete : uint8
{
	EPCC_Kill                      = 0,
	EPCC_Freeze                    = 1,
	EPCC_HaltCollisions            = 2,
	EPCC_FreezeTranslation         = 3,
	EPCC_FreezeRotation            = 4,
	EPCC_FreezeMovement            = 5,
	EPCC_MAX                       = 6,
};

enum class EParticleCollisionResponse : uint8
{
	Bounce                         = 0,
	Stop                           = 1,
	Kill                           = 2,
	EParticleCollisionResponse_MAX = 3,
};

enum class ELocationBoneSocketSource : uint8
{
	BONESOCKETSOURCE_Bones         = 0,
	BONESOCKETSOURCE_Sockets       = 1,
	BONESOCKETSOURCE_MAX           = 2,
};

enum class ELocationBoneSocketSelectionMethod : uint8
{
	BONESOCKETSEL_Sequential       = 0,
	BONESOCKETSEL_Random           = 1,
	BONESOCKETSEL_MAX              = 2,
};

enum class ELocationEmitterSelectionMethod : uint8
{
	ELESM_Random                   = 0,
	ELESM_Sequential               = 1,
	ELESM_MAX                      = 2,
};

enum class ECylinderHeightAxis : uint8
{
	PMLPC_HEIGHTAXIS_X             = 0,
	PMLPC_HEIGHTAXIS_Y             = 1,
	PMLPC_HEIGHTAXIS_Z             = 2,
	PMLPC_HEIGHTAXIS_MAX           = 3,
};

enum class ELocationSkelVertSurfaceSource : uint8
{
	VERTSURFACESOURCE_Vert         = 0,
	VERTSURFACESOURCE_Surface      = 1,
	VERTSURFACESOURCE_MAX          = 2,
};

enum class EOrbitChainMode : uint8
{
	EOChainMode_Add                = 0,
	EOChainMode_Scale              = 1,
	EOChainMode_Link               = 2,
	EOChainMode_MAX                = 3,
};

enum class EParticleAxisLock : uint8
{
	EPAL_NONE                      = 0,
	EPAL_X                         = 1,
	EPAL_Y                         = 2,
	EPAL_Z                         = 3,
	EPAL_NEGATIVE_X                = 4,
	EPAL_NEGATIVE_Y                = 5,
	EPAL_NEGATIVE_Z                = 6,
	EPAL_ROTATE_X                  = 7,
	EPAL_ROTATE_Y                  = 8,
	EPAL_ROTATE_Z                  = 9,
	EPAL_MAX                       = 10,
};

enum class EEmitterDynamicParameterValue : uint8
{
	EDPV_UserSet                   = 0,
	EDPV_AutoSet                   = 1,
	EDPV_VelocityX                 = 2,
	EDPV_VelocityY                 = 3,
	EDPV_VelocityZ                 = 4,
	EDPV_VelocityMag               = 5,
	EDPV_MAX                       = 6,
};

enum class EParticleUVFlipMode : uint8
{
	None                           = 0,
	FlipUV                         = 1,
	FlipUOnly                      = 2,
	FlipVOnly                      = 3,
	RandomFlipUV                   = 4,
	RandomFlipUOnly                = 5,
	RandomFlipVOnly                = 6,
	RandomFlipUVIndependent        = 7,
	EParticleUVFlipMode_MAX        = 8,
};

enum class EParticleSortMode : uint8
{
	PSORTMODE_None                 = 0,
	PSORTMODE_ViewProjDepth        = 1,
	PSORTMODE_DistanceToView       = 2,
	PSORTMODE_Age_OldestFirst      = 3,
	PSORTMODE_Age_NewestFirst      = 4,
	PSORTMODE_MAX                  = 5,
};

enum class EEmitterNormalsMode : uint8
{
	ENM_CameraFacing               = 0,
	ENM_Spherical                  = 1,
	ENM_Cylindrical                = 2,
	ENM_MAX                        = 3,
};

enum class ETrail2SourceMethod : uint8
{
	PET2SRCM_Default               = 0,
	PET2SRCM_Particle              = 1,
	PET2SRCM_Actor                 = 2,
	PET2SRCM_MAX                   = 3,
};

enum class EBeam2Method : uint8
{
	PEB2M_Distance                 = 0,
	PEB2M_Target                   = 1,
	PEB2M_Branch                   = 2,
	PEB2M_MAX                      = 3,
};

enum class EBeamTaperMethod : uint8
{
	PEBTM_None                     = 0,
	PEBTM_Full                     = 1,
	PEBTM_Partial                  = 2,
	PEBTM_MAX                      = 3,
};

enum class EMeshScreenAlignment : uint8
{
	PSMA_MeshFaceCameraWithRoll    = 0,
	PSMA_MeshFaceCameraWithSpin    = 1,
	PSMA_MeshFaceCameraWithLockedAxis = 2,
	PSMA_MAX                       = 3,
};

enum class EMeshCameraFacingUpAxis : uint8
{
	CameraFacing_NoneUP            = 0,
	CameraFacing_ZUp               = 1,
	CameraFacing_NegativeZUp       = 2,
	CameraFacing_YUp               = 3,
	CameraFacing_NegativeYUp       = 4,
	CameraFacing_MAX               = 5,
};

enum class EMeshCameraFacingOptions : uint8
{
	XAxisFacing_NoUp               = 0,
	XAxisFacing_ZUp                = 1,
	XAxisFacing_NegativeZUp        = 2,
	XAxisFacing_YUp                = 3,
	XAxisFacing_NegativeYUp        = 4,
	LockedAxis_ZAxisFacing         = 5,
	LockedAxis_NegativeZAxisFacing = 6,
	LockedAxis_YAxisFacing         = 7,
	LockedAxis_NegativeYAxisFacing = 8,
	VelocityAligned_ZAxisFacing    = 9,
	VelocityAligned_NegativeZAxisFacing = 10,
	VelocityAligned_YAxisFacing    = 11,
	VelocityAligned_NegativeYAxisFacing = 12,
	EMeshCameraFacingOptions_MAX   = 13,
};

enum class ETrailsRenderAxisOption : uint8
{
	Trails_CameraUp                = 0,
	Trails_SourceUp                = 1,
	Trails_WorldUp                 = 2,
	Trails_MAX                     = 3,
};

enum class EParticleScreenAlignment : uint8
{
	PSA_FacingCameraPosition       = 0,
	PSA_Square                     = 1,
	PSA_Rectangle                  = 2,
	PSA_Velocity                   = 3,
	PSA_AwayFromCenter             = 4,
	PSA_TypeSpecific               = 5,
	PSA_FacingCameraDistanceBlend  = 6,
	PSA_MAX                        = 7,
};

enum class EParticleSystemUpdateMode : uint8
{
	EPSUM_RealTime                 = 0,
	EPSUM_FixedTime                = 1,
	EPSUM_MAX                      = 2,
};

enum class EParticleSystemLODMethod : uint8
{
	PARTICLESYSTEMLODMETHOD_Automatic = 0,
	PARTICLESYSTEMLODMETHOD_DirectSet = 1,
	PARTICLESYSTEMLODMETHOD_ActivateAutomatic = 2,
	PARTICLESYSTEMLODMETHOD_MAX    = 3,
};

enum class EParticleSystemOcclusionBoundsMethod : uint8
{
	EPSOBM_None                    = 0,
	EPSOBM_ParticleBounds          = 1,
	EPSOBM_CustomBounds            = 2,
	EPSOBM_MAX                     = 3,
};

enum class EParticleSysParamType : uint8
{
	PSPT_None                      = 0,
	PSPT_Scalar                    = 1,
	PSPT_ScalarRand                = 2,
	PSPT_Vector                    = 3,
	PSPT_VectorRand                = 4,
	PSPT_Color                     = 5,
	PSPT_Actor                     = 6,
	PSPT_Material                  = 7,
	PSPT_VectorUnitRand            = 8,
	PSPT_MAX                       = 9,
};

enum class EParticleReplayState : uint8
{
	PRS_Disabled                   = 0,
	PRS_Capturing                  = 1,
	PRS_Replaying                  = 2,
	PRS_MAX                        = 3,
};

enum class EParticleEventType : uint8
{
	EPET_Any                       = 0,
	EPET_Spawn                     = 1,
	EPET_Death                     = 2,
	EPET_Collision                 = 3,
	EPET_Burst                     = 4,
	EPET_Blueprint                 = 5,
	EPET_MAX                       = 6,
};

enum class EViewTargetBlendFunction : uint8
{
	VTBlend_Linear                 = 0,
	VTBlend_Cubic                  = 1,
	VTBlend_EaseIn                 = 2,
	VTBlend_EaseOut                = 3,
	VTBlend_EaseInOut              = 4,
	VTBlend_PreBlended             = 5,
	VTBlend_MAX                    = 6,
};

enum class EBPMapCheckSeverity : uint8
{
	Info                           = 0,
	Warning                        = 1,
	PerformanceWarning             = 2,
	Error                          = 3,
	EBPMapCheckSeverity_MAX        = 4,
};

enum class EReplicationGraphBehavior : uint8
{
	Default                        = 0,
	NotRouted                      = 1,
	RelevantAllConnections         = 2,
	RelevantOwnerConnection        = 3,
	RelevantTeamConnection         = 4,
	NetChild_Dynamic               = 64,
	NetChild_Static                = 65,
	NetChild_ForceStaticDormancy   = 66,
	Spatialize_Static              = 128,
	Spatialize_Dynamic             = 129,
	Spatialize_Dormancy            = 130,
	Spatialize_ForceStaticDormancy = 131,
	EReplicationGraphBehavior_MAX  = 132,
};

enum class ERichCurveInterpMode : uint8
{
	RCIM_Linear                    = 0,
	RCIM_Constant                  = 1,
	RCIM_Cubic                     = 2,
	RCIM_None                      = 3,
	RCIM_MAX                       = 4,
};

enum class ERichCurveExtrapolation : uint8
{
	RCCE_Cycle                     = 0,
	RCCE_CycleWithOffset           = 1,
	RCCE_Oscillate                 = 2,
	RCCE_Linear                    = 3,
	RCCE_Constant                  = 4,
	RCCE_None                      = 5,
	RCCE_MAX                       = 6,
};

enum class EReverbPreset : uint8
{
	REVERB_Default                 = 0,
	REVERB_Bathroom                = 1,
	REVERB_StoneRoom               = 2,
	REVERB_Auditorium              = 3,
	REVERB_ConcertHall             = 4,
	REVERB_Cave                    = 5,
	REVERB_Hallway                 = 6,
	REVERB_StoneCorridor           = 7,
	REVERB_Alley                   = 8,
	REVERB_Forest                  = 9,
	REVERB_City                    = 10,
	REVERB_Mountains               = 11,
	REVERB_Quarry                  = 12,
	REVERB_Plain                   = 13,
	REVERB_ParkingLot              = 14,
	REVERB_SewerPipe               = 15,
	REVERB_Underwater              = 16,
	REVERB_SmallRoom               = 17,
	REVERB_MediumRoom              = 18,
	REVERB_LargeRoom               = 19,
	REVERB_MediumHall              = 20,
	REVERB_LargeHall               = 21,
	REVERB_Plate                   = 22,
	REVERB_MAX                     = 23,
};

enum class ERichCurveTangentMode : uint8
{
	RCTM_Auto                      = 0,
	RCTM_User                      = 1,
	RCTM_Break                     = 2,
	RCTM_None                      = 3,
	RCTM_MAX                       = 4,
};

enum class ERichCurveTangentWeightMode : uint8
{
	RCTWM_WeightedNone             = 0,
	RCTWM_WeightedArrive           = 1,
	RCTWM_WeightedLeave            = 2,
	RCTWM_WeightedBoth             = 3,
	RCTWM_MAX                      = 4,
};

enum class ERichCurveCompressionFormat : uint8
{
	RCCF_Empty                     = 0,
	RCCF_Constant                  = 1,
	RCCF_Linear                    = 2,
	RCCF_Cubic                     = 3,
	RCCF_Mixed                     = 4,
	RCCF_Weighted                  = 5,
	RCCF_MAX                       = 6,
};

enum class ERichCurveKeyTimeCompressionFormat : uint8
{
	RCKTCF_uint16                  = 0,
	RCKTCF_float32                 = 1,
	RCKTCF_MAX                     = 2,
};

enum class ERuntimeVirtualTextureMaterialType : uint8
{
	BaseColor                      = 0,
	BaseColor_Normal_DEPRECATED    = 1,
	BaseColor_Normal_Roughness     = 2,
	BaseColor_Normal_Specular      = 3,
	BaseColor_Normal_Specular_YCoCg = 4,
	BaseColor_Normal_Specular_Mask_YCoCg = 5,
	Switch_Optimized               = 6,
	WorldHeight                    = 7,
	Count                          = 8,
	ERuntimeVirtualTextureMaterialType_MAX = 9,
};

enum class EDepthOfFieldMethod : uint8
{
	DOFM_BokehDOF                  = 0,
	DOFM_Gaussian                  = 1,
	DOFM_CircleDOF                 = 2,
	DOFM_MAX                       = 3,
};

enum class EAutoExposureMethod : uint8
{
	AEM_Histogram                  = 0,
	AEM_Basic                      = 1,
	AEM_Manual                     = 2,
	AEM_MAX                        = 3,
};

enum class EBloomMethod : uint8
{
	BM_SOG                         = 0,
	BM_FFT                         = 1,
	BM_MAX                         = 2,
};

enum class ETemperatureMethod : uint8
{
	TEMP_WhiteBalance              = 0,
	TEMP_ColorTemperature          = 1,
	TEMP_MAX                       = 2,
};

enum class ELightUnits : uint8
{
	Unitless                       = 0,
	Candelas                       = 1,
	Lumens                         = 2,
	ELightUnits_MAX                = 3,
};

enum class EReflectionsType : uint8
{
	ScreenSpace                    = 0,
	RayTracing                     = 1,
	EReflectionsType_MAX           = 2,
};

enum class ELumenRayLightingModeOverride : uint8
{
	Default                        = 0,
	SurfaceCache                   = 1,
	HitLighting                    = 2,
	ELumenRayLightingModeOverride_MAX = 3,
};

enum class ETranslucencyType : uint8
{
	Raster                         = 0,
	RayTracing                     = 1,
	ETranslucencyType_MAX          = 2,
};

enum class ERayTracingGlobalIlluminationType : uint8
{
	Disabled                       = 0,
	BruteForce                     = 1,
	FinalGather                    = 2,
	ERayTracingGlobalIlluminationType_MAX = 3,
};

enum class EReflectedAndRefractedRayTracedShadows : uint8
{
	Disabled                       = 0,
	Hard_shadows                   = 1,
	Area_shadows                   = 2,
	EReflectedAndRefractedRayTracedShadows_MAX = 3,
};

enum class EMobilePlanarReflectionMode : uint8
{
	Usual                          = 0,
	MobilePPRExclusive             = 1,
	MobilePPR                      = 2,
	EMobilePlanarReflectionMode_MAX = 3,
};

enum class EMobilePixelProjectedReflectionQuality : uint8
{
	Disabled                       = 0,
	BestPerformance                = 1,
	BetterQuality                  = 2,
	BestQuality                    = 3,
	EMobilePixelProjectedReflectionQuality_MAX = 4,
};

enum class EMaterialProperty : uint8
{
	MP_EmissiveColor               = 0,
	MP_Opacity                     = 1,
	MP_OpacityMask                 = 2,
	MP_DiffuseColor                = 3,
	MP_SpecularColor               = 4,
	MP_BaseColor                   = 5,
	MP_Metallic                    = 6,
	MP_Specular                    = 7,
	MP_Roughness                   = 8,
	MP_Anisotropy                  = 9,
	MP_Normal                      = 10,
	MP_Tangent                     = 11,
	MP_WorldPositionOffset         = 12,
	MP_WorldDisplacement_DEPRECATED = 13,
	MP_TessellationMultiplier_DEPRECATED = 14,
	MP_SubsurfaceColor             = 15,
	MP_CustomData0                 = 16,
	MP_CustomData1                 = 17,
	MP_AmbientOcclusion            = 18,
	MP_Refraction                  = 19,
	MP_SSAOIntensity               = 20,
	MP_SSAOInfluence               = 21,
	MP_SSAOLightInfluence          = 22,
	MP_CustomizedUVs0              = 23,
	MP_CustomizedUVs1              = 24,
	MP_CustomizedUVs2              = 25,
	MP_CustomizedUVs3              = 26,
	MP_CustomizedUVs4              = 27,
	MP_CustomizedUVs5              = 28,
	MP_CustomizedUVs6              = 29,
	MP_CustomizedUVs7              = 30,
	MP_PixelDepthOffset            = 31,
	MP_ShadingModel                = 32,
	MP_FrontMaterial               = 33,
	MP_SurfaceThickness            = 34,
	MP_MaterialAttributes          = 35,
	MP_CustomOutput                = 36,
	MP_MAX                         = 37,
};

enum class EAntiAliasingMethod : uint8
{
	AAM_None                       = 0,
	AAM_FXAA                       = 1,
	AAM_TemporalAA                 = 2,
	AAM_MSAA                       = 3,
	AAM_TSR                        = 4,
	AAM_MAX                        = 5,
};

enum class ESkeletalMeshGeoImportVersions : uint8
{
	Before_Versionning             = 0,
	SkeletalMeshBuildRefactor      = 1,
	VersionPlusOne                 = 2,
	LatestVersion                  = 1,
	ESkeletalMeshGeoImportVersions_MAX = 3,
};

enum class ESkeletalMeshSkinningImportVersions : uint8
{
	Before_Versionning             = 0,
	SkeletalMeshBuildRefactor      = 1,
	VersionPlusOne                 = 2,
	LatestVersion                  = 1,
	ESkeletalMeshSkinningImportVersions_MAX = 3,
};

enum class ESkeletalMeshTerminationCriterion : uint8
{
	SMTC_NumOfTriangles            = 0,
	SMTC_NumOfVerts                = 1,
	SMTC_TriangleOrVert            = 2,
	SMTC_AbsNumOfTriangles         = 3,
	SMTC_AbsNumOfVerts             = 4,
	SMTC_AbsTriangleOrVert         = 5,
	SMTC_MAX                       = 6,
};

enum class ESkeletalMeshOptimizationType : uint8
{
	SMOT_NumOfTriangles            = 0,
	SMOT_MaxDeviation              = 1,
	SMOT_TriangleOrDeviation       = 2,
	SMOT_MAX                       = 3,
};

enum class ESkeletalMeshOptimizationImportance : uint8
{
	SMOI_Off                       = 0,
	SMOI_Lowest                    = 1,
	SMOI_Low                       = 2,
	SMOI_Normal                    = 3,
	SMOI_High                      = 4,
	SMOI_Highest                   = 5,
	SMOI_MAX                       = 6,
};

enum class EBoneVisibilityStatus : uint8
{
	BVS_HiddenByParent             = 0,
	BVS_Visible                    = 1,
	BVS_ExplicitlyHidden           = 2,
	BVS_MAX                        = 3,
};

enum class EPhysBodyOp : uint8
{
	PBO_None                       = 0,
	PBO_Term                       = 1,
	PBO_MAX                        = 2,
};

enum class EVisibilityBasedAnimTickOption : uint8
{
	LocalControlTickPoseAndRefreshBones = 0,
	AlwaysTickPoseAndRefreshBones  = 1,
	AlwaysTickPose                 = 2,
	OnlyTickMontagesWhenNotRendered = 3,
	OnlyTickPoseWhenRendered       = 4,
	EVisibilityBasedAnimTickOption_MAX = 5,
};

enum class EBoneSpaces : uint8
{
	WorldSpace                     = 0,
	ComponentSpace                 = 1,
	EBoneSpaces_MAX                = 2,
};

enum class ESkyLightSourceType : uint8
{
	SLS_CapturedScene              = 0,
	SLS_SpecifiedCubemap           = 1,
	SLS_MAX                        = 2,
};

enum class ESoundDistanceCalc : uint8
{
	SOUNDDISTANCE_Normal           = 0,
	SOUNDDISTANCE_InfiniteXYPlane  = 1,
	SOUNDDISTANCE_InfiniteXZPlane  = 2,
	SOUNDDISTANCE_InfiniteYZPlane  = 3,
	SOUNDDISTANCE_MAX              = 4,
};

enum class ESoundSpatializationAlgorithm : uint8
{
	SPATIALIZATION_Default         = 0,
	SPATIALIZATION_HRTF            = 1,
	SPATIALIZATION_MAX             = 2,
};

enum class EAirAbsorptionMethod : uint8
{
	Linear                         = 0,
	CustomCurve                    = 1,
	EAirAbsorptionMethod_MAX       = 2,
};

enum class EReverbSendMethod : uint8
{
	Linear                         = 0,
	CustomCurve                    = 1,
	Manual                         = 2,
	EReverbSendMethod_MAX          = 3,
};

enum class ESubmixSendMethod : uint8
{
	Linear                         = 0,
	CustomCurve                    = 1,
	Manual                         = 2,
	ESubmixSendMethod_MAX          = 3,
};

enum class EPriorityAttenuationMethod : uint8
{
	Linear                         = 0,
	CustomCurve                    = 1,
	Manual                         = 2,
	EPriorityAttenuationMethod_MAX = 3,
};

enum class ESoundGroup : uint8
{
	SOUNDGROUP_Default             = 0,
	SOUNDGROUP_Effects             = 1,
	SOUNDGROUP_UI                  = 2,
	SOUNDGROUP_Music               = 3,
	SOUNDGROUP_Voice               = 4,
	SOUNDGROUP_GameSoundGroup1     = 5,
	SOUNDGROUP_GameSoundGroup2     = 6,
	SOUNDGROUP_GameSoundGroup3     = 7,
	SOUNDGROUP_GameSoundGroup4     = 8,
	SOUNDGROUP_GameSoundGroup5     = 9,
	SOUNDGROUP_GameSoundGroup6     = 10,
	SOUNDGROUP_GameSoundGroup7     = 11,
	SOUNDGROUP_GameSoundGroup8     = 12,
	SOUNDGROUP_GameSoundGroup9     = 13,
	SOUNDGROUP_GameSoundGroup10    = 14,
	SOUNDGROUP_GameSoundGroup11    = 15,
	SOUNDGROUP_GameSoundGroup12    = 16,
	SOUNDGROUP_GameSoundGroup13    = 17,
	SOUNDGROUP_GameSoundGroup14    = 18,
	SOUNDGROUP_GameSoundGroup15    = 19,
	SOUNDGROUP_GameSoundGroup16    = 20,
	SOUNDGROUP_GameSoundGroup17    = 21,
	SOUNDGROUP_GameSoundGroup18    = 22,
	SOUNDGROUP_GameSoundGroup19    = 23,
	SOUNDGROUP_GameSoundGroup20    = 24,
	SOUNDGROUP_MAX                 = 25,
};

enum class EModulationParamMode : uint8
{
	MPM_Normal                     = 0,
	MPM_Abs                        = 1,
	MPM_Direct                     = 2,
	MPM_MAX                        = 3,
};

enum class ESourceBusSendLevelControlMethod : uint8
{
	Linear                         = 0,
	CustomCurve                    = 1,
	Manual                         = 2,
	ESourceBusSendLevelControlMethod_MAX = 3,
};

enum class EDecompressionType : uint8
{
	DTYPE_Setup                    = 0,
	DTYPE_Invalid                  = 1,
	DTYPE_Preview                  = 2,
	DTYPE_Native                   = 3,
	DTYPE_RealTime                 = 4,
	DTYPE_Procedural               = 5,
	DTYPE_Xenon                    = 6,
	DTYPE_Streaming                = 7,
	DTYPE_MAX                      = 8,
};

enum class ESoundWaveFFTSize : uint8
{
	VerySmall_64                   = 0,
	Small_256                      = 1,
	Medium_512                     = 2,
	Large_1024                     = 3,
	VeryLarge_2048                 = 4,
	ESoundWaveFFTSize_MAX          = 5,
};

enum class ESoundAssetCompressionType : uint8
{
	BinkAudio                      = 0,
	ADPCM                          = 1,
	PCM                            = 2,
	PlatformSpecific               = 3,
	ProjectDefined                 = 4,
	ESoundAssetCompressionType_MAX = 5,
};

enum class ESoundWaveLoadingBehavior : uint8
{
	Inherited                      = 0,
	RetainOnLoad                   = 1,
	PrimeOnLoad                    = 2,
	LoadOnDemand                   = 3,
	ForceInline                    = 4,
	Uninitialized                  = 255,
	ESoundWaveLoadingBehavior_MAX  = 256,
};

enum class EStereoLayerType : uint8
{
	SLT_WorldLocked                = 0,
	SLT_TrackerLocked              = 1,
	SLT_FaceLocked                 = 2,
	SLT_MAX                        = 3,
};

enum class EStereoLayerShape : uint8
{
	SLSH_QuadLayer                 = 0,
	SLSH_CylinderLayer             = 1,
	SLSH_CubemapLayer              = 2,
	SLSH_EquirectLayer             = 3,
	SLSH_MAX                       = 4,
};

enum class ESubUVBoundingVertexCount : uint8
{
	BVC_FourVertices               = 0,
	BVC_EightVertices              = 1,
	BVC_MAX                        = 2,
};

enum class EOpacitySourceMode : uint8
{
	OSM_Alpha                      = 0,
	OSM_ColorBrightness            = 1,
	OSM_RedChannel                 = 2,
	OSM_GreenChannel               = 3,
	OSM_BlueChannel                = 4,
	OSM_MAX                        = 5,
};

enum class EHorizTextAligment : uint8
{
	EHTA_Left                      = 0,
	EHTA_Center                    = 1,
	EHTA_Right                     = 2,
	EHTA_MAX                       = 3,
};

enum class EVerticalTextAligment : uint8
{
	EVRTA_TextTop                  = 0,
	EVRTA_TextCenter               = 1,
	EVRTA_TextBottom               = 2,
	EVRTA_QuadTop                  = 3,
	EVRTA_MAX                      = 4,
};

enum class ETextureGroup : uint8
{
	TEXTUREGROUP_World             = 0,
	TEXTUREGROUP_WorldNormalMap    = 1,
	TEXTUREGROUP_WorldSpecular     = 2,
	TEXTUREGROUP_Character         = 3,
	TEXTUREGROUP_CharacterNormalMap = 4,
	TEXTUREGROUP_CharacterSpecular = 5,
	TEXTUREGROUP_Weapon            = 6,
	TEXTUREGROUP_WeaponNormalMap   = 7,
	TEXTUREGROUP_WeaponSpecular    = 8,
	TEXTUREGROUP_Vehicle           = 9,
	TEXTUREGROUP_VehicleNormalMap  = 10,
	TEXTUREGROUP_VehicleSpecular   = 11,
	TEXTUREGROUP_Cinematic         = 12,
	TEXTUREGROUP_Effects           = 13,
	TEXTUREGROUP_EffectsNotFiltered = 14,
	TEXTUREGROUP_Skybox            = 15,
	TEXTUREGROUP_UI                = 16,
	TEXTUREGROUP_Lightmap          = 17,
	TEXTUREGROUP_RenderTarget      = 18,
	TEXTUREGROUP_MobileFlattened   = 19,
	TEXTUREGROUP_ProcBuilding_Face = 20,
	TEXTUREGROUP_ProcBuilding_LightMap = 21,
	TEXTUREGROUP_Shadowmap         = 22,
	TEXTUREGROUP_ColorLookupTable  = 23,
	TEXTUREGROUP_Terrain_Heightmap = 24,
	TEXTUREGROUP_Terrain_Weightmap = 25,
	TEXTUREGROUP_Bokeh             = 26,
	TEXTUREGROUP_IESLightProfile   = 27,
	TEXTUREGROUP_Pixels2D          = 28,
	TEXTUREGROUP_HierarchicalLOD   = 29,
	TEXTUREGROUP_Impostor          = 30,
	TEXTUREGROUP_ImpostorNormalDepth = 31,
	TEXTUREGROUP_8BitData          = 32,
	TEXTUREGROUP_16BitData         = 33,
	TEXTUREGROUP_Project01         = 34,
	TEXTUREGROUP_Project02         = 35,
	TEXTUREGROUP_Project03         = 36,
	TEXTUREGROUP_Project04         = 37,
	TEXTUREGROUP_Project05         = 38,
	TEXTUREGROUP_Project06         = 39,
	TEXTUREGROUP_Project07         = 40,
	TEXTUREGROUP_Project08         = 41,
	TEXTUREGROUP_Project09         = 42,
	TEXTUREGROUP_Project10         = 43,
	TEXTUREGROUP_Project11         = 44,
	TEXTUREGROUP_Project12         = 45,
	TEXTUREGROUP_Project13         = 46,
	TEXTUREGROUP_Project14         = 47,
	TEXTUREGROUP_Project15         = 48,
	TEXTUREGROUP_Project16         = 49,
	TEXTUREGROUP_Project17         = 50,
	TEXTUREGROUP_Project18         = 51,
	TEXTUREGROUP_MAX               = 52,
};

enum class ETextureMipGenSettings : uint8
{
	TMGS_FromTextureGroup          = 0,
	TMGS_SimpleAverage             = 1,
	TMGS_Sharpen0                  = 2,
	TMGS_Sharpen1                  = 3,
	TMGS_Sharpen2                  = 4,
	TMGS_Sharpen3                  = 5,
	TMGS_Sharpen4                  = 6,
	TMGS_Sharpen5                  = 7,
	TMGS_Sharpen6                  = 8,
	TMGS_Sharpen7                  = 9,
	TMGS_Sharpen8                  = 10,
	TMGS_Sharpen9                  = 11,
	TMGS_Sharpen10                 = 12,
	TMGS_NoMipmaps                 = 13,
	TMGS_LeaveExistingMips         = 14,
	TMGS_Blur1                     = 15,
	TMGS_Blur2                     = 16,
	TMGS_Blur3                     = 17,
	TMGS_Blur4                     = 18,
	TMGS_Blur5                     = 19,
	TMGS_Unfiltered                = 20,
	TMGS_Angular                   = 21,
	TMGS_MAX                       = 22,
};

enum class ETexturePowerOfTwoSetting : uint8
{
	None                           = 0,
	PadToPowerOfTwo                = 1,
	PadToSquarePowerOfTwo          = 2,
	ETexturePowerOfTwoSetting_MAX  = 3,
};

enum class ETextureSamplerFilter : uint8
{
	Point                          = 0,
	Bilinear                       = 1,
	Trilinear                      = 2,
	AnisotropicPoint               = 3,
	AnisotropicLinear              = 4,
	ETextureSamplerFilter_MAX      = 5,
};

enum class ETextureMipLoadOptions : uint8
{
	Default                        = 0,
	AllMips                        = 1,
	OnlyFirstMip                   = 2,
	ETextureMipLoadOptions_MAX     = 3,
};

enum class ETextureDownscaleOptions : uint8
{
	Default                        = 0,
	Unfiltered                     = 1,
	SimpleAverage                  = 2,
	Sharpen0                       = 3,
	Sharpen1                       = 4,
	Sharpen2                       = 5,
	Sharpen3                       = 6,
	Sharpen4                       = 7,
	Sharpen5                       = 8,
	Sharpen6                       = 9,
	Sharpen7                       = 10,
	Sharpen8                       = 11,
	Sharpen9                       = 12,
	Sharpen10                      = 13,
	ETextureDownscaleOptions_MAX   = 14,
};

enum class ETextureLossyCompressionAmount : uint8
{
	TLCA_Default                   = 0,
	TLCA_None                      = 1,
	TLCA_Lowest                    = 2,
	TLCA_Low                       = 3,
	TLCA_Medium                    = 4,
	TLCA_High                      = 5,
	TLCA_Highest                   = 6,
	TLCA_MAX                       = 7,
};

enum class ETextureEncodeSpeed : uint8
{
	Final                          = 0,
	FinalIfAvailable               = 1,
	Fast                           = 2,
	ETextureEncodeSpeed_MAX        = 3,
};

enum class ETextureClass : uint8
{
	Invalid                        = 0,
	TwoD                           = 1,
	Cube                           = 2,
	Array                          = 3,
	CubeArray                      = 4,
	Volume                         = 5,
	TwoDDynamic                    = 6,
	RenderTarget                   = 7,
	Other2DNoSource                = 8,
	OtherUnknown                   = 9,
	ETextureClass_MAX              = 10,
};

enum class ECompositeTextureMode : uint8
{
	CTM_Disabled                   = 0,
	CTM_NormalRoughnessToRed       = 1,
	CTM_NormalRoughnessToGreen     = 2,
	CTM_NormalRoughnessToBlue      = 3,
	CTM_NormalRoughnessToAlpha     = 4,
	CTM_MAX                        = 5,
};

enum class ETextureSourceCompressionFormat : uint8
{
	TSCF_None                      = 0,
	TSCF_PNG                       = 1,
	TSCF_JPEG                      = 2,
	TSCF_MAX                       = 3,
};

enum class ETextureSourceFormat : uint8
{
	TSF_Invalid                    = 0,
	TSF_G8                         = 1,
	TSF_BGRA8                      = 2,
	TSF_BGRE8                      = 3,
	TSF_RGBA16                     = 4,
	TSF_RGBA16F                    = 5,
	TSF_RGBA8_DEPRECATED           = 6,
	TSF_RGBE8_DEPRECATED           = 7,
	TSF_G16                        = 8,
	TSF_RGBA32F                    = 9,
	TSF_R16F                       = 10,
	TSF_R32F                       = 11,
	TSF_MAX                        = 12,
	TSF_RGBA8                      = 6,
	TSF_RGBE8                      = 7,
};

enum class ETextureCompressionSettings : uint8
{
	TC_Default                     = 0,
	TC_Normalmap                   = 1,
	TC_Masks                       = 2,
	TC_Grayscale                   = 3,
	TC_Displacementmap             = 4,
	TC_VectorDisplacementmap       = 5,
	TC_HDR                         = 6,
	TC_EditorIcon                  = 7,
	TC_Alpha                       = 8,
	TC_DistanceFieldFont           = 9,
	TC_HDR_Compressed              = 10,
	TC_BC7                         = 11,
	TC_HalfFloat                   = 12,
	TC_LQ                          = 13,
	TC_EncodedReflectionCapture    = 14,
	TC_SingleFloat                 = 15,
	TC_HDR_F32                     = 16,
	TC_MAX                         = 17,
};

enum class ETextureSourceEncoding : uint8
{
	TSE_None                       = 0,
	TSE_Linear                     = 1,
	TSE_sRGB                       = 2,
	TSE_ST2084                     = 3,
	TSE_Gamma22                    = 4,
	TSE_BT1886                     = 5,
	TSE_Gamma26                    = 6,
	TSE_Cineon                     = 7,
	TSE_REDLog                     = 8,
	TSE_REDLog3G10                 = 9,
	TSE_SLog1                      = 10,
	TSE_SLog2                      = 11,
	TSE_SLog3                      = 12,
	TSE_AlexaV3LogC                = 13,
	TSE_CanonLog                   = 14,
	TSE_ProTune                    = 15,
	TSE_VLog                       = 16,
	TSE_MAX                        = 17,
};

enum class ETextureColorSpace : uint8
{
	TCS_None                       = 0,
	TCS_sRGB                       = 1,
	TCS_Rec2020                    = 2,
	TCS_ACESAP0                    = 3,
	TCS_ACESAP1                    = 4,
	TCS_P3DCI                      = 5,
	TCS_P3D65                      = 6,
	TCS_REDWideGamut               = 7,
	TCS_SonySGamut3                = 8,
	TCS_SonySGamut3Cine            = 9,
	TCS_AlexaWideGamut             = 10,
	TCS_CanonCinemaGamut           = 11,
	TCS_GoProProtuneNative         = 12,
	TCS_PanasonicVGamut            = 13,
	TCS_Custom                     = 99,
	TCS_MAX                        = 100,
};

enum class ETextureCookPlatformTilingSettings : uint8
{
	TCPTS_FromTextureGroup         = 0,
	TCPTS_Tile                     = 1,
	TCPTS_DoNotTile                = 2,
	TCPTS_MAX                      = 3,
};

enum class ETextureChromaticAdaptationMethod : uint8
{
	TCAM_None                      = 0,
	TCAM_Bradford                  = 1,
	TCAM_CAT02                     = 2,
	TCAM_MAX                       = 3,
};

enum class ETextureFilter : uint8
{
	TF_Nearest                     = 0,
	TF_Bilinear                    = 1,
	TF_Trilinear                   = 2,
	TF_Default                     = 3,
	TF_MAX                         = 4,
};

enum class ETextureAddress : uint8
{
	TA_Wrap                        = 0,
	TA_Clamp                       = 1,
	TA_Mirror                      = 2,
	TA_MAX                         = 3,
};

enum class ETextureMipCount : uint8
{
	TMC_ResidentMips               = 0,
	TMC_AllMips                    = 1,
	TMC_AllMipsBiased              = 2,
	TMC_MAX                        = 3,
};

enum class ETextureCompressionQuality : uint8
{
	TCQ_Default                    = 0,
	TCQ_Lowest                     = 1,
	TCQ_Low                        = 2,
	TCQ_Medium                     = 3,
	TCQ_High                       = 4,
	TCQ_Highest                    = 5,
	TCQ_MAX                        = 6,
};

enum class ETimelineLengthMode : uint8
{
	TL_TimelineLength              = 0,
	TL_LastKeyFrame                = 1,
	TL_MAX                         = 2,
};

enum class ETimelineDirection : uint8
{
	Forward                        = 0,
	Backward                       = 1,
	ETimelineDirection_MAX         = 2,
};

enum class ETwitterRequestMethod : uint8
{
	TRM_Get                        = 0,
	TRM_Post                       = 1,
	TRM_Delete                     = 2,
	TRM_MAX                        = 3,
};

enum class ETwitterIntegrationDelegate : uint8
{
	TID_AuthorizeComplete          = 0,
	TID_TweetUIComplete            = 1,
	TID_RequestComplete            = 2,
	TID_MAX                        = 3,
};

enum class EUserDefinedStructureStatus : uint8
{
	UDSS_UpToDate                  = 0,
	UDSS_Dirty                     = 1,
	UDSS_Error                     = 2,
	UDSS_Duplicate                 = 3,
	UDSS_MAX                       = 4,
};

enum class EVectorFieldConstructionOp : uint8
{
	VFCO_Extrude                   = 0,
	VFCO_Revolve                   = 1,
	VFCO_MAX                       = 2,
};

enum class ESplitScreenType : uint8
{
	None                           = 0,
	TwoPlayer_Horizontal           = 1,
	TwoPlayer_Vertical             = 2,
	ThreePlayer_FavorTop           = 3,
	ThreePlayer_FavorBottom        = 4,
	ThreePlayer_Vertical           = 5,
	ThreePlayer_Horizontal         = 6,
	FourPlayer_Grid                = 7,
	FourPlayer_Vertical            = 8,
	FourPlayer_Horizontal          = 9,
	SplitTypeCount                 = 10,
	ESplitScreenType_MAX           = 11,
};

enum class EWindSourceType : uint8
{
	Directional                    = 0,
	Point                          = 1,
	EWindSourceType_MAX            = 2,
};

enum class EVisibilityAggressiveness : uint8
{
	VIS_LeastAggressive            = 0,
	VIS_ModeratelyAggressive       = 1,
	VIS_MostAggressive             = 2,
	VIS_Max                        = 3,
};

enum class EVolumeLightingMethod : uint8
{
	VLM_VolumetricLightmap         = 0,
	VLM_SparseVolumeLightingSamples = 1,
	VLM_MAX                        = 2,
};

enum class EHierarchicalSimplificationMethod : uint8
{
	None                           = 0,
	Merge                          = 1,
	Simplify                       = 2,
	Approximate                    = 3,
	EHierarchicalSimplificationMethod_MAX = 4,
};

enum class EQuartzTimeSignatureQuantization : uint8
{
	HalfNote                       = 0,
	QuarterNote                    = 1,
	EighthNote                     = 2,
	SixteenthNote                  = 3,
	ThirtySecondNote               = 4,
	Count                          = 5,
	EQuartzTimeSignatureQuantization_MAX = 6,
};

enum class EQuartzDelegateType : uint8
{
	MetronomeTick                  = 0,
	CommandEvent                   = 1,
	Count                          = 2,
	EQuartzDelegateType_MAX        = 3,
};

enum class EQuarztQuantizationReference : uint8
{
	BarRelative                    = 0,
	TransportRelative              = 1,
	CurrentTimeRelative            = 2,
	Count                          = 3,
	EQuarztQuantizationReference_MAX = 4,
};

enum class EQuartzCommandType : uint8
{
	PlaySound                      = 0,
	QueueSoundToPlay               = 1,
	RetriggerSound                 = 2,
	TickRateChange                 = 3,
	TransportReset                 = 4,
	StartOtherClock                = 5,
	Custom                         = 6,
	EQuartzCommandType_MAX         = 7,
};

enum class EActorUpdateOverlapsMethod : uint8
{
	UseConfigDefault               = 0,
	AlwaysUpdate                   = 1,
	OnlyUpdateMovable              = 2,
	NeverUpdate                    = 3,
	EActorUpdateOverlapsMethod_MAX = 4,
};

enum class ESpawnActorScaleMethod : uint8
{
	OverrideRootScale              = 0,
	MultiplyWithRoot               = 1,
	SelectDefaultAtRuntime         = 2,
	ESpawnActorScaleMethod_MAX     = 3,
};

enum class EFNavigationSystemRunMode : uint8
{
	InvalidMode                    = 0,
	GameMode                       = 1,
	EditorMode                     = 2,
	SimulationMode                 = 3,
	PIEMode                        = 4,
	InferFromWorldMode             = 5,
	EditorWorldPartitionBuildMode  = 6,
	FNavigationSystemRunMode_MAX   = 7,
};

enum class ENavigationOptionFlag : uint8
{
	Default                        = 0,
	Enable                         = 1,
	Disable                        = 2,
	MAX                            = 3,
};

enum class ENavDataGatheringMode : uint8
{
	Default                        = 0,
	Instant                        = 1,
	Lazy                           = 2,
	ENavDataGatheringMode_MAX      = 3,
};

enum class ENavDataGatheringModeConfig : uint8
{
	Invalid                        = 0,
	Instant                        = 1,
	Lazy                           = 2,
	ENavDataGatheringModeConfig_MAX = 3,
};

enum class ENavPathEvent : uint8
{
	Cleared                        = 0,
	NewPath                        = 1,
	UpdatedDueToGoalMoved          = 2,
	UpdatedDueToNavigationChanged  = 3,
	Invalidated                    = 4,
	RePathFailed                   = 5,
	MetaPathUpdate                 = 6,
	Custom                         = 7,
	ENavPathEvent_MAX              = 8,
};

enum class ENavigationQueryResult : uint8
{
	Invalid                        = 0,
	Error                          = 1,
	Fail                           = 2,
	Success                        = 3,
	ENavigationQueryResult_MAX     = 4,
};

enum class EAlphaBlendOption : uint8
{
	Linear                         = 0,
	Cubic                          = 1,
	HermiteCubic                   = 2,
	Sinusoidal                     = 3,
	QuadraticInOut                 = 4,
	CubicInOut                     = 5,
	QuarticInOut                   = 6,
	QuinticInOut                   = 7,
	CircularIn                     = 8,
	CircularOut                    = 9,
	CircularInOut                  = 10,
	ExpIn                          = 11,
	ExpOut                         = 12,
	ExpInOut                       = 13,
	Custom                         = 14,
	EAlphaBlendOption_MAX          = 15,
};

enum class EAnimGroupRole : uint8
{
	CanBeLeader                    = 0,
	AlwaysFollower                 = 1,
	AlwaysLeader                   = 2,
	TransitionLeader               = 3,
	TransitionFollower             = 4,
	EAnimGroupRole_MAX             = 5,
};

enum class EAnimSyncGroupScope : uint8
{
	Local                          = 0,
	Component                      = 1,
	EAnimSyncGroupScope_MAX        = 2,
};

enum class EAnimSyncMethod : uint8
{
	DoNotSync                      = 0,
	SyncGroup                      = 1,
	Graph                          = 2,
	EAnimSyncMethod_MAX            = 3,
};

enum class EAnimExecutionContextConversionResult : uint8
{
	Succeeded                      = 1,
	Failed                         = 0,
	EAnimExecutionContextConversionResult_MAX = 2,
};

enum class EMontagePlayReturnType : uint8
{
	MontageLength                  = 0,
	Duration                       = 1,
	EMontagePlayReturnType_MAX     = 2,
};

enum class EDrawDebugItemType : uint8
{
	DirectionalArrow               = 0,
	Sphere                         = 1,
	Line                           = 2,
	OnScreenMessage                = 3,
	CoordinateSystem               = 4,
	Point                          = 5,
	Circle                         = 6,
	Cone                           = 7,
	EDrawDebugItemType_MAX         = 8,
};

enum class EAnimLinkMethod : uint8
{
	Absolute                       = 0,
	Relative                       = 1,
	Proportional                   = 2,
	EAnimLinkMethod_MAX            = 3,
};

enum class EAnimNotifyEventType : uint8
{
	Begin                          = 0,
	End                            = 1,
	EAnimNotifyEventType_MAX       = 2,
};

enum class EMontageBlendMode : uint8
{
	Standard                       = 0,
	Inertialization                = 1,
	EMontageBlendMode_MAX          = 2,
};

enum class EMontageSubStepResult : uint8
{
	Moved                          = 0,
	NotMoved                       = 1,
	InvalidSection                 = 2,
	InvalidMontage                 = 3,
	EMontageSubStepResult_MAX      = 4,
};

enum class EPinHidingMode : uint8
{
	NeverAsPin                     = 0,
	PinHiddenByDefault             = 1,
	PinShownByDefault              = 2,
	AlwaysAsPin                    = 3,
	EPinHidingMode_MAX             = 4,
};

enum class EAnimNodeDataFlags : uint8
{
	None                           = 0,
	HasInitialUpdateFunction       = 1,
	HasBecomeRelevantFunction      = 2,
	HasUpdateFunction              = 4,
	EAnimNodeDataFlags_MAX         = 5,
};

enum class EAnimNodeReferenceConversionResult : uint8
{
	Succeeded                      = 1,
	Failed                         = 0,
	EAnimNodeReferenceConversionResult_MAX = 2,
};

enum class EInertializationState : uint8
{
	Inactive                       = 0,
	Pending                        = 1,
	Active                         = 2,
	EInertializationState_MAX      = 3,
};

enum class EInertializationBoneState : uint8
{
	Invalid                        = 0,
	Valid                          = 1,
	Excluded                       = 2,
	EInertializationBoneState_MAX  = 3,
};

enum class EInertializationSpace : uint8
{
	Default                        = 0,
	WorldSpace                     = 1,
	WorldRotation                  = 2,
	EInertializationSpace_MAX      = 3,
};

enum class EEvaluatorDataSource : uint8
{
	EDS_SourcePose                 = 0,
	EDS_DestinationPose            = 1,
	EDS_MAX                        = 2,
};

enum class EEvaluatorMode : uint8
{
	EM_Standard                    = 0,
	EM_Freeze                      = 1,
	EM_DelayedFreeze               = 2,
	EM_MAX                         = 3,
};

enum class ETransitionRequestQueueMode : uint8
{
	Shared                         = 0,
	Unique                         = 1,
	ETransitionRequestQueueMode_MAX = 2,
};

enum class ETransitionRequestOverwriteMode : uint8
{
	Append                         = 0,
	Ignore                         = 1,
	Overwrite                      = 2,
	ETransitionRequestOverwriteMode_MAX = 3,
};

enum class ETransitionBlendMode : uint8
{
	TBM_Linear                     = 0,
	TBM_Cubic                      = 1,
	TBM_MAX                        = 2,
};

enum class ETransitionLogicType : uint8
{
	TLT_StandardBlend              = 0,
	TLT_Inertialization            = 1,
	TLT_Custom                     = 2,
	TLT_MAX                        = 3,
};

enum class EAnimPropertyAccessCallSite : uint8
{
	WorkerThread_Unbatched         = 0,
	WorkerThread_Batched_PreEventGraph = 1,
	WorkerThread_Batched_PostEventGraph = 2,
	GameThread_Batched_PreEventGraph = 3,
	GameThread_Batched_PostEventGraph = 4,
	EAnimPropertyAccessCallSite_MAX = 5,
};

enum class EBlendProfileMode : uint8
{
	TimeFactor                     = 0,
	WeightFactor                   = 1,
	BlendMask                      = 2,
	EBlendProfileMode_MAX          = 3,
};

enum class ETransformCurveChannel : uint8
{
	Position                       = 0,
	Rotation                       = 1,
	Scale                          = 2,
	Invalid                        = 3,
	ETransformCurveChannel_MAX     = 4,
};

enum class EVectorCurveChannel : uint8
{
	X                              = 0,
	Y                              = 1,
	Z                              = 2,
	Invalid                        = 3,
	EVectorCurveChannel_MAX        = 4,
};

enum class EPostCopyOperation : uint8
{
	None                           = 0,
	LogicalNegateBool              = 1,
	EPostCopyOperation_MAX         = 2,
};

enum class EAnimAlphaInputType : uint8
{
	Float                          = 0,
	Bool                           = 1,
	Curve                          = 2,
	EAnimAlphaInputType_MAX        = 3,
};

enum class EMirrorRowType : uint8
{
	Bone                           = 0,
	AnimationNotify                = 1,
	Curve                          = 2,
	SyncMarker                     = 3,
	Custom                         = 4,
	EMirrorRowType_MAX             = 5,
};

enum class EMirrorFindReplaceMethod : uint8
{
	Prefix                         = 0,
	Suffix                         = 1,
	RegularExpression              = 2,
	EMirrorFindReplaceMethod_MAX   = 3,
};

enum class EControlConstraint : uint8
{
	Orientation                    = 0,
	Translation                    = 1,
	MAX                            = 2,
};

enum class EConstraintTransform : uint8
{
	Absolute                       = 0,
	Relative                       = 1,
	EConstraintTransform_MAX       = 2,
};

enum class EBoneTranslationRetargetingMode : uint8
{
	Animation                      = 0,
	Skeleton                       = 1,
	AnimationScaled                = 2,
	AnimationRelative              = 3,
	OrientAndScale                 = 4,
	EBoneTranslationRetargetingMode_MAX = 5,
};

enum class ETimeStretchCurveMapping : uint8
{
	T_Original                     = 0,
	T_TargetMin                    = 1,
	T_TargetMax                    = 2,
	MAX                            = 3,
};

enum class EPreviewAnimationBlueprintApplicationMethod : uint8
{
	LinkedLayers                   = 0,
	LinkedAnimGraph                = 1,
	EPreviewAnimationBlueprintApplicationMethod_MAX = 2,
};

enum class EPrimaryAssetCookRule : uint8
{
	Unknown                        = 0,
	NeverCook                      = 1,
	ProductionNeverCook            = 2,
	DevelopmentCook                = 2,
	DevelopmentAlwaysProductionNeverCook = 3,
	DevelopmentAlwaysCook          = 3,
	DevelopmentAlwaysProductionUnknownCook = 4,
	AlwaysCook                     = 5,
	EPrimaryAssetCookRule_MAX      = 6,
};

enum class EAttenuationDistanceModel : uint8
{
	Linear                         = 0,
	Logarithmic                    = 1,
	Inverse                        = 2,
	LogReverse                     = 3,
	NaturalSound                   = 4,
	Custom                         = 5,
	EAttenuationDistanceModel_MAX  = 6,
};

enum class EAttenuationShape : uint8
{
	Sphere                         = 0,
	Capsule                        = 1,
	Box                            = 2,
	Cone                           = 3,
	EAttenuationShape_MAX          = 4,
};

enum class ENaturalSoundFalloffMode : uint8
{
	Continues                      = 0,
	Silent                         = 1,
	Hold                           = 2,
	ENaturalSoundFalloffMode_MAX   = 3,
};

enum class EAudioBusChannels : uint8
{
	Mono                           = 0,
	Stereo                         = 1,
	Quad                           = 3,
	FivePointOne                   = 5,
	SevenPointOne                  = 7,
	EAudioBusChannels_MAX          = 8,
};

enum class EVoiceSampleRate : int32
{
	Low16000Hz                     = 16000,
	Normal24000Hz                  = 24000,
	EVoiceSampleRate_MAX           = 24001,
};

enum class EPanningMethod : uint8
{
	Linear                         = 0,
	EqualPower                     = 1,
	EPanningMethod_MAX             = 2,
};

enum class EMonoChannelUpmixMethod : uint8
{
	Linear                         = 0,
	EqualPower                     = 1,
	FullVolume                     = 2,
	EMonoChannelUpmixMethod_MAX    = 3,
};

enum class EDefaultAudioCompressionType : uint8
{
	BinkAudio                      = 0,
	ADPCM                          = 1,
	PCM                            = 2,
	PlatformSpecific               = 3,
	EDefaultAudioCompressionType_MAX = 4,
};

enum class EAudioVolumeLocationState : uint8
{
	InsideTheVolume                = 0,
	OutsideTheVolume               = 1,
	EAudioVolumeLocationState_MAX  = 2,
};

enum class EInterfaceValidResult : uint8
{
	Valid                          = 0,
	Invalid                        = 1,
	EInterfaceValidResult_MAX      = 2,
};

enum class ECameraShakeUpdateResultFlags : uint8
{
	ApplyAsAbsolute                = 1,
	SkipAutoScale                  = 2,
	SkipAutoPlaySpace              = 4,
	Default                        = 0,
	ECameraShakeUpdateResultFlags_MAX = 5,
};

enum class ECameraShakeDurationType : uint8
{
	Fixed                          = 0,
	Infinite                       = 1,
	Custom                         = 2,
	ECameraShakeDurationType_MAX   = 3,
};

enum class ECameraShakeAttenuation : uint8
{
	Linear                         = 0,
	Quadratic                      = 1,
	ECameraShakeAttenuation_MAX    = 2,
};

enum class ECameraAlphaBlendMode : uint8
{
	CABM_Linear                    = 0,
	CABM_Cubic                     = 1,
	CABM_MAX                       = 2,
};

enum class EAudioFaderCurve : uint8
{
	Linear                         = 0,
	Logarithmic                    = 1,
	SCurve                         = 2,
	Sin                            = 3,
	Count                          = 4,
	EAudioFaderCurve_MAX           = 5,
};

enum class EModulationDestination : uint8
{
	Volume                         = 0,
	Pitch                          = 1,
	Lowpass                        = 2,
	Highpass                       = 3,
	Count                          = 4,
	EModulationDestination_MAX     = 5,
};

enum class ENetMoveType : uint8
{
	ServerMove                     = 0,
	ServerMoveOld                  = 1,
	ServerMoveWithRotation         = 2,
	ServerMoveOldWithRotation      = 3,
	ServerMoveOnlyRotation         = 4,
	ENetMoveType_MAX               = 5,
};

enum class EControllerAnalogStick : uint8
{
	CAS_LeftStick                  = 0,
	CAS_RightStick                 = 1,
	CAS_MAX                        = 2,
};

enum class ESyncOption : uint8
{
	Drive                          = 0,
	Passive                        = 1,
	Disabled                       = 2,
	ESyncOption_MAX                = 3,
};

enum class EReflectionSourceType : uint8
{
	CapturedScene                  = 0,
	SpecifiedCubemap               = 1,
	EReflectionSourceType_MAX      = 2,
};

enum class EReflectionDFAOOption : uint8
{
	Default                        = 0,
	UsedWithDFAO                   = 1,
	NotUsedWithDFAO                = 2,
	EReflectionDFAOOption_MAX      = 3,
};

enum class ESceneCapturePrimitiveRenderMode : uint8
{
	PRM_LegacySceneCapture         = 0,
	PRM_RenderScenePrimitives      = 1,
	PRM_UseShowOnlyList            = 2,
	PRM_MAX                        = 3,
};

enum class ECustomBoneAttributeLookup : uint8
{
	BoneOnly                       = 0,
	ImmediateParent                = 1,
	ParentHierarchy                = 2,
	ECustomBoneAttributeLookup_MAX = 3,
};

enum class EKinematicBonesUpdateToPhysics : uint8
{
	SkipSimulatingBones            = 0,
	SkipAllBones                   = 1,
	EKinematicBonesUpdateToPhysics_MAX = 2,
};

enum class EAnimationMode : uint8
{
	AnimationBlueprint             = 0,
	AnimationSingleNode            = 1,
	AnimationCustomMode            = 2,
	EAnimationMode_MAX             = 3,
};

enum class EPhysicsTransformUpdateMode : uint8
{
	SimulationUpatesComponentTransform = 0,
	ComponentTransformIsKinematic  = 1,
	EPhysicsTransformUpdateMode_MAX = 2,
};

enum class ESkyAtmosphereTransformMode : uint8
{
	PlanetTopAtAbsoluteWorldOrigin = 0,
	PlanetTopAtComponentTransform  = 1,
	PlanetCenterAtComponentTransform = 2,
	ESkyAtmosphereTransformMode_MAX = 3,
};

enum class ESplinePointType : uint8
{
	Linear                         = 0,
	Curve                          = 1,
	Constant                       = 2,
	CurveClamped                   = 3,
	CurveCustomTangent             = 4,
	ESplinePointType_MAX           = 5,
};

enum class ESplineCoordinateSpace : uint8
{
	Local                          = 0,
	World                          = 1,
	ESplineCoordinateSpace_MAX     = 2,
};

enum class ESplineMeshAxis : uint8
{
	X                              = 0,
	Y                              = 1,
	Z                              = 2,
	ESplineMeshAxis_MAX            = 3,
};

enum class EVolumetricCloudTracingMaxDistanceMode : uint8
{
	DistanceFromCloudLayerEntryPoint = 0,
	DistanceFromPointOfView        = 1,
	EVolumetricCloudTracingMaxDistanceMode_MAX = 2,
};

enum class ECurveTableMode : uint8
{
	Empty                          = 0,
	SimpleCurves                   = 1,
	RichCurves                     = 2,
	ECurveTableMode_MAX            = 3,
};

enum class EFDataDrivenCVarType : uint8
{
	CVarFloat                      = 0,
	CVarInt                        = 1,
	CVarBool                       = 2,
	FDataDrivenCVarType_MAX        = 3,
};

enum class EEvaluateCurveTableResult : uint8
{
	RowFound                       = 0,
	RowNotFound                    = 1,
	EEvaluateCurveTableResult_MAX  = 2,
};

enum class EReporterLineStyle : uint8
{
	Line                           = 0,
	Dash                           = 1,
	EReporterLineStyle_MAX         = 2,
};

enum class EGraphAxisStyle : uint8
{
	Lines                          = 0,
	Notches                        = 1,
	Grid                           = 2,
	EGraphAxisStyle_MAX            = 3,
};

enum class EGraphDataStyle : uint8
{
	Lines                          = 0,
	Filled                         = 1,
	EGraphDataStyle_MAX            = 2,
};

enum class ELegendPosition : uint8
{
	Outside                        = 0,
	Inside                         = 1,
	ELegendPosition_MAX            = 2,
};

enum class EGrammaticalGender : uint8
{
	Neuter                         = 0,
	Masculine                      = 1,
	Feminine                       = 2,
	Mixed                          = 3,
	EGrammaticalGender_MAX         = 4,
};

enum class EGrammaticalNumber : uint8
{
	Singular                       = 0,
	Plural                         = 1,
	EGrammaticalNumber_MAX         = 2,
};

enum class ETypedElementWorldType : uint8
{
	Game                           = 0,
	Editor                         = 1,
	ETypedElementWorldType_MAX     = 2,
};

enum class ECustomTimeStepSynchronizationState : uint8
{
	Closed                         = 0,
	Error                          = 1,
	Synchronized                   = 2,
	Synchronizing                  = 3,
	ECustomTimeStepSynchronizationState_MAX = 4,
};

enum class EVectorQuantization : uint8
{
	RoundWholeNumber               = 0,
	RoundOneDecimal                = 1,
	RoundTwoDecimals               = 2,
	EVectorQuantization_MAX        = 3,
};

enum class ERotatorQuantization : uint8
{
	ByteComponents                 = 0,
	ShortComponents                = 1,
	ERotatorQuantization_MAX       = 2,
};

enum class ETimecodeProviderSynchronizationState : int32
{
	Closed                         = 0,
	Error                          = 1,
	Synchronized                   = 2,
	Synchronizing                  = 3,
	ETimecodeProviderSynchronizationState_MAX = 4,
};

enum class EFontCacheType : uint8
{
	Offline                        = 0,
	Runtime                        = 1,
	EFontCacheType_MAX             = 2,
};

enum class ERootMotionAccumulateMode : uint8
{
	Override                       = 0,
	Additive                       = 1,
	ERootMotionAccumulateMode_MAX  = 2,
};

enum class ERootMotionSourceStatusFlags : uint8
{
	Prepared                       = 1,
	Finished                       = 2,
	MarkedForRemoval               = 4,
	ERootMotionSourceStatusFlags_MAX = 5,
};

enum class ERootMotionSourceSettingsFlags : uint8
{
	UseSensitiveLiftoffCheck       = 1,
	DisablePartialEndTick          = 2,
	IgnoreZAccumulate              = 4,
	ERootMotionSourceSettingsFlags_MAX = 5,
};

enum class ERootMotionFinishVelocityMode : uint8
{
	MaintainLastRootMotionVelocity = 0,
	SetVelocity                    = 1,
	ClampVelocity                  = 2,
	ERootMotionFinishVelocityMode_MAX = 3,
};

enum class EWindowMode : uint8
{
	Fullscreen                     = 0,
	WindowedFullscreen             = 1,
	Windowed                       = 2,
	EWindowMode_MAX                = 3,
};

enum class ESlateGesture : uint8
{
	None                           = 0,
	Scroll                         = 1,
	Magnify                        = 2,
	Swipe                          = 3,
	Rotate                         = 4,
	LongPress                      = 5,
	ESlateGesture_MAX              = 6,
};

enum class EMIDCreationFlags : uint8
{
	None                           = 0,
	Transient                      = 1,
	EMIDCreationFlags_MAX          = 2,
};

enum class EEasingFunc : uint8
{
	Linear                         = 0,
	Step                           = 1,
	SinusoidalIn                   = 2,
	SinusoidalOut                  = 3,
	SinusoidalInOut                = 4,
	EaseIn                         = 5,
	EaseOut                        = 6,
	EaseInOut                      = 7,
	ExpoIn                         = 8,
	ExpoOut                        = 9,
	ExpoInOut                      = 10,
	CircularIn                     = 11,
	CircularOut                    = 12,
	CircularInOut                  = 13,
	EEasingFunc_MAX                = 14,
};

enum class ELerpInterpolationMode : uint8
{
	QuatInterp                     = 0,
	EulerInterp                    = 1,
	DualQuatInterp                 = 2,
	ELerpInterpolationMode_MAX     = 3,
};

enum class EMatrixColumns : uint8
{
	First                          = 0,
	Second                         = 1,
	Third                          = 2,
	Fourth                         = 3,
	EMatrixColumns_MAX             = 4,
};

enum class EDispatchComputeRenderSlot : uint8
{
	CRS_None                       = 0,
	CRS_PreRender                  = 1,
	CRS_PostOpaque                 = 2,
	CRS_Overlay                    = 3,
	CRS_MAX                        = 4,
};

enum class EImportanceWeight : uint8
{
	Luminance                      = 0,
	Red                            = 1,
	Green                          = 2,
	Blue                           = 3,
	Alpha                          = 4,
	EImportanceWeight_MAX          = 5,
};

enum class EDecalBlendMode : uint8
{
	DBM_Translucent                = 0,
	DBM_Stain                      = 1,
	DBM_Normal                     = 2,
	DBM_Emissive                   = 3,
	DBM_DBuffer_ColorNormalRoughness = 4,
	DBM_DBuffer_Color              = 5,
	DBM_DBuffer_ColorNormal        = 6,
	DBM_DBuffer_ColorRoughness     = 7,
	DBM_DBuffer_Normal             = 8,
	DBM_DBuffer_NormalRoughness    = 9,
	DBM_DBuffer_Roughness          = 10,
	DBM_DBuffer_Emissive           = 11,
	DBM_DBuffer_AlphaComposite     = 12,
	DBM_DBuffer_EmissiveAlphaComposite = 13,
	DBM_Volumetric_DistanceFunction = 14,
	DBM_AlphaComposite             = 15,
	DBM_AmbientOcclusion           = 16,
	DBM_MAX                        = 17,
};

enum class EMaterialDecalResponse : uint8
{
	MDR_None                       = 0,
	MDR_ColorNormalRoughness       = 1,
	MDR_Color                      = 2,
	MDR_ColorNormal                = 3,
	MDR_ColorRoughness             = 4,
	MDR_Normal                     = 5,
	MDR_NormalRoughness            = 6,
	MDR_Roughness                  = 7,
	MDR_MAX                        = 8,
};

enum class EMaterialTranslucencyPass : uint8
{
	MTP_BeforeDOF                  = 0,
	MTP_AfterDOF                   = 1,
	MTP_AfterMotionBlur            = 2,
	MTP_MAX                        = 3,
};

enum class EMeshFeatureImportance : uint8
{
	Off                            = 0,
	Lowest                         = 1,
	Low                            = 2,
	Normal                         = 3,
	High                           = 4,
	Highest                        = 5,
	EMeshFeatureImportance_MAX     = 6,
};

enum class EStaticMeshReductionTerimationCriterion : uint8
{
	Triangles                      = 0,
	Vertices                       = 1,
	Any                            = 2,
	EStaticMeshReductionTerimationCriterion_MAX = 3,
};

enum class EChartAggregationMode : uint8
{
	TextureSize                    = 0,
	SurfaceArea                    = 1,
	PixelDensity                   = 2,
	UVSize                         = 3,
	EChartAggregationMode_MAX      = 4,
};

enum class ELandscapeCullingPrecision : uint8
{
	High                           = 0,
	Medium                         = 1,
	Low                            = 2,
	ELandscapeCullingPrecision_MAX = 3,
};

enum class EProxyNormalComputationMethod : uint8
{
	AngleWeighted                  = 0,
	AreaWeighted                   = 1,
	EqualWeighted                  = 2,
	EProxyNormalComputationMethod_MAX = 3,
};

enum class EMeshLODSelectionType : uint8
{
	AllLODs                        = 0,
	SpecificLOD                    = 1,
	CalculateLOD                   = 2,
	LowestDetailLOD                = 3,
	EMeshLODSelectionType_MAX      = 4,
};

enum class EMeshMergeType : uint8
{
	MeshMergeType_Default          = 0,
	MeshMergeType_MergeActor       = 1,
	MeshMergeType_MAX              = 2,
};

enum class EUVOutput : uint8
{
	DoNotOutputChannel             = 0,
	OutputChannel                  = 1,
	EUVOutput_MAX                  = 2,
};

enum class EMeshApproximationType : uint8
{
	MeshAndMaterials               = 0,
	MeshShapeOnly                  = 1,
	EMeshApproximationType_MAX     = 2,
};

enum class EMeshApproximationBaseCappingType : uint8
{
	NoBaseCapping                  = 0,
	ConvexPolygon                  = 1,
	ConvexSolid                    = 2,
	EMeshApproximationBaseCappingType_MAX = 3,
};

enum class EOccludedGeometryFilteringPolicy : uint8
{
	NoOcclusionFiltering           = 0,
	VisibilityBasedFiltering       = 1,
	EOccludedGeometryFilteringPolicy_MAX = 2,
};

enum class EMeshApproximationSimplificationPolicy : uint8
{
	FixedTriangleCount             = 0,
	TrianglesPerArea               = 1,
	GeometricTolerance             = 2,
	EMeshApproximationSimplificationPolicy_MAX = 3,
};

enum class EMeshApproximationGroundPlaneClippingPolicy : uint8
{
	NoGroundClipping               = 0,
	DiscardWithZPlane              = 1,
	CutWithZPlane                  = 2,
	CutAndFillWithZPlane           = 3,
	EMeshApproximationGroundPlaneClippingPolicy_MAX = 4,
};

enum class EMeshApproximationUVGenerationPolicy : uint8
{
	PreferUVAtlas                  = 0,
	PreferXAtlas                   = 1,
	PreferPatchBuilder             = 2,
	EMeshApproximationUVGenerationPolicy_MAX = 3,
};

enum class EVertexPaintAxis : uint8
{
	X                              = 0,
	Y                              = 1,
	Z                              = 2,
	EVertexPaintAxis_MAX           = 3,
};

enum class EReplayResult : uint8
{
	Success                        = 0,
	ReplayNotFound                 = 1,
	Corrupt                        = 2,
	UnsupportedCheckpoint          = 3,
	GameSpecific                   = 4,
	InitConnect                    = 5,
	LoadMap                        = 6,
	Serialization                  = 7,
	StreamerError                  = 8,
	ConnectionClosed               = 9,
	MissingArchive                 = 10,
	Unknown                        = 11,
	EReplayResult_MAX              = 12,
};

enum class EPSCPoolMethod : uint8
{
	None                           = 0,
	AutoRelease                    = 1,
	ManualRelease                  = 2,
	ManualRelease_OnComplete       = 3,
	FreeInPool                     = 4,
	EPSCPoolMethod_MAX             = 5,
};

enum class EPerQualityLevels : uint8
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Epic                           = 3,
	Cinematic                      = 4,
	Num                            = 5,
	EPerQualityLevels_MAX          = 6,
};

enum class EAngularDriveMode : uint8
{
	SLERP                          = 0,
	TwistAndSwing                  = 1,
	EAngularDriveMode_MAX          = 2,
};

enum class EConstraintTransformComponentFlags : uint8
{
	None                           = 0,
	ChildPosition                  = 1,
	ChildRotation                  = 2,
	ParentPosition                 = 4,
	ParentRotation                 = 8,
	AllChild                       = 3,
	AllParent                      = 12,
	AllPosition                    = 5,
	AllRotation                    = 10,
	All                            = 15,
	EConstraintTransformComponentFlags_MAX = 16,
};

enum class EPhysicsAssetSolverType : uint8
{
	RBAN                           = 0,
	World                          = 1,
	EPhysicsAssetSolverType_MAX    = 2,
};

enum class ESettingsDOF : uint8
{
	Full3D                         = 0,
	YZPlane                        = 1,
	XZPlane                        = 2,
	XYPlane                        = 3,
	ESettingsDOF_MAX               = 4,
};

enum class ESettingsLockedAxis : uint8
{
	None                           = 0,
	X                              = 1,
	Y                              = 2,
	Z                              = 3,
	Invalid                        = 4,
	ESettingsLockedAxis_MAX        = 5,
};

enum class EDynamicForceFeedbackAction : uint8
{
	Start                          = 0,
	Update                         = 1,
	Stop                           = 2,
	EDynamicForceFeedbackAction_MAX = 3,
};

enum class EVoiceBlockReasons : uint8
{
	None                           = 0,
	Muted                          = 1,
	MutedBy                        = 2,
	Gameplay                       = 4,
	Blocked                        = 8,
	BlockedBy                      = 16,
	EVoiceBlockReasons_MAX         = 17,
};

enum class EPostProcessVolumeType : uint8
{
	Generic                        = 0,
	Cave                           = 1,
	Water                          = 2,
	EPostProcessVolumeType_MAX     = 3,
};

enum class EPropertyAccessCopyBatch : uint8
{
	InternalUnbatched              = 0,
	ExternalUnbatched              = 1,
	InternalBatched                = 2,
	ExternalBatched                = 3,
	Count                          = 4,
	EPropertyAccessCopyBatch_MAX   = 5,
};

enum class EPropertyAccessIndirectionType : uint8
{
	Offset                         = 0,
	Object                         = 1,
	Array                          = 2,
	ScriptFunction                 = 3,
	NativeFunction                 = 4,
	EPropertyAccessIndirectionType_MAX = 5,
};

enum class EPropertyAccessObjectType : uint8
{
	None                           = 0,
	Object                         = 1,
	WeakObject                     = 2,
	SoftObject                     = 3,
	EPropertyAccessObjectType_MAX  = 4,
};

enum class EPropertyAccessCopyType : uint8
{
	None                           = 0,
	Plain                          = 1,
	Complex                        = 2,
	Bool                           = 3,
	Struct                         = 4,
	Object                         = 5,
	Name                           = 6,
	Array                          = 7,
	PromoteBoolToByte              = 8,
	PromoteBoolToInt32             = 9,
	PromoteBoolToInt64             = 10,
	PromoteBoolToFloat             = 11,
	PromoteBoolToDouble            = 12,
	PromoteByteToInt32             = 13,
	PromoteByteToInt64             = 14,
	PromoteByteToFloat             = 15,
	PromoteByteToDouble            = 16,
	PromoteInt32ToInt64            = 17,
	PromoteInt32ToFloat            = 18,
	PromoteInt32ToDouble           = 19,
	PromoteFloatToDouble           = 20,
	DemoteDoubleToFloat            = 21,
	PromoteArrayFloatToDouble      = 22,
	DemoteArrayDoubleToFloat       = 23,
	PromoteMapValueFloatToDouble   = 24,
	DemoteMapValueDoubleToFloat    = 25,
	EPropertyAccessCopyType_MAX    = 26,
};

enum class EClearSceneOptions : uint8
{
	NoClear                        = 0,
	HardwareClear                  = 1,
	QuadAtMaxZ                     = 2,
	EClearSceneOptions_MAX         = 3,
};

enum class ECompositingSampleCount : uint8
{
	One                            = 1,
	Two                            = 2,
	Four                           = 4,
	Eight                          = 8,
	ECompositingSampleCount_MAX    = 9,
};

enum class ECustomDepthStencil : uint8
{
	Disabled                       = 0,
	Enabled                        = 1,
	EnabledOnDemand                = 2,
	EnabledWithStencil             = 3,
	ECustomDepthStencil_MAX        = 4,
};

enum class EEarlyZPass : uint8
{
	None                           = 0,
	OpaqueOnly                     = 1,
	OpaqueAndMasked                = 2,
	Auto                           = 3,
	EEarlyZPass_MAX                = 4,
};

enum class EVelocityOutputPass : uint8
{
	DepthPass                      = 0,
	BasePass                       = 1,
	AfterBasePass                  = 2,
	EVelocityOutputPass_MAX        = 3,
};

enum class EVertexDeformationOutputsVelocity : uint8
{
	Off                            = 0,
	On                             = 1,
	Auto                           = 2,
	EVertexDeformationOutputsVelocity_MAX = 3,
};

enum class EAlphaChannelMode : uint8
{
	Disabled                       = 0,
	LinearColorSpaceOnly           = 1,
	AllowThroughTonemapper         = 2,
	EAlphaChannelMode_MAX          = 3,
};

enum class EAutoExposureMethodUI : uint8
{
	AEM_Histogram                  = 0,
	AEM_Basic                      = 1,
	AEM_Manual                     = 2,
	AEM_MAX                        = 3,
};

enum class EDefaultBackBufferPixelFormat : uint8
{
	DBBPF_B8G8R8A8                 = 0,
	DBBPF_A16B16G16R16_DEPRECATED  = 1,
	DBBPF_FloatRGB_DEPRECATED      = 2,
	DBBPF_FloatRGBA                = 3,
	DBBPF_A2B10G10R10              = 4,
	DBBPF_MAX                      = 5,
};

enum class EFixedFoveationLevels : uint8
{
	Disabled                       = 0,
	Low                            = 1,
	Medium                         = 2,
	High                           = 3,
	HighTop                        = 4,
	EFixedFoveationLevels_MAX      = 5,
};

enum class EMobileAntiAliasingMethod : uint8
{
	None                           = 0,
	FXAA                           = 1,
	TemporalAA                     = 2,
	MSAA                           = 3,
	EMobileAntiAliasingMethod_MAX  = 4,
};

enum class EMobileFloatPrecisionMode : uint8
{
	Half                           = 0,
	Full_MaterialExpressionOnly    = 1,
	Full                           = 2,
	EMobileFloatPrecisionMode_MAX  = 3,
};

enum class EMobileShadingPath : uint8
{
	Forward                        = 0,
	Deferred                       = 1,
	EMobileShadingPath_MAX         = 2,
};

enum class EShaderCompressionFormat : uint8
{
	None                           = 0,
	LZ4                            = 1,
	Oodle                          = 2,
	Zlib                           = 3,
	EShaderCompressionFormat_MAX   = 4,
};

enum class ELumenSoftwareTracingMode : uint8
{
	DetailTracing                  = 1,
	GlobalTracing                  = 0,
	ELumenSoftwareTracingMode_MAX  = 2,
};

enum class ELumenRayLightingMode : uint8
{
	SurfaceCache                   = 0,
	HitLighting                    = 2,
	ELumenRayLightingMode_MAX      = 3,
};

enum class EWorkingColorSpace : uint8
{
	SRGB                           = 1,
	Rec2020                        = 2,
	ACESAP0                        = 3,
	ACESAP1                        = 4,
	P3DCI                          = 5,
	P3D65                          = 6,
	Custom                         = 7,
	EWorkingColorSpace_MAX         = 8,
};

enum class ESkeletalMeshAsyncProperties : uint8
{
	None                           = 0,
	Materials                      = 1,
	Skeleton                       = 2,
	RefSkeleton                    = 4,
	RetargetBasePose               = 8,
	RefBasesInvMatrix              = 16,
	MeshClothingAssets             = 32,
	UseLegacyMeshDerivedDataKey    = 64,
	HasActiveClothingAssets        = 128,
	LODSettings                    = 256,
	HasVertexColors                = 512,
	VertexColorGuid                = 1024,
	MorphTargets                   = 2048,
	SkeletalMeshRenderData         = 4096,
	MeshEditorDataObject           = 8192,
	NeverStream                    = 16384,
	OverrideLODStreamingSettings   = 32768,
	SupportLODStreaming            = 65536,
	MaxNumStreamedLODs             = 131072,
	MaxNumOptionalLODs             = 262144,
	ImportedModel                  = 524288,
	LODInfo                        = 1048576,
	SkinWeightProfiles             = 2097152,
	CachedComposedRefPoseMatrices  = 4194304,
	SamplingInfo                   = 8388608,
	NodeMappingData                = 16777216,
	ShadowPhysicsAsset             = 33554432,
	SkelMirrorTable                = 67108864,
	MinLod                         = 134217728,
	DisableBelowMinLodStripping    = 268435456,
	SkelMirrorAxis                 = 536870912,
	SkelMirrorFlipAxis             = 1073741824,
	DefaultAnimationRig            = 2147483648,
	NegativeBoundsExtension        = 4294967296,
	PositiveBoundsExtension        = 8589934592,
	ExtendedBounds                 = 17179869184,
	HasBeenSimplified              = 34359738368,
	EnablePerPolyCollision         = 68719476736,
	BodySetup                      = 137438953472,
	MorphTargetIndexMap            = 274877906944,
	FloorOffset                    = 549755813888,
	ImportedBounds                 = 1099511627776,
	PhysicsAsset                   = 2199023255552,
	AssetImportData                = 4398046511104,
	ThumbnailInfo                  = 8796093022208,
	HasCustomDefaultEditorCamera   = 17592186044416,
	DefaultEditorCameraLocation    = 35184372088832,
	DefaultEditorCameraRotation    = 70368744177664,
	RequiresLODScreenSizeConversion = 140737488355328,
	PostProcessAnimBlueprint       = 281474976710656,
	DefaultEditorCameraLookAt      = 562949953421312,
	PreviewAttachedAssetContainer  = 1125899906842624,
	DefaultEditorCameraOrthoZoom   = 2251799813685248,
	RequiresLODHysteresisConversion = 4503599627370496,
	bSupportRayTracing             = 9007199254740992,
	RayTracingMinLOD               = 18014398509481984,
	ClothLODBiasMode               = 36028797018963968,
	DefaultMeshDeformer            = 72057594037927936,
	All                            = -1,
	ESkeletalMeshAsyncProperties_MAX = 72057594037927937,
};

enum class EClothLODBiasMode : uint8
{
	MappingsToSameLOD              = 0,
	MappingsToMinLOD               = 1,
	MappingsToAnyLOD               = 2,
	EClothLODBiasMode_MAX          = 3,
};

enum class EBoneFilterActionOption : uint8
{
	Remove                         = 0,
	Keep                           = 1,
	Invalid                        = 2,
	EBoneFilterActionOption_MAX    = 3,
};

enum class ESkinCacheUsage : uint8
{
	Auto                           = 0,
	Disabled                       = 255,
	Enabled                        = 1,
	ESkinCacheUsage_MAX            = 256,
};

enum class ESkinCacheDefaultBehavior : uint8
{
	Exclusive                      = 0,
	Inclusive                      = 1,
	ESkinCacheDefaultBehavior_MAX  = 2,
};

enum class ELocalizedLanguage : uint8
{
	Ca                             = 0,
	Cs                             = 1,
	Da                             = 2,
	De                             = 3,
	En                             = 4,
	Es                             = 5,
	Eu                             = 6,
	Fi                             = 7,
	Fr                             = 8,
	Hu                             = 9,
	It                             = 10,
	Ja                             = 11,
	Ka                             = 12,
	Ko                             = 13,
	Nl                             = 14,
	Pl                             = 15,
	Pt_BR                          = 16,
	Ru                             = 17,
	Sv                             = 18,
	Th                             = 19,
	Tr                             = 20,
	Uk                             = 21,
	Zh                             = 22,
	Zh__Hans__CN                   = 23,
	Zh__TW                         = 24,
	LocalizedLanguageMAX           = 25,
	ELocalizedLanguage_MAX         = 26,
};

enum class EVirtualizationMode : uint8
{
	Disabled                       = 0,
	PlayWhenSilent                 = 1,
	Restart                        = 2,
	EVirtualizationMode_MAX        = 3,
};

enum class EMaxConcurrentResolutionRule : uint8
{
	PreventNew                     = 0,
	StopOldest                     = 1,
	StopFarthestThenPreventNew     = 2,
	StopFarthestThenOldest         = 3,
	StopLowestPriority             = 4,
	StopQuietest                   = 5,
	StopLowestPriorityThenPreventNew = 6,
	Count                          = 7,
	EMaxConcurrentResolutionRule_MAX = 8,
};

enum class EConcurrencyVolumeScaleMode : int32
{
	Default                        = 0,
	Distance                       = 1,
	Priority                       = 2,
	EConcurrencyVolumeScaleMode_MAX = 3,
};

enum class EModulationRouting : uint8
{
	Disable                        = 0,
	Inherit                        = 1,
	Override                       = 2,
	Union                          = 3,
	EModulationRouting_MAX         = 4,
};

enum class ESourceBusChannels : uint8
{
	Mono                           = 0,
	Stereo                         = 1,
	ESourceBusChannels_MAX         = 2,
};

enum class EFFTSize : uint8
{
	DefaultSize                    = 0,
	Min                            = 1,
	Small                          = 2,
	Medium                         = 3,
	Large                          = 4,
	VeryLarge                      = 5,
	Max                            = 6,
};

enum class EFFTPeakInterpolationMethod : uint8
{
	NearestNeighbor                = 0,
	Linear                         = 1,
	Quadratic                      = 2,
	ConstantQ                      = 3,
	EFFTPeakInterpolationMethod_MAX = 4,
};

enum class EFFTWindowType : uint8
{
	None                           = 0,
	Hamming                        = 1,
	Hann                           = 2,
	Blackman                       = 3,
	EFFTWindowType_MAX             = 4,
};

enum class EAudioSpectrumType : uint8
{
	MagnitudeSpectrum              = 0,
	PowerSpectrum                  = 1,
	Decibel                        = 2,
	EAudioSpectrumType_MAX         = 3,
};

enum class EGainParamMode : uint8
{
	Linear                         = 0,
	Decibels                       = 1,
	EGainParamMode_MAX             = 2,
};

enum class EAudioSpectrumBandPresetType : uint8
{
	KickDrum                       = 0,
	SnareDrum                      = 1,
	Voice                          = 2,
	Cymbals                        = 3,
	EAudioSpectrumBandPresetType_MAX = 4,
};

enum class EAudioRecordingExportType : uint8
{
	SoundWave                      = 0,
	WavFile                        = 1,
	EAudioRecordingExportType_MAX  = 2,
};

enum class ESendLevelControlMethod : uint8
{
	Linear                         = 0,
	CustomCurve                    = 1,
	Manual                         = 2,
	ESendLevelControlMethod_MAX    = 3,
};

enum class ESubmixSendStage : uint8
{
	PostDistanceAttenuation        = 0,
	PreDistanceAttenuation         = 1,
	ESubmixSendStage_MAX           = 2,
};

enum class ENormalMode : uint8
{
	NM_PreserveSmoothingGroups     = 0,
	NM_RecalculateNormals          = 1,
	NM_RecalculateNormalsSmooth    = 2,
	NM_RecalculateNormalsHard      = 3,
	TEMP_BROKEN                    = 4,
	ENormalMode_MAX                = 5,
};

enum class EImportanceLevel : uint8
{
	IL_Off                         = 0,
	IL_Lowest                      = 1,
	IL_Low                         = 2,
	IL_Normal                      = 3,
	IL_High                        = 4,
	IL_Highest                     = 5,
	TEMP_BROKEN2                   = 6,
	EImportanceLevel_MAX           = 7,
};

enum class EOptimizationType : uint8
{
	OT_NumOfTriangles              = 0,
	OT_MaxDeviation                = 1,
	OT_MAX                         = 2,
};

enum class ETextureEncodeEffort : uint8
{
	Default                        = 0,
	Low                            = 10,
	Normal                         = 20,
	High                           = 30,
	ETextureEncodeEffort_MAX       = 31,
};

enum class ETextureUniversalTiling : uint8
{
	Disabled                       = 0,
	Enabled_256KB                  = 1,
	Enabled_64KB                   = 2,
	ETextureUniversalTiling_MAX    = 3,
};

enum class ETextureEncodeSpeedOverride : uint8
{
	Disabled                       = 255,
	Final                          = 0,
	FinalIfAvailable               = 1,
	Fast                           = 2,
	ETextureEncodeSpeedOverride_MAX = 256,
};

enum class ETextureRenderTargetFormat : uint8
{
	RTF_R8                         = 0,
	RTF_RG8                        = 1,
	RTF_RGBA8                      = 2,
	RTF_RGBA8_SRGB                 = 3,
	RTF_R16f                       = 4,
	RTF_RG16f                      = 5,
	RTF_RGBA16f                    = 6,
	RTF_R32f                       = 7,
	RTF_RG32f                      = 8,
	RTF_RGBA32f                    = 9,
	RTF_RGB10A2                    = 10,
	RTF_MAX                        = 11,
};

enum class ERenderFocusRule : uint8
{
	Always                         = 0,
	NonPointer                     = 1,
	NavigationOnly                 = 2,
	Never                          = 3,
	ERenderFocusRule_MAX           = 4,
};

enum class EUIScalingRule : uint8
{
	ShortestSide                   = 0,
	LongestSide                    = 1,
	Horizontal                     = 2,
	Vertical                       = 3,
	ScaleToFit                     = 4,
	Custom                         = 5,
	EUIScalingRule_MAX             = 6,
};

enum class EDataLayerState : uint8
{
	Unloaded                       = 0,
	Loaded                         = 1,
	Activated                      = 2,
	EDataLayerState_MAX            = 3,
};

enum class EHLODLayerType : uint8
{
	Instancing                     = 0,
	MeshMerge                      = 1,
	MeshSimplify                   = 2,
	MeshApproximate                = 3,
	Custom                         = 4,
	EHLODLayerType_MAX             = 5,
};

enum class EWorldPartitionRuntimeCellState : uint8
{
	Unloaded                       = 0,
	Loaded                         = 1,
	Activated                      = 2,
	EWorldPartitionRuntimeCellState_MAX = 3,
};

enum class EWorldPartitionStreamingPerformance : uint8
{
	Good                           = 0,
	Slow                           = 1,
	Critical                       = 2,
	EWorldPartitionStreamingPerformance_MAX = 3,
};

enum class EStreamingSourceTargetBehavior : uint8
{
	Include                        = 0,
	Exclude                        = 1,
	EStreamingSourceTargetBehavior_MAX = 2,
};

enum class EStreamingSourceTargetState : uint8
{
	Loaded                         = 0,
	Activated                      = 1,
	EStreamingSourceTargetState_MAX = 2,
};

enum class EStreamingSourcePriority : uint8
{
	Highest                        = 0,
	High                           = 64,
	Normal                         = 128,
	Low                            = 192,
	Lowest                         = 255,
	Default                        = 128,
	EStreamingSourcePriority_MAX   = 256,
};


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x28 (0x28 - 0x0)
// ScriptStruct Engine.MaterialInput
struct FMaterialInput
{
public:
	class UMaterialExpression*                   Expression;                                        // 0x0(0x8)(None)
	int32                                        OutputIndex;                                       // 0x8(0x4)(None)
	class FName                                  InputName;                                         // 0xC(0x8)(None)
	int32                                        Mask;                                              // 0x14(0x4)(None)
	int32                                        MaskR;                                             // 0x18(0x4)(None)
	int32                                        MaskG;                                             // 0x1C(0x4)(None)
	int32                                        MaskB;                                             // 0x20(0x4)(None)
	int32                                        MaskA;                                             // 0x24(0x4)(None)
};

// 0x8 (0x30 - 0x28)
// ScriptStruct Engine.ColorMaterialInput
struct FColorMaterialInput : public FMaterialInput
{
public:
	uint8                                        UseConstant : 1;                                   // Mask: 0x1, PropSize: 0x10x28(0x1)(None)
	uint8                                        BitPad_305 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_38F5[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FColor                                Constant;                                          // 0x2C(0x4)(None)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Engine.DistributionLookupTable
struct FDistributionLookupTable
{
public:
	float                                        TimeScale;                                         // 0x0(0x4)(None)
	float                                        TimeBias;                                          // 0x4(0x4)(None)
	TArray<float>                                Values;                                            // 0x8(0x10)(None)
	uint8                                        Op;                                                // 0x18(0x1)(None)
	uint8                                        EntryCount;                                        // 0x19(0x1)(None)
	uint8                                        EntryStride;                                       // 0x1A(0x1)(None)
	uint8                                        SubEntryStride;                                    // 0x1B(0x1)(None)
	uint8                                        LockFlag;                                          // 0x1C(0x1)(None)
	uint8                                        Pad_38F6[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x28 - 0x0)
// ScriptStruct Engine.ExpressionInput
struct FExpressionInput
{
public:
	class UMaterialExpression*                   Expression;                                        // 0x0(0x8)(None)
	int32                                        OutputIndex;                                       // 0x8(0x4)(None)
	class FName                                  InputName;                                         // 0xC(0x8)(None)
	int32                                        Mask;                                              // 0x14(0x4)(None)
	int32                                        MaskR;                                             // 0x18(0x4)(None)
	int32                                        MaskG;                                             // 0x1C(0x4)(None)
	int32                                        MaskB;                                             // 0x20(0x4)(None)
	int32                                        MaskA;                                             // 0x24(0x4)(None)
};

// 0x1C (0x1C - 0x0)
// ScriptStruct Engine.ExpressionOutput
struct FExpressionOutput
{
public:
	class FName                                  OutputName;                                        // 0x0(0x8)(None)
	int32                                        Mask;                                              // 0x8(0x4)(None)
	int32                                        MaskR;                                             // 0xC(0x4)(None)
	int32                                        MaskG;                                             // 0x10(0x4)(None)
	int32                                        MaskB;                                             // 0x14(0x4)(None)
	int32                                        MaskA;                                             // 0x18(0x4)(None)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Engine.FloatDistribution
struct FFloatDistribution
{
public:
	struct FDistributionLookupTable              Table;                                             // 0x0(0x20)(None)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Engine.FloatRK4SpringInterpolator
struct FFloatRK4SpringInterpolator
{
public:
	float                                        StiffnessConstant;                                 // 0x0(0x4)(None)
	float                                        DampeningRatio;                                    // 0x4(0x4)(None)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct Engine.FormatArgumentData
struct FFormatArgumentData
{
public:
	class FString                                ArgumentName;                                      // 0x0(0x10)(SimpleDisplay, BlueprintCallable, BlueprintAuthorityOnly, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	enum class EFormatArgumentType               ArgumentValueType;                                 // 0x10(0x1)(None)
	uint8                                        Pad_38F7[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ArgumentValue;                                     // 0x18(0x18)(None)
	int64                                        ArgumentValueInt;                                  // 0x30(0x8)(None)
	float                                        ArgumentValueFloat;                                // 0x38(0x4)(None)
	uint8                                        Pad_38F8[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       ArgumentValueDouble;                               // 0x40(0x8)(None)
	enum class ETextGender                       ArgumentValueGender;                               // 0x48(0x1)(None)
	uint8                                        Pad_38F9[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x30 - 0x28)
// ScriptStruct Engine.MaterialAttributesInput
struct FMaterialAttributesInput : public FExpressionInput
{
public:
	int64                                        PropertyConnectedBitmask;                          // 0x28(0x8)(None)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Engine.RawDistribution
struct FRawDistribution
{
public:
	struct FDistributionLookupTable              Table;                                             // 0x0(0x20)(None)
};

// 0x8 (0x30 - 0x28)
// ScriptStruct Engine.ScalarMaterialInput
struct FScalarMaterialInput : public FMaterialInput
{
public:
	uint8                                        UseConstant : 1;                                   // Mask: 0x1, PropSize: 0x10x28(0x1)(None)
	uint8                                        BitPad_306 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_38FA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Constant;                                          // 0x2C(0x4)(None)
};

// 0x0 (0x28 - 0x28)
// ScriptStruct Engine.ShadingModelMaterialInput
struct FShadingModelMaterialInput : public FMaterialInput
{
public:
};

// 0x0 (0x28 - 0x28)
// ScriptStruct Engine.StrataMaterialInput
struct FStrataMaterialInput : public FMaterialInput
{
public:
};

// 0x10 (0x38 - 0x28)
// ScriptStruct Engine.Vector2MaterialInput
struct FVector2MaterialInput : public FMaterialInput
{
public:
	uint8                                        UseConstant : 1;                                   // Mask: 0x1, PropSize: 0x10x28(0x1)(None)
	uint8                                        BitPad_307 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_38FB[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ConstantX;                                         // 0x2C(0x4)(None)
	float                                        ConstantY;                                         // 0x30(0x4)(None)
	uint8                                        Pad_38FC[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Engine.Vector4Distribution
struct FVector4Distribution
{
public:
	struct FDistributionLookupTable              Table;                                             // 0x0(0x20)(None)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Engine.VectorDistribution
struct FVectorDistribution
{
public:
	struct FDistributionLookupTable              Table;                                             // 0x0(0x20)(None)
};

// 0x10 (0x38 - 0x28)
// ScriptStruct Engine.VectorMaterialInput
struct FVectorMaterialInput : public FMaterialInput
{
public:
	uint8                                        UseConstant : 1;                                   // Mask: 0x1, PropSize: 0x10x28(0x1)(None)
	uint8                                        BitPad_308 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_38FE[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector3f                             Constant;                                          // 0x2C(0xC)(None)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Engine.VectorRK4SpringInterpolator
struct FVectorRK4SpringInterpolator
{
public:
	float                                        StiffnessConstant;                                 // 0x0(0x4)(None)
	float                                        DampeningRatio;                                    // 0x4(0x4)(None)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Engine.AnimDataModelNotifPayload
struct FAnimDataModelNotifPayload
{
public:
	uint8                                        Pad_38FF[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Engine.Vector_NetQuantize
struct FVector_NetQuantize : public FVector
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Engine.Vector_NetQuantizeNormal
struct FVector_NetQuantizeNormal : public FVector
{
public:
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Engine.ActorInstanceHandle
struct FActorInstanceHandle
{
public:
	TWeakObjectPtr<class AActor>                 Actor;                                             // 0x0(0x8)(None)
	uint8                                        Pad_3900[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xF0 (0xF0 - 0x0)
// ScriptStruct Engine.HitResult
struct FHitResult
{
public:
	int32                                        FaceIndex;                                         // 0x0(0x4)(None)
	float                                        Time;                                              // 0x4(0x4)(None)
	float                                        Distance;                                          // 0x8(0x4)(None)
	uint8                                        Pad_3901[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector_NetQuantize                   Location;                                          // 0x10(0x18)(None)
	struct FVector_NetQuantize                   ImpactPoint;                                       // 0x28(0x18)(None)
	struct FVector_NetQuantizeNormal             Normal;                                            // 0x40(0x18)(None)
	struct FVector_NetQuantizeNormal             ImpactNormal;                                      // 0x58(0x18)(None)
	struct FVector_NetQuantize                   TraceStart;                                        // 0x70(0x18)(None)
	struct FVector_NetQuantize                   TraceEnd;                                          // 0x88(0x18)(None)
	float                                        PenetrationDepth;                                  // 0xA0(0x4)(None)
	int32                                        MyItem;                                            // 0xA4(0x4)(None)
	int32                                        Item;                                              // 0xA8(0x4)(None)
	uint8                                        ElementIndex;                                      // 0xAC(0x1)(None)
	uint8                                        bBlockingHit : 1;                                  // Mask: 0x1, PropSize: 0x10xAD(0x1)(None)
	uint8                                        bStartPenetrating : 1;                             // Mask: 0x2, PropSize: 0x10xAD(0x1)(None)
	uint8                                        BitPad_309 : 6;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_3903[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TWeakObjectPtr<class UPhysicalMaterial>      PhysMaterial;                                      // 0xB4(0x8)(ZeroConstructor)
	struct FActorInstanceHandle                  HitObjectHandle;                                   // 0xBC(0x18)(ZeroConstructor)
	TWeakObjectPtr<class UPrimitiveComponent>    Component;                                         // 0xD4(0x8)(None)
	class FName                                  BoneName;                                          // 0xDC(0x8)(None)
	class FName                                  MyBoneName;                                        // 0xE4(0x8)(None)
	uint8                                        Pad_3904[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Engine.SubtitleCue
struct FSubtitleCue
{
public:
	class FText                                  Text;                                              // 0x0(0x18)(None)
	float                                        Time;                                              // 0x18(0x4)(None)
	uint8                                        Pad_3905[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x30 - 0x0)
// ScriptStruct Engine.PlatformInterfaceData
struct FPlatformInterfaceData
{
public:
	class FName                                  DataName;                                          // 0x0(0x8)(None)
	enum class EPlatformInterfaceDataType        Type;                                              // 0x8(0x1)(None)
	uint8                                        Pad_3906[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        IntValue;                                          // 0xC(0x4)(None)
	float                                        FloatValue;                                        // 0x10(0x4)(None)
	uint8                                        Pad_3907[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                StringValue;                                       // 0x18(0x10)(None)
	class UObject*                               ObjectValue;                                       // 0x28(0x8)(None)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct Engine.PlatformInterfaceDelegateResult
struct FPlatformInterfaceDelegateResult
{
public:
	bool                                         bSuccessful;                                       // 0x0(0x1)(None)
	uint8                                        Pad_3908[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPlatformInterfaceData                Data;                                              // 0x8(0x30)(None)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Engine.BranchingPointNotifyPayload
struct FBranchingPointNotifyPayload
{
public:
	uint8                                        Pad_390A[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x28 - 0x0)
// ScriptStruct Engine.TickFunction
struct FTickFunction
{
public:
	uint8                                        Pad_390B[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class ETickingGroup                     TickGroup;                                         // 0x8(0x1)(None)
	enum class ETickingGroup                     EndTickGroup;                                      // 0x9(0x1)(None)
	uint8                                        bTickEvenWhenPaused : 1;                           // Mask: 0x1, PropSize: 0x10xA(0x1)(None)
	uint8                                        bCanEverTick : 1;                                  // Mask: 0x2, PropSize: 0x10xA(0x1)(None)
	uint8                                        bStartWithTickEnabled : 1;                         // Mask: 0x4, PropSize: 0x10xA(0x1)(None)
	uint8                                        bAllowTickOnDedicatedServer : 1;                   // Mask: 0x8, PropSize: 0x10xA(0x1)(None)
	uint8                                        BitPad_30A : 4;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_390C[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TickInterval;                                      // 0xC(0x4)(None)
	uint8                                        Pad_390E[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x38 - 0x28)
// ScriptStruct Engine.ActorComponentTickFunction
struct FActorComponentTickFunction : public FTickFunction
{
public:
	uint8                                        Pad_390F[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bSavedComponentTickState : 1;                      // Mask: 0x1, PropSize: 0x10x30(0x1)(None)
	uint8                                        bSavedComponentTickStateValue : 1;                 // Mask: 0x2, PropSize: 0x10x30(0x1)(None)
	uint8                                        Pad_3910[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x28 - 0x0)
// ScriptStruct Engine.InterpControlPoint
struct FInterpControlPoint
{
public:
	struct FVector                               PositionControlPoint;                              // 0x0(0x18)(None)
	bool                                         bPositionIsRelative;                               // 0x18(0x1)(None)
	uint8                                        Pad_3911[0xF];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Engine.DebugFloatHistory
struct FDebugFloatHistory
{
public:
	TArray<float>                                Samples;                                           // 0x0(0x10)(None)
	int32                                        MaxSamples;                                        // 0x10(0x4)(None)
	float                                        MinValue;                                          // 0x14(0x4)(None)
	float                                        MaxValue;                                          // 0x18(0x4)(None)
	bool                                         bAutoAdjustMinMax;                                 // 0x1C(0x1)(None)
	uint8                                        Pad_3913[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Engine.LatentActionInfo
struct FLatentActionInfo
{
public:
	int32                                        Linkage;                                           // 0x0(0x4)(None)
	int32                                        UUID;                                              // 0x4(0x4)(None)
	class FName                                  ExecutionFunction;                                 // 0x8(0x8)(None)
	class UObject*                               CallbackTarget;                                    // 0x10(0x8)(None)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Engine.TimerHandle
struct FTimerHandle
{
public:
	uint64                                       Handle;                                            // 0x0(0x8)(None)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Engine.CollisionProfileName
struct FCollisionProfileName
{
public:
	class FName                                  Name;                                              // 0x0(0x8)(None)
};

// 0x4 (0x4 - 0x0)
// ScriptStruct Engine.GenericStruct
struct FGenericStruct
{
public:
	int32                                        Data;                                              // 0x0(0x4)(None)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Engine.UserActivity
struct FUserActivity
{
public:
	class FString                                ActionName;                                        // 0x0(0x10)(None)
	uint8                                        Pad_3918[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// ScriptStruct Engine.MaterialGPUMessagePrimitiveInfo
struct FMaterialGPUMessagePrimitiveInfo
{
public:
	int32                                        PrimitiveId;                                       // 0x0(0x4)(None)
	int32                                        InstanceId;                                        // 0x4(0x4)(None)
	int32                                        RowIdx;                                            // 0x8(0x4)(None)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Engine.DamageEvent
struct FDamageEvent
{
public:
	uint8                                        Pad_391A[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Impulse;                                           // 0x8(0x4)(None)
	float                                        OriginalDamage;                                    // 0xC(0x4)(None)
	int32                                        InstanceBodyIndex;                                 // 0x10(0x4)(None)
	int32                                        TypeIndex;                                         // 0x14(0x4)(None)
	class UClass*                                DamageTypeClass;                                   // 0x18(0x8)(None)
};

// 0x68 (0x68 - 0x0)
// ScriptStruct Engine.BPNetExecParams
struct FBPNetExecParams
{
public:
	int32                                        IntParam1;                                         // 0x0(0x4)(None)
	int32                                        IntParam2;                                         // 0x4(0x4)(None)
	int32                                        IntParam3;                                         // 0x8(0x4)(None)
	uint8                                        Pad_391C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<int32>                                IntArrayParam1;                                    // 0x10(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, ExposeOnSpawn, NativeAccessSpecifierPrivate)
	float                                        FloatParam1;                                       // 0x20(0x4)(None)
	float                                        FloatParam2;                                       // 0x24(0x4)(None)
	float                                        FloatParam3;                                       // 0x28(0x4)(None)
	uint8                                        Pad_391D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                FloatArrayParam1;                                  // 0x30(0x10)(SimpleDisplay, AdvancedDisplay, Protected, TextExportTransient, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UObject*                               ObjParam1;                                         // 0x40(0x8)(ZeroConstructor)
	class UObject*                               ObjParam2;                                         // 0x48(0x8)(ZeroConstructor)
	class UObject*                               ObjParam3;                                         // 0x50(0x8)(None)
	class FString                                StringParam1;                                      // 0x58(0x10)(None)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Engine.BodyInstanceAsyncPhysicsTickHandle
struct FBodyInstanceAsyncPhysicsTickHandle
{
public:
	uint8                                        Pad_391F[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Engine.CollisionResponseSet
struct FCollisionResponseSet
{
public:
	TArray<enum class ECollisionChannel>         Channels;                                          // 0x0(0x10)(AutoWeak, AssetRegistrySearchable, SimpleDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, NonPIEDuplicateTransient, ExposeOnSpawn, NativeAccessSpecifierPrivate)
	TArray<enum class ECollisionResponse>        Responses;                                         // 0x10(0x10)(None)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Engine.WalkableSlopeOverride
struct FWalkableSlopeOverride
{
public:
	enum class EWalkableSlopeBehavior            WalkableSlopeBehavior;                             // 0x0(0x1)(None)
	uint8                                        Pad_3921[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        WalkableSlopeAngle;                                // 0x4(0x4)(None)
	uint8                                        Pad_3923[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Engine.CollisionResponseContainer
struct FCollisionResponseContainer
{
public:
	enum class ECollisionResponse                WorldStatic;                                       // 0x0(0x1)(None)
	enum class ECollisionResponse                WorldDynamic;                                      // 0x1(0x1)(None)
	enum class ECollisionResponse                Visibility;                                        // 0x2(0x1)(None)
	enum class ECollisionResponse                PhysicsBody;                                       // 0x3(0x1)(None)
	enum class ECollisionResponse                Destructible;                                      // 0x4(0x1)(None)
	enum class ECollisionResponse                GameTraceChannel1;                                 // 0x5(0x1)(None)
	enum class ECollisionResponse                GameTraceChannel2;                                 // 0x6(0x1)(None)
	enum class ECollisionResponse                GameTraceChannel3;                                 // 0x7(0x1)(None)
	enum class ECollisionResponse                GameTraceChannel4;                                 // 0x8(0x1)(None)
	enum class ECollisionResponse                GameTraceChannel5;                                 // 0x9(0x1)(None)
	enum class ECollisionResponse                GameTraceChannel6;                                 // 0xA(0x1)(None)
	enum class ECollisionResponse                GameTraceChannel7;                                 // 0xB(0x1)(None)
	enum class ECollisionResponse                GameTraceChannel8;                                 // 0xC(0x1)(None)
	enum class ECollisionResponse                GameTraceChannel9;                                 // 0xD(0x1)(None)
	enum class ECollisionResponse                GameTraceChannel10;                                // 0xE(0x1)(None)
	enum class ECollisionResponse                GameTraceChannel11;                                // 0xF(0x1)(None)
	enum class ECollisionResponse                GameTraceChannel12;                                // 0x10(0x1)(None)
	enum class ECollisionResponse                GameTraceChannel13;                                // 0x11(0x1)(None)
	enum class ECollisionResponse                GameTraceChannel14;                                // 0x12(0x1)(None)
	enum class ECollisionResponse                GameTraceChannel15;                                // 0x13(0x1)(None)
	enum class ECollisionResponse                GameTraceChannel16;                                // 0x14(0x1)(None)
	enum class ECollisionResponse                GameTraceChannel17;                                // 0x15(0x1)(None)
	enum class ECollisionResponse                GameTraceChannel18;                                // 0x16(0x1)(None)
	enum class ECollisionResponse                GameTraceChannel19;                                // 0x17(0x1)(None)
	enum class ECollisionResponse                GameTraceChannel20;                                // 0x18(0x1)(None)
	enum class ECollisionResponse                GameTraceChannel21;                                // 0x19(0x1)(None)
	enum class ECollisionResponse                GameTraceChannel22;                                // 0x1A(0x1)(None)
	enum class ECollisionResponse                GameTraceChannel23;                                // 0x1B(0x1)(None)
	enum class ECollisionResponse                GameTraceChannel24;                                // 0x1C(0x1)(None)
	enum class ECollisionResponse                GameTraceChannel25;                                // 0x1D(0x1)(None)
	enum class ECollisionResponse                GameTraceChannel26;                                // 0x1E(0x1)(None)
	enum class ECollisionResponse                GameTraceChannel27;                                // 0x1F(0x1)(None)
};

// 0xC (0xC - 0x0)
// ScriptStruct Engine.ResponseChannel
struct FResponseChannel
{
public:
	class FName                                  Channel;                                           // 0x0(0x8)(None)
	enum class ECollisionResponse                Response;                                          // 0x8(0x1)(None)
	uint8                                        Pad_3925[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x30 - 0x0)
// ScriptStruct Engine.CollisionResponse
struct FCollisionResponse
{
public:
	struct FCollisionResponseContainer           ResponseToChannels;                                // 0x0(0x20)(None)
	TArray<struct FResponseChannel>              ResponseArray;                                     // 0x20(0x10)(None)
};

// 0x120 (0x138 - 0x18)
// ScriptStruct Engine.BodyInstance
struct FBodyInstance : public FBodyInstanceCore
{
public:
	uint8                                        Pad_3926[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class ECollisionChannel                 ObjectType;                                        // 0x1E(0x1)(None)
	uint8                                        Pad_3927[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class ECollisionEnabled                 CollisionEnabled;                                  // 0x20(0x1)(None)
	uint8                                        Pad_3928[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class ESleepFamily                      SleepFamily;                                       // 0x22(0x1)(None)
	enum class EDOFMode                          DOFMode;                                           // 0x23(0x1)(None)
	uint8                                        bUseCCD : 1;                                       // Mask: 0x1, PropSize: 0x10x24(0x1)(None)
	uint8                                        bIgnoreAnalyticCollisions : 1;                     // Mask: 0x2, PropSize: 0x10x24(0x1)(None)
	uint8                                        bNotifyRigidBodyCollision : 1;                     // Mask: 0x4, PropSize: 0x10x24(0x1)(None)
	uint8                                        BitPad_30B : 1;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bSmoothEdgeCollisions : 1;                         // Mask: 0x10, PropSize: 0x10x24(0x1)(None)
	uint8                                        BitPad_30C : 1;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bUseSpecificBodyArmorType : 1;                     // Mask: 0x40, PropSize: 0x10x24(0x1)(None)
	uint8                                        bIsShieldHolder : 1;                               // Mask: 0x80, PropSize: 0x10x24(0x1)(None)
	uint8                                        bLockTranslation : 1;                              // Mask: 0x1, PropSize: 0x10x25(0x1)(None)
	uint8                                        bLockRotation : 1;                                 // Mask: 0x2, PropSize: 0x10x25(0x1)(None)
	uint8                                        bLockXTranslation : 1;                             // Mask: 0x4, PropSize: 0x10x25(0x1)(None)
	uint8                                        bLockYTranslation : 1;                             // Mask: 0x8, PropSize: 0x10x25(0x1)(None)
	uint8                                        bLockZTranslation : 1;                             // Mask: 0x10, PropSize: 0x10x25(0x1)(None)
	uint8                                        bLockXRotation : 1;                                // Mask: 0x20, PropSize: 0x10x25(0x1)(None)
	uint8                                        bLockYRotation : 1;                                // Mask: 0x40, PropSize: 0x10x25(0x1)(None)
	uint8                                        bLockZRotation : 1;                                // Mask: 0x80, PropSize: 0x10x25(0x1)(None)
	uint8                                        bOverrideMaxAngularVelocity : 1;                   // Mask: 0x1, PropSize: 0x10x26(0x1)(None)
	uint8                                        BitPad_30D : 2;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bOverrideMaxDepenetrationVelocity : 1;             // Mask: 0x8, PropSize: 0x10x26(0x1)(None)
	uint8                                        bOverrideWalkableSlopeOnInstance : 1;              // Mask: 0x10, PropSize: 0x10x26(0x1)(None)
	uint8                                        bInterpolateWhenSubStepping : 1;                   // Mask: 0x20, PropSize: 0x10x26(0x1)(None)
	uint8                                        BitPad_30E : 1;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bInertiaConditioning : 1;                          // Mask: 0x80, PropSize: 0x10x26(0x1)(None)
	uint8                                        Pad_392B[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               Scale3D;                                           // 0x28(0x18)(None)
	class FName                                  CollisionProfileName;                              // 0x40(0x8)(None)
	uint8                                        PositionSolverIterationCount;                      // 0x48(0x1)(None)
	uint8                                        VelocitySolverIterationCount;                      // 0x49(0x1)(None)
	uint8                                        Pad_392C[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCollisionResponse                    CollisionResponses;                                // 0x50(0x30)(None)
	float                                        MaxDepenetrationVelocity;                          // 0x80(0x4)(None)
	float                                        MassInKgOverride;                                  // 0x84(0x4)(None)
	uint8                                        Pad_392D[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LinearDamping;                                     // 0x90(0x4)(None)
	float                                        AngularDamping;                                    // 0x94(0x4)(None)
	struct FVector                               CustomDOFPlaneNormal;                              // 0x98(0x18)(None)
	struct FVector                               COMNudge;                                          // 0xB0(0x18)(None)
	float                                        MassScale;                                         // 0xC8(0x4)(None)
	uint8                                        Pad_392E[0x14];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FWalkableSlopeOverride                WalkableSlopeOverride;                             // 0xE0(0x10)(None)
	class UPhysicalMaterial*                     PhysMaterialOverride;                              // 0xF0(0x8)(None)
	float                                        MaxAngularVelocity;                                // 0xF8(0x4)(None)
	float                                        PhysicsBlendWeight;                                // 0xFC(0x4)(None)
	uint8                                        Pad_392F[0x30];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EPrimalEquipmentType              BodyArmorType;                                     // 0x130(0x1)(None)
	uint8                                        Pad_3930[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Engine.CustomPrimitiveData
struct FCustomPrimitiveData
{
public:
	TArray<float>                                Data;                                              // 0x0(0x10)(None)
};

// 0x1 (0x1 - 0x0)
// ScriptStruct Engine.LightingChannels
struct FLightingChannels
{
public:
	uint8                                        bChannel0 : 1;                                     // Mask: 0x1, PropSize: 0x10x0(0x1)(None)
	uint8                                        bChannel1 : 1;                                     // Mask: 0x2, PropSize: 0x10x0(0x1)(None)
	uint8                                        bChannel2 : 1;                                     // Mask: 0x4, PropSize: 0x10x0(0x1)(None)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Engine.BoneReference
struct FBoneReference
{
public:
	class FName                                  BoneName;                                          // 0x0(0x8)(None)
	uint8                                        Pad_397E[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Engine.AnimNode_Base
struct FAnimNode_Base
{
public:
	uint8                                        Pad_397F[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Engine.InputRange
struct FInputRange
{
public:
	float                                        Min;                                               // 0x0(0x4)(None)
	float                                        Max;                                               // 0x4(0x4)(None)
};

// 0x30 (0x30 - 0x0)
// ScriptStruct Engine.InputScaleBiasClamp
struct FInputScaleBiasClamp
{
public:
	bool                                         bMapRange;                                         // 0x0(0x1)(None)
	bool                                         bClampResult;                                      // 0x1(0x1)(None)
	bool                                         bInterpResult;                                     // 0x2(0x1)(None)
	uint8                                        Pad_3980[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FInputRange                           InRange;                                           // 0x4(0x8)(None)
	struct FInputRange                           OutRange;                                          // 0xC(0x8)(None)
	float                                        Scale;                                             // 0x14(0x4)(None)
	float                                        Bias;                                              // 0x18(0x4)(None)
	float                                        ClampMin;                                          // 0x1C(0x4)(None)
	float                                        ClampMax;                                          // 0x20(0x4)(None)
	float                                        InterpSpeedIncreasing;                             // 0x24(0x4)(None)
	float                                        InterpSpeedDecreasing;                             // 0x28(0x4)(None)
	uint8                                        Pad_3981[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x30 - 0x0)
// ScriptStruct Engine.AlphaBlend
struct FAlphaBlend
{
public:
	class UCurveFloat*                           CustomCurve;                                       // 0x0(0x8)(None)
	float                                        BlendTime;                                         // 0x8(0x4)(None)
	uint8                                        Pad_3982[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EAlphaBlendOption                 BlendOption;                                       // 0x24(0x1)(None)
	uint8                                        Pad_3983[0xB];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x48 (0x48 - 0x0)
// ScriptStruct Engine.InputAlphaBoolBlend
struct FInputAlphaBoolBlend
{
public:
	float                                        BlendInTime;                                       // 0x0(0x4)(None)
	float                                        BlendOutTime;                                      // 0x4(0x4)(None)
	enum class EAlphaBlendOption                 BlendOption;                                       // 0x8(0x1)(None)
	bool                                         bInitialized;                                      // 0x9(0x1)(None)
	uint8                                        Pad_3984[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCurveFloat*                           CustomCurve;                                       // 0x10(0x8)(ZeroConstructor)
	struct FAlphaBlend                           AlphaBlend;                                        // 0x18(0x30)(None)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Engine.InputScaleBias
struct FInputScaleBias
{
public:
	float                                        Scale;                                             // 0x0(0x4)(None)
	float                                        Bias;                                              // 0x4(0x4)(None)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Engine.PoseLinkBase
struct FPoseLinkBase
{
public:
	uint8                                        Pad_3985[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        LinkID;                                            // 0x8(0x4)(None)
	uint8                                        Pad_3986[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Engine.ComponentSpacePoseLink
struct FComponentSpacePoseLink : public FPoseLinkBase
{
public:
};

// 0x14 (0x14 - 0x0)
// ScriptStruct Engine.InputClampConstants
struct FInputClampConstants
{
public:
	bool                                         bClampResult;                                      // 0x0(0x1)(None)
	bool                                         bInterpResult;                                     // 0x1(0x1)(None)
	uint8                                        Pad_3987[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ClampMin;                                          // 0x4(0x4)(None)
	float                                        ClampMax;                                          // 0x8(0x4)(None)
	float                                        InterpSpeedIncreasing;                             // 0xC(0x4)(None)
	float                                        InterpSpeedDecreasing;                             // 0x10(0x4)(None)
};

// 0x88 (0x88 - 0x0)
// ScriptStruct Engine.KeyHandleLookupTable
struct FKeyHandleLookupTable
{
public:
	uint8                                        Pad_3988[0x88];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x2F (0x30 - 0x1)
// ScriptStruct Engine.UniqueNetIdRepl
struct FUniqueNetIdRepl : public FUniqueNetIdWrapper
{
public:
	uint8                                        Pad_3989[0x1F];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<uint8>                                ReplicationBytes;                                  // 0x20(0x10)(None)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Engine.MeshDisplacementMap
struct FMeshDisplacementMap
{
public:
	class UTexture2D*                            Texture;                                           // 0x0(0x8)(None)
	float                                        Magnitude;                                         // 0x8(0x4)(None)
	float                                        Center;                                            // 0xC(0x4)(None)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct Engine.MeshNaniteSettings
struct FMeshNaniteSettings
{
public:
	uint8                                        bEnabled : 1;                                      // Mask: 0x1, PropSize: 0x10x0(0x1)(None)
	uint8                                        bPreserveArea : 1;                                 // Mask: 0x2, PropSize: 0x10x0(0x1)(None)
	uint8                                        BitPad_315 : 6;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_398A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        PositionPrecision;                                 // 0x4(0x4)(None)
	int32                                        NormalPrecision;                                   // 0x8(0x4)(None)
	uint32                                       TargetMinimumResidencyInKB;                        // 0xC(0x4)(None)
	float                                        KeepPercentTriangles;                              // 0x10(0x4)(None)
	float                                        TrimRelativeError;                                 // 0x14(0x4)(None)
	float                                        FallbackPercentTriangles;                          // 0x18(0x4)(None)
	float                                        FallbackRelativeError;                             // 0x1C(0x4)(None)
	int32                                        DisplacementUVChannel;                             // 0x20(0x4)(None)
	uint8                                        Pad_398B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FMeshDisplacementMap>          DisplacementMaps;                                  // 0x28(0x10)(None)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Engine.DataCacheDuplicatedObjectData
struct FDataCacheDuplicatedObjectData
{
public:
	uint8                                        Pad_398C[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x58 (0x58 - 0x0)
// ScriptStruct Engine.InstanceCacheDataBase
struct FInstanceCacheDataBase
{
public:
	uint8                                        Pad_398D[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<uint8>                                SavedProperties;                                   // 0x8(0x10)(AutoWeak, AssetRegistrySearchable, SimpleDisplay, TextExportTransient, NonPIEDuplicateTransient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FDataCacheDuplicatedObjectData        UniqueTransientPackage;                            // 0x18(0x10)(None)
	TArray<struct FDataCacheDuplicatedObjectData> DuplicatedObjects;                                 // 0x28(0x10)(AdvancedDisplay, TextExportTransient, NonPIEDuplicateTransient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<class UObject*>                       ReferencedObjects;                                 // 0x38(0x10)(ContainsInstancedReference, AdvancedDisplay, TextExportTransient, NonPIEDuplicateTransient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<class FName>                          ReferencedNames;                                   // 0x48(0x10)(None)
};

// 0x10 (0x68 - 0x58)
// ScriptStruct Engine.ActorComponentInstanceData
struct FActorComponentInstanceData : public FInstanceCacheDataBase
{
public:
	class UObject*                               SourceComponentTemplate;                           // 0x58(0x8)(ZeroConstructor)
	enum class EComponentCreationMethod          SourceComponentCreationMethod;                     // 0x60(0x1)(None)
	uint8                                        Pad_398E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SourceComponentTypeSerializedIndex;                // 0x64(0x4)(None)
};

// 0xC (0xC - 0x0)
// ScriptStruct Engine.BranchFilter
struct FBranchFilter
{
public:
	class FName                                  BoneName;                                          // 0x0(0x8)(None)
	int32                                        BlendDepth;                                        // 0x8(0x4)(None)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Engine.InputBlendPose
struct FInputBlendPose
{
public:
	TArray<struct FBranchFilter>                 BranchFilters;                                     // 0x0(0x10)(None)
};

// 0x48 (0x58 - 0x10)
// ScriptStruct Engine.AnimNode_CustomProperty
struct FAnimNode_CustomProperty : public FAnimNode_Base
{
public:
	TArray<class FName>                          SourcePropertyNames;                               // 0x10(0x10)(SimpleDisplay, AdvancedDisplay, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<class FName>                          DestPropertyNames;                                 // 0x20(0x10)(None)
	class UObject*                               TargetInstance;                                    // 0x30(0x8)(None)
	uint8                                        Pad_398F[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Engine.PoseLink
struct FPoseLink : public FPoseLinkBase
{
public:
};

// 0x878 (0x878 - 0x0)
// ScriptStruct Engine.AnimInstanceProxy
struct FAnimInstanceProxy
{
public:
	uint8                                        Pad_3990[0x878];                                   // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Engine.BaseComponentReference
struct FBaseComponentReference
{
public:
	class FName                                  ComponentProperty;                                 // 0x0(0x8)(None)
	class FString                                PathToComponent;                                   // 0x8(0x10)(None)
	TWeakObjectPtr<class UActorComponent>        OverrideComponent;                                 // 0x18(0x8)(None)
};

// 0x8 (0x28 - 0x20)
// ScriptStruct Engine.ComponentReference
struct FComponentReference : public FBaseComponentReference
{
public:
	TWeakObjectPtr<class AActor>                 OtherActor;                                        // 0x20(0x8)(ZeroConstructor)
};

// 0x60 (0x60 - 0x0)
// ScriptStruct Engine.KeyHandleMap
struct FKeyHandleMap
{
public:
	uint8                                        Pad_3991[0x60];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x68 (0x68 - 0x0)
// ScriptStruct Engine.IndexedCurve
struct FIndexedCurve
{
public:
	uint8                                        Pad_3992[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FKeyHandleMap                         KeyHandlesToIndices;                               // 0x8(0x60)(None)
};

// 0x8 (0x70 - 0x68)
// ScriptStruct Engine.RealCurve
struct FRealCurve : public FIndexedCurve
{
public:
	float                                        DefaultValue;                                      // 0x68(0x4)(None)
	enum class ERichCurveExtrapolation           PreInfinityExtrap;                                 // 0x6C(0x1)(None)
	enum class ERichCurveExtrapolation           PostInfinityExtrap;                                // 0x6D(0x1)(None)
	uint8                                        Pad_3993[0x2];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1C (0x1C - 0x0)
// ScriptStruct Engine.RichCurveKey
struct FRichCurveKey
{
public:
	enum class ERichCurveInterpMode              InterpMode;                                        // 0x0(0x1)(None)
	enum class ERichCurveTangentMode             TangentMode;                                       // 0x1(0x1)(None)
	enum class ERichCurveTangentWeightMode       TangentWeightMode;                                 // 0x2(0x1)(None)
	uint8                                        Pad_3994[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Time;                                              // 0x4(0x4)(None)
	float                                        Value;                                             // 0x8(0x4)(None)
	float                                        ArriveTangent;                                     // 0xC(0x4)(None)
	float                                        ArriveTangentWeight;                               // 0x10(0x4)(None)
	float                                        LeaveTangent;                                      // 0x14(0x4)(None)
	float                                        LeaveTangentWeight;                                // 0x18(0x4)(None)
};

// 0x10 (0x80 - 0x70)
// ScriptStruct Engine.RichCurve
struct FRichCurve : public FRealCurve
{
public:
	TArray<struct FRichCurveKey>                 Keys;                                              // 0x70(0x10)(ContainsInstancedReference, AssetRegistrySearchable, BlueprintCallable, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
};

// 0x88 (0x88 - 0x0)
// ScriptStruct Engine.RuntimeFloatCurve
struct FRuntimeFloatCurve
{
public:
	struct FRichCurve                            EditorCurveData;                                   // 0x0(0x80)(None)
	class UCurveFloat*                           ExternalCurve;                                     // 0x80(0x8)(None)
};

// 0xC (0xC - 0x0)
// ScriptStruct Engine.FloatSpringState
struct FFloatSpringState
{
public:
	uint8                                        Pad_3995[0xC];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x38 (0x38 - 0x0)
// ScriptStruct Engine.VectorSpringState
struct FVectorSpringState
{
public:
	uint8                                        Pad_3996[0x38];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x40 (0x40 - 0x0)
// ScriptStruct Engine.QuaternionSpringState
struct FQuaternionSpringState
{
public:
	uint8                                        Pad_3997[0x40];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x70 (0x70 - 0x0)
// ScriptStruct Engine.SplineCurves
struct FSplineCurves
{
public:
	struct FInterpCurveVector                    Position;                                          // 0x0(0x18)(AssetRegistrySearchable, AdvancedDisplay, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	struct FInterpCurveQuat                      Rotation;                                          // 0x18(0x18)(ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	struct FInterpCurveVector                    Scale;                                             // 0x30(0x18)(SimpleDisplay, AdvancedDisplay, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	struct FInterpCurveFloat                     ReparamTable;                                      // 0x48(0x18)(None)
	class USplineMetadata*                       MetaData;                                          // 0x60(0x8)(None)
	uint32                                       Version;                                           // 0x68(0x4)(None)
	uint8                                        Pad_3998[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x180 (0x180 - 0x0)
// ScriptStruct Engine.ISMComponentDescriptorBase
struct FISMComponentDescriptorBase
{
public:
	uint32                                       Hash;                                              // 0x0(0x4)(None)
	uint8                                        Pad_3999[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                ComponentClass;                                    // 0x8(0x8)(ZeroConstructor)
	enum class EComponentMobility                Mobility;                                          // 0x10(0x1)(None)
	enum class ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType;                      // 0x11(0x1)(None)
	enum class ELightmapType                     LightmapType;                                      // 0x12(0x1)(None)
	struct FLightingChannels                     LightingChannels;                                  // 0x13(0x1)(None)
	int32                                        RayTracingGroupId;                                 // 0x14(0x4)(None)
	enum class ERayTracingGroupCullingPriority   RayTracingGroupCullingPriority;                    // 0x18(0x1)(None)
	enum class EHasCustomNavigableGeometry       bHasCustomNavigableGeometry;                       // 0x19(0x1)(None)
	enum class ERendererStencilMask              CustomDepthStencilWriteMask;                       // 0x1A(0x1)(None)
	uint8                                        Pad_399A[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBodyInstance                         BodyInstance;                                      // 0x20(0x138)(None)
	int32                                        InstanceStartCullDistance;                         // 0x158(0x4)(None)
	int32                                        InstanceEndCullDistance;                           // 0x15C(0x4)(None)
	int32                                        VirtualTextureCullMips;                            // 0x160(0x4)(None)
	int32                                        TranslucencySortPriority;                          // 0x164(0x4)(None)
	int32                                        OverriddenLightMapRes;                             // 0x168(0x4)(None)
	int32                                        CustomDepthStencilValue;                           // 0x16C(0x4)(None)
	uint8                                        bCastShadow : 1;                                   // Mask: 0x1, PropSize: 0x10x170(0x1)(None)
	uint8                                        bCastDynamicShadow : 1;                            // Mask: 0x2, PropSize: 0x10x170(0x1)(None)
	uint8                                        bCastStaticShadow : 1;                             // Mask: 0x4, PropSize: 0x10x170(0x1)(None)
	uint8                                        bCastContactShadow : 1;                            // Mask: 0x8, PropSize: 0x10x170(0x1)(None)
	uint8                                        bCastShadowAsTwoSided : 1;                         // Mask: 0x10, PropSize: 0x10x170(0x1)(None)
	uint8                                        bAffectDynamicIndirectLighting : 1;                // Mask: 0x20, PropSize: 0x10x170(0x1)(None)
	uint8                                        bAffectDistanceFieldLighting : 1;                  // Mask: 0x40, PropSize: 0x10x170(0x1)(None)
	uint8                                        bReceivesDecals : 1;                               // Mask: 0x80, PropSize: 0x10x170(0x1)(None)
	uint8                                        bOverrideLightMapRes : 1;                          // Mask: 0x1, PropSize: 0x10x171(0x1)(None)
	uint8                                        bUseAsOccluder : 1;                                // Mask: 0x2, PropSize: 0x10x171(0x1)(None)
	uint8                                        bEnableDensityScaling : 1;                         // Mask: 0x4, PropSize: 0x10x171(0x1)(None)
	uint8                                        bEnableDiscardOnLoad : 1;                          // Mask: 0x8, PropSize: 0x10x171(0x1)(None)
	uint8                                        bRenderCustomDepth : 1;                            // Mask: 0x10, PropSize: 0x10x171(0x1)(None)
	uint8                                        bVisibleInRayTracing : 1;                          // Mask: 0x20, PropSize: 0x10x171(0x1)(None)
	uint8                                        bHiddenInGame : 1;                                 // Mask: 0x40, PropSize: 0x10x171(0x1)(None)
	uint8                                        bIsEditorOnly : 1;                                 // Mask: 0x80, PropSize: 0x10x171(0x1)(None)
	uint8                                        bVisible : 1;                                      // Mask: 0x1, PropSize: 0x10x172(0x1)(None)
	uint8                                        bEvaluateWorldPositionOffset : 1;                  // Mask: 0x2, PropSize: 0x10x172(0x1)(None)
	uint8                                        bReverseCulling : 1;                               // Mask: 0x4, PropSize: 0x10x172(0x1)(None)
	uint8                                        bUseDefaultCollision : 1;                          // Mask: 0x8, PropSize: 0x10x172(0x1)(None)
	uint8                                        bGenerateOverlapEvents : 1;                        // Mask: 0x10, PropSize: 0x10x172(0x1)(None)
	uint8                                        BitPad_316 : 3;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_399B[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        WorldPositionOffsetDisableDistance;                // 0x174(0x4)(None)
	enum class EShadowCacheInvalidationBehavior  ShadowCacheInvalidationBehavior;                   // 0x178(0x1)(None)
	uint8                                        Pad_399C[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x50 (0x1D0 - 0x180)
// ScriptStruct Engine.SoftISMComponentDescriptor
struct FSoftISMComponentDescriptor : public FISMComponentDescriptorBase
{
public:
	TSoftObjectPtr<class UStaticMesh>            StaticMesh;                                        // 0x180(0x30)(ZeroConstructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, BlueprintCallable, ExposeOnSpawn, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	TArray<TSoftObjectPtr<class UMaterialInterface>> OverrideMaterials;                                 // 0x1B0(0x10)(ZeroConstructor, AutoWeak, AdvancedDisplay, BlueprintCallable, ExposeOnSpawn, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	TArray<TSoftObjectPtr<class URuntimeVirtualTexture>> RuntimeVirtualTextures;                            // 0x1C0(0x10)(ZeroConstructor, ContainsInstancedReference, SimpleDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
};

// 0x30 (0x30 - 0x0)
// ScriptStruct Engine.KShapeElem
struct FKShapeElem
{
public:
	uint8                                        Pad_399D[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RestOffset;                                        // 0x8(0x4)(None)
	class FName                                  Name;                                              // 0xC(0x8)(None)
	uint8                                        Pad_399E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bContributeToMass : 1;                             // Mask: 0x1, PropSize: 0x10x18(0x1)(None)
	uint8                                        BitPad_317 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	enum class ECollisionEnabled                 CollisionEnabled;                                  // 0x19(0x1)(None)
	uint8                                        Pad_399F[0x16];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Engine.TableRowBase
struct FTableRowBase
{
public:
	uint8                                        Pad_39A0[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x60 (0x60 - 0x0)
// ScriptStruct Engine.SoundModulationDestinationSettings
struct FSoundModulationDestinationSettings
{
public:
	float                                        Value;                                             // 0x0(0x4)(None)
	uint8                                        Pad_39A1[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USoundModulatorBase*                   Modulator;                                         // 0x8(0x8)(ZeroConstructor)
	TSet<class USoundModulatorBase*>             Modulators;                                        // 0x10(0x50)(None)
};

// 0x4 (0x4 - 0x0)
// ScriptStruct Engine.PerPlatformInt
struct FPerPlatformInt
{
public:
	int32                                        Default;                                           // 0x0(0x4)(None)
};

// 0x68 (0x68 - 0x0)
// ScriptStruct Engine.PerQualityLevelInt
struct FPerQualityLevelInt
{
public:
	uint8                                        Pad_39A2[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Default;                                           // 0x10(0x4)(None)
	uint8                                        Pad_39A3[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<int32, int32>                           PerQuality;                                        // 0x18(0x50)(None)
};

// 0x68 (0x68 - 0x0)
// ScriptStruct Engine.PerQualityLevelFloat
struct FPerQualityLevelFloat
{
public:
	uint8                                        Pad_39A4[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Default;                                           // 0x10(0x4)(None)
	uint8                                        Pad_39A5[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<int32, float>                           PerQuality;                                        // 0x18(0x50)(None)
};

// 0x4 (0x4 - 0x0)
// ScriptStruct Engine.PerPlatformFloat
struct FPerPlatformFloat
{
public:
	float                                        Default;                                           // 0x0(0x4)(None)
};

// 0x10 (0x20 - 0x10)
// ScriptStruct Engine.AnimNode_Root
struct FAnimNode_Root : public FAnimNode_Base
{
public:
	struct FPoseLink                             Result;                                            // 0x10(0x10)(None)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Engine.AnimNodeReference
struct FAnimNodeReference
{
public:
	uint8                                        Pad_39A6[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Engine.AnimNode_AssetPlayerRelevancyBase
struct FAnimNode_AssetPlayerRelevancyBase : public FAnimNode_Base
{
public:
};

// 0x28 (0x38 - 0x10)
// ScriptStruct Engine.AnimNode_AssetPlayerBase
struct FAnimNode_AssetPlayerBase : public FAnimNode_AssetPlayerRelevancyBase
{
public:
	uint8                                        Pad_39A7[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BlendWeight;                                       // 0x20(0x4)(None)
	float                                        InternalTimeAccumulator;                           // 0x24(0x4)(None)
	uint8                                        Pad_39A8[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Engine.PerBoneBlendWeight
struct FPerBoneBlendWeight
{
public:
	int32                                        SourceIndex;                                       // 0x0(0x4)(None)
	float                                        BlendWeight;                                       // 0x4(0x4)(None)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct Engine.PoseSnapshot
struct FPoseSnapshot
{
public:
	TArray<struct FTransform>                    LocalTransforms;                                   // 0x0(0x10)(AutoWeak, SimpleDisplay, AdvancedDisplay, TextExportTransient, PersistentInstance, UObjectWrapper)
	TArray<class FName>                          BoneNames;                                         // 0x10(0x10)(None)
	class FName                                  SkeletalMeshName;                                  // 0x20(0x8)(None)
	class FName                                  SnapshotName;                                      // 0x28(0x8)(None)
	bool                                         bIsValid;                                          // 0x30(0x1)(None)
	uint8                                        Pad_39A9[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x70 (0x70 - 0x0)
// ScriptStruct Engine.SocketReference
struct FSocketReference
{
public:
	uint8                                        Pad_39AA[0x60];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  SocketName;                                        // 0x60(0x8)(None)
	uint8                                        Pad_39AB[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x90 (0x90 - 0x0)
// ScriptStruct Engine.BoneSocketTarget
struct FBoneSocketTarget
{
public:
	bool                                         bUseSocket;                                        // 0x0(0x1)(None)
	uint8                                        Pad_39AC[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBoneReference                        BoneReference;                                     // 0x4(0x10)(None)
	uint8                                        Pad_39AD[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSocketReference                      SocketReference;                                   // 0x20(0x70)(None)
};

// 0xC (0xC - 0x0)
// ScriptStruct Engine.AnimCurveParam
struct FAnimCurveParam
{
public:
	class FName                                  Name;                                              // 0x0(0x8)(None)
	uint8                                        Pad_39AE[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x50 (0xB8 - 0x68)
// ScriptStruct Engine.SceneComponentInstanceData
struct FSceneComponentInstanceData : public FActorComponentInstanceData
{
public:
	TMap<class USceneComponent*, struct FTransform> AttachedInstanceComponents;                        // 0x68(0x50)(ZeroConstructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, TextExportTransient, NonPIEDuplicateTransient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
};

// 0x28 (0x28 - 0x0)
// ScriptStruct Engine.BPMapCheckEntry
struct FBPMapCheckEntry
{
public:
	enum class EBPMapCheckSeverity               Severity;                                          // 0x0(0x1)(None)
	uint8                                        Pad_39AF[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Message;                                           // 0x8(0x10)(SimpleDisplay, AdvancedDisplay, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper)
	TArray<class AActor*>                        ActorLinks;                                        // 0x18(0x10)(None)
};

// 0x78 (0x78 - 0x0)
// ScriptStruct Engine.MultiUseEntry
struct FMultiUseEntry
{
public:
	class UActorComponent*                       ForComponent;                                      // 0x0(0x8)(ZeroConstructor)
	class FString                                UseString;                                         // 0x8(0x10)(None)
	int32                                        UseIndex;                                          // 0x18(0x4)(None)
	int32                                        Priority;                                          // 0x1C(0x4)(None)
	uint8                                        bHideFromUI : 1;                                   // Mask: 0x1, PropSize: 0x10x20(0x1)(None)
	uint8                                        bDisableUse : 1;                                   // Mask: 0x2, PropSize: 0x10x20(0x1)(None)
	uint8                                        bHideActivationKey : 1;                            // Mask: 0x4, PropSize: 0x10x20(0x1)(None)
	uint8                                        bRepeatMultiUse : 1;                               // Mask: 0x8, PropSize: 0x10x20(0x1)(None)
	uint8                                        bDisplayOnInventoryUI : 1;                         // Mask: 0x10, PropSize: 0x10x20(0x1)(None)
	uint8                                        bDisplayOnInventoryUISecondary : 1;                // Mask: 0x20, PropSize: 0x10x20(0x1)(None)
	uint8                                        bHarvestable : 1;                                  // Mask: 0x40, PropSize: 0x10x20(0x1)(None)
	uint8                                        bIsSecondaryUse : 1;                               // Mask: 0x80, PropSize: 0x10x20(0x1)(None)
	uint8                                        bPersistWheelOnActivation : 1;                     // Mask: 0x1, PropSize: 0x10x21(0x1)(None)
	uint8                                        bOverrideUseTextColor : 1;                         // Mask: 0x2, PropSize: 0x10x21(0x1)(None)
	uint8                                        bDisplayOnInventoryUITertiary : 1;                 // Mask: 0x4, PropSize: 0x10x21(0x1)(None)
	uint8                                        bClientSideOnly : 1;                               // Mask: 0x8, PropSize: 0x10x21(0x1)(None)
	uint8                                        bPersistWheelRequiresDirectActivation : 1;         // Mask: 0x10, PropSize: 0x10x21(0x1)(None)
	uint8                                        bUseBPDrawEntry : 1;                               // Mask: 0x20, PropSize: 0x10x21(0x1)(None)
	uint8                                        BitPad_318 : 2;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_39B0[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                BPDrawEntryTargetRef;                              // 0x28(0x8)(ZeroConstructor)
	uint8                                        bDrawTooltip : 1;                                  // Mask: 0x1, PropSize: 0x10x30(0x1)(None)
	uint8                                        BitPad_319 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_39B1[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        WheelCategory;                                     // 0x34(0x4)(None)
	struct FColor                                DisableUseColor;                                   // 0x38(0x4)(None)
	struct FColor                                UseTextColor;                                      // 0x3C(0x4)(None)
	float                                        EntryActivationTimer;                              // 0x40(0x4)(None)
	float                                        DefaultEntryActivationTimer;                       // 0x44(0x4)(None)
	class USoundBase*                            ActivationSound;                                   // 0x48(0x8)(ZeroConstructor)
	int32                                        UseInventoryButtonStyleOverrideIndex;              // 0x50(0x4)(None)
	int32                                        AdditionalButtonsIndex;                            // 0x54(0x4)(None)
	class UTexture2D*                            Icon;                                              // 0x58(0x8)(ZeroConstructor)
	struct FColor                                UseIconColor;                                      // 0x60(0x4)(None)
	uint8                                        bIsDynamicOption : 1;                              // Mask: 0x1, PropSize: 0x10x64(0x1)(None)
	uint8                                        bUseOldMultiUseOptionWithText : 1;                 // Mask: 0x2, PropSize: 0x10x64(0x1)(None)
	uint8                                        BitPad_31A : 6;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_39B2[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UObject*                               SponsorIconObject;                                 // 0x68(0x8)(None)
	int32                                        OpenWheelCategory;                                 // 0x70(0x4)(None)
	uint8                                        Pad_39B3[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x70 (0x70 - 0x0)
// ScriptStruct Engine.QuickActionOption
struct FQuickActionOption
{
public:
	class FString                                ActionString;                                      // 0x0(0x10)(AssetRegistrySearchable, BlueprintCallable, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, HasGetValueTypeHash)
	class FString                                SecondActionString;                                // 0x10(0x10)(None)
	int32                                        IndexUse;                                          // 0x20(0x4)(None)
	uint8                                        bIsEnabled : 1;                                    // Mask: 0x1, PropSize: 0x10x24(0x1)(None)
	uint8                                        BitPad_31B : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_39B4[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FColor                                UseColor;                                          // 0x28(0x4)(None)
	struct FColor                                DisableUseColor;                                   // 0x2C(0x4)(None)
	float                                        EntryActivationTimer;                              // 0x30(0x4)(None)
	uint8                                        bClientSideOnly : 1;                               // Mask: 0x1, PropSize: 0x10x34(0x1)(None)
	uint8                                        BitPad_31C : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_39B5[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               RelativeLocation;                                  // 0x38(0x18)(None)
	float                                        DistanceToActive;                                  // 0x50(0x4)(None)
	struct FColor                                ProgressBarColor;                                  // 0x54(0x4)(None)
	struct FColor                                SecondaryActionColor;                              // 0x58(0x4)(None)
	uint8                                        Pad_39B6[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            IconImageQuickActionTest;                          // 0x60(0x8)(None)
	uint8                                        bCanMultiPlayerQuickAction : 1;                    // Mask: 0x1, PropSize: 0x10x68(0x1)(None)
	uint8                                        bCancelOnActorReceiveDamage : 1;                   // Mask: 0x2, PropSize: 0x10x68(0x1)(None)
	uint8                                        Pad_39B7[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Engine.MultiUseWheelOption
struct FMultiUseWheelOption
{
public:
	class FString                                ActionString;                                      // 0x0(0x10)(None)
	class UTexture2D*                            Icon;                                              // 0x10(0x8)(None)
};

// 0x70 (0x70 - 0x0)
// ScriptStruct Engine.RepMovement
struct FRepMovement
{
public:
	struct FVector                               LinearVelocity;                                    // 0x0(0x18)(None)
	struct FVector                               AngularVelocity;                                   // 0x18(0x18)(None)
	struct FVector                               Location;                                          // 0x30(0x18)(None)
	struct FRotator                              Rotation;                                          // 0x48(0x18)(None)
	uint8                                        bSimulatedPhysicSleep : 1;                         // Mask: 0x1, PropSize: 0x10x60(0x1)(None)
	uint8                                        bRepPhysics : 1;                                   // Mask: 0x2, PropSize: 0x10x60(0x1)(None)
	uint8                                        BitPad_31D : 6;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_39B8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ServerFrame;                                       // 0x64(0x4)(None)
	int32                                        ServerPhysicsHandle;                               // 0x68(0x4)(None)
	enum class EVectorQuantization               LocationQuantizationLevel;                         // 0x6C(0x1)(None)
	enum class EVectorQuantization               VelocityQuantizationLevel;                         // 0x6D(0x1)(None)
	enum class ERotatorQuantization              RotationQuantizationLevel;                         // 0x6E(0x1)(None)
	uint8                                        Pad_39B9[0x1];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Engine.Vector_NetQuantize100
struct FVector_NetQuantize100 : public FVector
{
public:
};

// 0x60 (0x60 - 0x0)
// ScriptStruct Engine.RepAttachment
struct FRepAttachment
{
public:
	class AActor*                                AttachParent;                                      // 0x0(0x8)(ZeroConstructor)
	struct FVector_NetQuantize100                LocationOffset;                                    // 0x8(0x18)(None)
	struct FVector_NetQuantize100                RelativeScale3D;                                   // 0x20(0x18)(None)
	struct FRotator                              RotationOffset;                                    // 0x38(0x18)(None)
	class FName                                  AttachSocket;                                      // 0x50(0x8)(None)
	class USceneComponent*                       AttachComponent;                                   // 0x58(0x8)(None)
};

// 0x10 (0x38 - 0x28)
// ScriptStruct Engine.ActorTickFunction
struct FActorTickFunction : public FTickFunction
{
public:
	uint8                                        Pad_39BA[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bSavedActorTickState : 1;                          // Mask: 0x1, PropSize: 0x10x30(0x1)(None)
	uint8                                        bSavedActorTickStateValue : 1;                     // Mask: 0x2, PropSize: 0x10x30(0x1)(None)
	uint8                                        Pad_39BB[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Engine.ActorDataLayer
struct FActorDataLayer
{
public:
	class FName                                  Name;                                              // 0x0(0x8)(None)
};

// 0x20 (0x50 - 0x30)
// ScriptStruct Engine.KSphereElem
struct FKSphereElem : public FKShapeElem
{
public:
	struct FVector                               Center;                                            // 0x30(0x18)(None)
	float                                        Radius;                                            // 0x48(0x4)(None)
	uint8                                        Pad_39BC[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x40 (0x70 - 0x30)
// ScriptStruct Engine.KBoxElem
struct FKBoxElem : public FKShapeElem
{
public:
	struct FVector                               Center;                                            // 0x30(0x18)(None)
	struct FRotator                              Rotation;                                          // 0x48(0x18)(None)
	float                                        X;                                                 // 0x60(0x4)(None)
	float                                        Y;                                                 // 0x64(0x4)(None)
	float                                        Z;                                                 // 0x68(0x4)(None)
	uint8                                        Pad_39BD[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x38 (0x68 - 0x30)
// ScriptStruct Engine.KSphylElem
struct FKSphylElem : public FKShapeElem
{
public:
	struct FVector                               Center;                                            // 0x30(0x18)(None)
	struct FRotator                              Rotation;                                          // 0x48(0x18)(None)
	float                                        Radius;                                            // 0x60(0x4)(None)
	float                                        Length;                                            // 0x64(0x4)(None)
};

// 0xD0 (0x100 - 0x30)
// ScriptStruct Engine.KConvexElem
struct FKConvexElem : public FKShapeElem
{
public:
	TArray<struct FVector>                       VertexData;                                        // 0x30(0x10)(AutoWeak, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper)
	TArray<int32>                                IndexData;                                         // 0x40(0x10)(None)
	struct FBox                                  ElemBox;                                           // 0x50(0x38)(None)
	uint8                                        Pad_39BE[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            Transform;                                         // 0x90(0x60)(None)
	uint8                                        Pad_39BF[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x40 (0x70 - 0x30)
// ScriptStruct Engine.KTaperedCapsuleElem
struct FKTaperedCapsuleElem : public FKShapeElem
{
public:
	struct FVector                               Center;                                            // 0x30(0x18)(None)
	struct FRotator                              Rotation;                                          // 0x48(0x18)(None)
	float                                        Radius0;                                           // 0x60(0x4)(None)
	float                                        Radius1;                                           // 0x64(0x4)(None)
	float                                        Length;                                            // 0x68(0x4)(None)
	uint8                                        Pad_39C0[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x70 (0xA0 - 0x30)
// ScriptStruct Engine.KLevelSetElem
struct FKLevelSetElem : public FKShapeElem
{
public:
	struct FTransform                            Transform;                                         // 0x30(0x60)(None)
	uint8                                        Pad_39C1[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x68 (0x68 - 0x0)
// ScriptStruct Engine.KAggregateGeom
struct FKAggregateGeom
{
public:
	TArray<struct FKSphereElem>                  SphereElems;                                       // 0x0(0x10)(ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper)
	TArray<struct FKBoxElem>                     BoxElems;                                          // 0x10(0x10)(SimpleDisplay, AdvancedDisplay, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper)
	TArray<struct FKSphylElem>                   SphylElems;                                        // 0x20(0x10)(BlueprintCallable, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper)
	TArray<struct FKConvexElem>                  ConvexElems;                                       // 0x30(0x10)(ContainsInstancedReference, BlueprintCallable, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper)
	TArray<struct FKTaperedCapsuleElem>          TaperedCapsuleElems;                               // 0x40(0x10)(AutoWeak, AssetRegistrySearchable, BlueprintCallable, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper)
	TArray<struct FKLevelSetElem>                LevelSetElems;                                     // 0x50(0x10)(None)
	uint8                                        Pad_39C2[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// ScriptStruct Engine.NamedFloat
struct FNamedFloat
{
public:
	float                                        Value;                                             // 0x0(0x4)(None)
	class FName                                  Name;                                              // 0x4(0x8)(None)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Engine.NamedVector
struct FNamedVector
{
public:
	struct FVector                               Value;                                             // 0x0(0x18)(None)
	class FName                                  Name;                                              // 0x18(0x8)(None)
};

// 0xC (0xC - 0x0)
// ScriptStruct Engine.NamedColor
struct FNamedColor
{
public:
	struct FColor                                Value;                                             // 0x0(0x4)(None)
	class FName                                  Name;                                              // 0x4(0x8)(None)
};

// 0x70 (0x70 - 0x0)
// ScriptStruct Engine.NamedTransform
struct FNamedTransform
{
public:
	struct FTransform                            Value;                                             // 0x0(0x60)(None)
	class FName                                  Name;                                              // 0x60(0x8)(None)
	uint8                                        Pad_39C3[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Engine.LocalSpacePose
struct FLocalSpacePose
{
public:
	TArray<struct FTransform>                    Transforms;                                        // 0x0(0x10)(AutoWeak, AdvancedDisplay, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper)
	TArray<class FName>                          Names;                                             // 0x10(0x10)(None)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Engine.ComponentSpacePose
struct FComponentSpacePose
{
public:
	TArray<struct FTransform>                    Transforms;                                        // 0x0(0x10)(AssetRegistrySearchable, SimpleDisplay, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper)
	TArray<class FName>                          Names;                                             // 0x10(0x10)(None)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Engine.AnimationErrorStats
struct FAnimationErrorStats
{
public:
	uint8                                        Pad_39C4[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// ScriptStruct Engine.SmartName
struct FSmartName
{
public:
	class FName                                  DisplayName;                                       // 0x0(0x8)(None)
	uint8                                        Pad_39C5[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Engine.AnimCurveBase
struct FAnimCurveBase
{
public:
	struct FSmartName                            Name;                                              // 0x0(0xC)(None)
	int32                                        CurveTypeFlags;                                    // 0xC(0x4)(None)
};

// 0x80 (0x90 - 0x10)
// ScriptStruct Engine.FloatCurve
struct FFloatCurve : public FAnimCurveBase
{
public:
	struct FRichCurve                            FloatCurve;                                        // 0x10(0x80)(None)
};

// 0x180 (0x190 - 0x10)
// ScriptStruct Engine.VectorCurve
struct FVectorCurve : public FAnimCurveBase
{
public:
	struct FRichCurve                            FloatCurves[0x3];                                  // 0x10(0x180)(None)
};

// 0x4B0 (0x4C0 - 0x10)
// ScriptStruct Engine.TransformCurve
struct FTransformCurve : public FAnimCurveBase
{
public:
	struct FVectorCurve                          TranslationCurve;                                  // 0x10(0x190)(SimpleDisplay, BlueprintCallable, BlueprintAuthorityOnly, PersistentInstance, UObjectWrapper, HasGetValueTypeHash)
	struct FVectorCurve                          RotationCurve;                                     // 0x1A0(0x190)(ContainsInstancedReference, SimpleDisplay, BlueprintCallable, BlueprintAuthorityOnly, PersistentInstance, UObjectWrapper, HasGetValueTypeHash)
	struct FVectorCurve                          ScaleCurve;                                        // 0x330(0x190)(None)
};

// 0x14 (0x14 - 0x0)
// ScriptStruct Engine.CachedFloatCurve
struct FCachedFloatCurve
{
public:
	class FName                                  CurveName;                                         // 0x0(0x8)(None)
	uint8                                        Pad_39C6[0xC];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Engine.RawCurveTracks
struct FRawCurveTracks
{
public:
	TArray<struct FFloatCurve>                   FloatCurves;                                       // 0x0(0x10)(None)
};

// 0x0 (0x0 - 0x0)
// ScriptStruct Engine.EmptyPayload
struct FEmptyPayload
{
public:
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Engine.BracketPayload
struct FBracketPayload : public FEmptyPayload
{
public:
	class FString                                Description;                                       // 0x0(0x10)(None)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Engine.AnimationTrackPayload
struct FAnimationTrackPayload : public FEmptyPayload
{
public:
	class FName                                  Name;                                              // 0x0(0x8)(None)
};

// 0x4 (0xC - 0x8)
// ScriptStruct Engine.AnimationTrackAddedPayload
struct FAnimationTrackAddedPayload : public FAnimationTrackPayload
{
public:
	int32                                        TrackIndex;                                        // 0x8(0x4)(None)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Engine.SequenceLengthChangedPayload
struct FSequenceLengthChangedPayload : public FEmptyPayload
{
public:
	float                                        PreviousLength;                                    // 0x0(0x4)(None)
	float                                        T0;                                                // 0x4(0x4)(None)
	float                                        T1;                                                // 0x8(0x4)(None)
	struct FFrameNumber                          PreviousNumberOfFrames;                            // 0xC(0x4)(None)
	struct FFrameNumber                          Frame0;                                            // 0x10(0x4)(None)
	struct FFrameNumber                          Frame1;                                            // 0x14(0x4)(None)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Engine.FrameRateChangedPayload
struct FFrameRateChangedPayload : public FEmptyPayload
{
public:
	struct FFrameRate                            PreviousFrameRate;                                 // 0x0(0x8)(None)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Engine.AnimationCurveIdentifier
struct FAnimationCurveIdentifier
{
public:
	struct FSmartName                            InternalName;                                      // 0x0(0xC)(None)
	enum class ERawCurveTrackTypes               CurveType;                                         // 0xC(0x1)(None)
	enum class ETransformCurveChannel            Channel;                                           // 0xD(0x1)(None)
	enum class EVectorCurveChannel               Axis;                                              // 0xE(0x1)(None)
	uint8                                        Pad_39C7[0x1];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Engine.CurvePayload
struct FCurvePayload : public FEmptyPayload
{
public:
	struct FAnimationCurveIdentifier             Identifier;                                        // 0x0(0x10)(None)
};

// 0x8 (0x18 - 0x10)
// ScriptStruct Engine.CurveScaledPayload
struct FCurveScaledPayload : public FCurvePayload
{
public:
	float                                        Factor;                                            // 0x10(0x4)(None)
	float                                        Origin;                                            // 0x14(0x4)(None)
};

// 0x10 (0x20 - 0x10)
// ScriptStruct Engine.CurveRenamedPayload
struct FCurveRenamedPayload : public FCurvePayload
{
public:
	struct FAnimationCurveIdentifier             NewIdentifier;                                     // 0x10(0x10)(None)
};

// 0x4 (0x14 - 0x10)
// ScriptStruct Engine.CurveFlagsChangedPayload
struct FCurveFlagsChangedPayload : public FCurvePayload
{
public:
	int32                                        OldFlags;                                          // 0x10(0x4)(None)
};

// 0x40 (0x40 - 0x0)
// ScriptStruct Engine.AnimationAttributeIdentifier
struct FAnimationAttributeIdentifier
{
public:
	class FName                                  Name;                                              // 0x0(0x8)(None)
	class FName                                  BoneName;                                          // 0x8(0x8)(None)
	int32                                        BoneIndex;                                         // 0x10(0x4)(None)
	uint8                                        Pad_39C8[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UScriptStruct*                         ScriptStruct;                                      // 0x18(0x8)(None)
	struct FSoftObjectPath                       ScriptStructPath;                                  // 0x20(0x20)(None)
};

// 0x40 (0x40 - 0x0)
// ScriptStruct Engine.AttributePayload
struct FAttributePayload : public FEmptyPayload
{
public:
	struct FAnimationAttributeIdentifier         Identifier;                                        // 0x0(0x40)(None)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Engine.AnimNodeConstantData
struct FAnimNodeConstantData
{
public:
	TScriptInterface<class IAnimClassInterface>  AnimClassInterface;                                // 0x0(0x10)(None)
	int32                                        NodeIndex;                                         // 0x10(0x4)(None)
	uint8                                        Pad_39C9[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x90 (0x90 - 0x0)
// ScriptStruct Engine.SlotEvaluationPose
struct FSlotEvaluationPose
{
public:
	enum class EAdditiveAnimationType            AdditiveType;                                      // 0x0(0x1)(None)
	uint8                                        Pad_39CA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Weight;                                            // 0x4(0x4)(None)
	uint8                                        Pad_39CB[0x88];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Engine.AnimSubsystem
struct FAnimSubsystem
{
public:
	uint8                                        Pad_39CC[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Engine.AnimSubsystemInstance
struct FAnimSubsystemInstance
{
public:
	uint8                                        Pad_39CD[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x18 - 0x8)
// ScriptStruct Engine.AnimSubsystem_BlendSpaceGraph
struct FAnimSubsystem_BlendSpaceGraph : public FAnimSubsystem
{
public:
	TArray<class UBlendSpace*>                   BlendSpaces;                                       // 0x8(0x10)(None)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Engine.PerBoneBlendWeights
struct FPerBoneBlendWeights
{
public:
	TArray<struct FPerBoneBlendWeight>           BoneBlendWeights;                                  // 0x0(0x10)(None)
};

// 0x30 (0x30 - 0x0)
// ScriptStruct Engine.AnimLinkableElement
struct FAnimLinkableElement
{
public:
	uint8                                        Pad_39CE[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimMontage*                          LinkedMontage;                                     // 0x8(0x8)(ZeroConstructor)
	int32                                        SlotIndex;                                         // 0x10(0x4)(None)
	int32                                        SegmentIndex;                                      // 0x14(0x4)(None)
	enum class EAnimLinkMethod                   LinkMethod;                                        // 0x18(0x1)(None)
	enum class EAnimLinkMethod                   CachedLinkMethod;                                  // 0x19(0x1)(None)
	uint8                                        Pad_39CF[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SegmentBeginTime;                                  // 0x1C(0x4)(None)
	float                                        SegmentLength;                                     // 0x20(0x4)(None)
	float                                        LinkValue;                                         // 0x24(0x4)(None)
	class UAnimSequenceBase*                     LinkedSequence;                                    // 0x28(0x8)(None)
};

// 0x88 (0xB8 - 0x30)
// ScriptStruct Engine.AnimNotifyEvent
struct FAnimNotifyEvent : public FAnimLinkableElement
{
public:
	float                                        TriggerTimeOffset;                                 // 0x30(0x4)(None)
	float                                        EndTriggerTimeOffset;                              // 0x34(0x4)(None)
	float                                        TriggerWeightThreshold;                            // 0x38(0x4)(None)
	class FName                                  NotifyName;                                        // 0x3C(0x8)(None)
	uint8                                        Pad_39D0[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimNotify*                           Notify;                                            // 0x48(0x8)(ZeroConstructor)
	class UAnimNotifyState*                      NotifyStateClass;                                  // 0x50(0x8)(ZeroConstructor)
	bool                                         bIgnoreOnDediServer;                               // 0x58(0x1)(None)
	uint8                                        Pad_39D1[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Duration;                                          // 0x5C(0x4)(None)
	struct FAnimLinkableElement                  EndLink;                                           // 0x60(0x30)(ZeroConstructor)
	bool                                         bConvertedFromBranchingPoint;                      // 0x90(0x1)(None)
	enum class EMontageNotifyTickType            MontageTickType;                                   // 0x91(0x1)(None)
	uint8                                        Pad_39D2[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        NotifyTriggerChance;                               // 0x94(0x4)(None)
	enum class ENotifyFilterType                 NotifyFilterType;                                  // 0x98(0x1)(None)
	uint8                                        Pad_39D3[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NotifyFilterLOD;                                   // 0x9C(0x4)(None)
	bool                                         bTriggerOnDedicatedServer;                         // 0xA0(0x1)(None)
	bool                                         bTriggerOnFollower;                                // 0xA1(0x1)(None)
	uint8                                        Pad_39D4[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        TrackIndex;                                        // 0xA4(0x4)(None)
	uint8                                        Pad_39D5[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// ScriptStruct Engine.AnimSyncMarker
struct FAnimSyncMarker
{
public:
	class FName                                  MarkerName;                                        // 0x0(0x8)(None)
	float                                        Time;                                              // 0x8(0x4)(None)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct Engine.AnimNotifyTrack
struct FAnimNotifyTrack
{
public:
	class FName                                  TrackName;                                         // 0x0(0x8)(None)
	struct FLinearColor                          TrackColor;                                        // 0x8(0x10)(None)
	uint8                                        Pad_39D6[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Engine.MarkerSyncData
struct FMarkerSyncData
{
public:
	TArray<struct FAnimSyncMarker>               AuthoredSyncMarkers;                               // 0x0(0x10)(None)
	uint8                                        Pad_39D7[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x4 (0x4 - 0x0)
// ScriptStruct Engine.TrackToSkeletonMap
struct FTrackToSkeletonMap
{
public:
	int32                                        BoneTreeIndex;                                     // 0x0(0x4)(None)
};

// 0x30 (0x30 - 0x0)
// ScriptStruct Engine.RawAnimSequenceTrack
struct FRawAnimSequenceTrack
{
public:
	TArray<struct FVector3f>                     PosKeys;                                           // 0x0(0x10)(SimpleDisplay, AdvancedDisplay, Protected, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper)
	TArray<struct FQuat4f>                       RotKeys;                                           // 0x10(0x10)(AutoWeak, AssetRegistrySearchable, AdvancedDisplay, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper)
	TArray<struct FVector3f>                     ScaleKeys;                                         // 0x20(0x10)(None)
};

// 0x28 (0x28 - 0x0)
// ScriptStruct Engine.NXSettings
struct FNXSettings
{
public:
	float                                        Exposure_MaxBrightness_Modulation;                 // 0x0(0x4)(None)
	float                                        SkyLight_Intensity_Modulation;                     // 0x4(0x4)(None)
	int32                                        ZPassMode;                                         // 0x8(0x4)(None)
	int32                                        LightShaftQuality;                                 // 0xC(0x4)(None)
	TArray<class UClass*>                        SpotlightClasses;                                  // 0x10(0x10)(None)
	float                                        DinoStasisRangeMultiplier;                         // 0x20(0x4)(None)
	uint8                                        Pad_39D8[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x60 (0x60 - 0x0)
// ScriptStruct Engine.FoliageReductionSettings
struct FFoliageReductionSettings
{
public:
	int32                                        TreeFoliagePercent;                                // 0x0(0x4)(None)
	int32                                        BushFoliagePercent;                                // 0x4(0x4)(None)
	int32                                        CosmeticFoliagePercent;                            // 0x8(0x4)(None)
	uint8                                        Pad_39D9[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<TSoftObjectPtr<class UStaticMesh>, int32> Overrides;                                         // 0x10(0x50)(None)
};

// 0x14 (0x14 - 0x0)
// ScriptStruct Engine.PointLightReductionSettings
struct FPointLightReductionSettings
{
public:
	float                                        RadiusScale;                                       // 0x0(0x4)(None)
	float                                        DistanceScale;                                     // 0x4(0x4)(None)
	float                                        IntensityScale;                                    // 0x8(0x4)(None)
	float                                        MaxAttenuationRadius;                              // 0xC(0x4)(None)
	bool                                         bEffectSpotLights;                                 // 0x10(0x1)(None)
	uint8                                        Pad_39DA[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Engine.LayerNameArray
struct FLayerNameArray
{
public:
	TArray<class FName>                          LayerNames;                                        // 0x0(0x10)(None)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Engine.AssetManagerRedirect
struct FAssetManagerRedirect
{
public:
	class FString                                Old;                                               // 0x0(0x10)(SimpleDisplay, Protected, BlueprintAuthorityOnly, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash)
	class FString                                New;                                               // 0x10(0x10)(None)
};

// 0xC (0xC - 0x0)
// ScriptStruct Engine.PrimaryAssetRules
struct FPrimaryAssetRules
{
public:
	int32                                        Priority;                                          // 0x0(0x4)(None)
	int32                                        ChunkId;                                           // 0x4(0x4)(None)
	bool                                         bApplyRecursively;                                 // 0x8(0x1)(None)
	enum class EPrimaryAssetCookRule             CookRule;                                          // 0x9(0x1)(None)
	uint8                                        Pad_39DB[0x2];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1C (0x1C - 0x0)
// ScriptStruct Engine.PrimaryAssetRulesOverride
struct FPrimaryAssetRulesOverride
{
public:
	struct FPrimaryAssetId                       PrimaryAssetId;                                    // 0x0(0x10)(None)
	struct FPrimaryAssetRules                    Rules;                                             // 0x10(0xC)(None)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct Engine.PrimaryAssetRulesCustomOverride
struct FPrimaryAssetRulesCustomOverride
{
public:
	struct FPrimaryAssetType                     PrimaryAssetType;                                  // 0x0(0x8)(None)
	struct FDirectoryPath                        FilterDirectory;                                   // 0x8(0x10)(ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, BlueprintAuthorityOnly, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash)
	class FString                                FilterString;                                      // 0x18(0x10)(None)
	struct FPrimaryAssetRules                    Rules;                                             // 0x28(0xC)(None)
	uint8                                        Pad_39DC[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Engine.TreeStumpCreationTime
struct FTreeStumpCreationTime
{
public:
	class UInstancedStaticMeshComponent*         Comp;                                              // 0x0(0x8)(None)
	int32                                        InstanceIndex;                                     // 0x8(0x4)(None)
	uint8                                        Pad_39DD[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       CreationTime;                                      // 0x10(0x8)(None)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Engine.BlendSpaceBlendProfile
struct FBlendSpaceBlendProfile
{
public:
	class UBlendProfile*                         BlendProfile;                                      // 0x0(0x8)(None)
	float                                        TargetWeightInterpolationSpeedPerSec;              // 0x8(0x4)(None)
	uint8                                        Pad_39DE[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Engine.InterpolationParameter
struct FInterpolationParameter
{
public:
	float                                        InterpolationTime;                                 // 0x0(0x4)(None)
	float                                        DampingRatio;                                      // 0x4(0x4)(None)
	float                                        MaxSpeed;                                          // 0x8(0x4)(None)
	enum class EFilterInterpolationType          InterpolationType;                                 // 0xC(0x1)(None)
	uint8                                        Pad_39DF[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x28 - 0x0)
// ScriptStruct Engine.BlendParameter
struct FBlendParameter
{
public:
	class FString                                DisplayName;                                       // 0x0(0x10)(None)
	float                                        Min;                                               // 0x10(0x4)(None)
	float                                        Max;                                               // 0x14(0x4)(None)
	float                                        Offset;                                            // 0x18(0x4)(None)
	int32                                        GridNum;                                           // 0x1C(0x4)(None)
	bool                                         bSnapToGrid;                                       // 0x20(0x1)(None)
	bool                                         bWrapInput;                                        // 0x21(0x1)(None)
	uint8                                        Pad_39E0[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x28 - 0x0)
// ScriptStruct Engine.BlendSample
struct FBlendSample
{
public:
	class UAnimSequence*                         Animation;                                         // 0x0(0x8)(None)
	struct FVector                               SampleValue;                                       // 0x8(0x18)(None)
	float                                        RateScale;                                         // 0x20(0x4)(None)
	uint8                                        Pad_39E1[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Engine.BlendSpaceSegment
struct FBlendSpaceSegment
{
public:
	int32                                        SampleIndices[0x2];                                // 0x0(0x8)(None)
	float                                        Vertices[0x2];                                     // 0x8(0x8)(None)
};

// 0x28 (0x28 - 0x0)
// ScriptStruct Engine.BlendSpaceTriangleEdgeInfo
struct FBlendSpaceTriangleEdgeInfo
{
public:
	struct FVector2D                             Normal;                                            // 0x0(0x10)(None)
	int32                                        NeighbourTriangleIndex;                            // 0x10(0x4)(None)
	int32                                        AdjacentPerimeterTriangleIndices[0x2];             // 0x14(0x8)(None)
	int32                                        AdjacentPerimeterVertexIndices[0x2];               // 0x1C(0x8)(None)
	uint8                                        Pad_39E2[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xB8 (0xB8 - 0x0)
// ScriptStruct Engine.BlendSpaceTriangle
struct FBlendSpaceTriangle
{
public:
	int32                                        SampleIndices[0x3];                                // 0x0(0xC)(None)
	uint8                                        Pad_39E3[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             Vertices[0x3];                                     // 0x10(0x30)(None)
	struct FBlendSpaceTriangleEdgeInfo           EdgeInfo[0x3];                                     // 0x40(0x78)(None)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Engine.WeightedBlendSample
struct FWeightedBlendSample
{
public:
	int32                                        SampleIndex;                                       // 0x0(0x4)(None)
	float                                        SampleWeight;                                      // 0x4(0x4)(None)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Engine.BlendSpaceData
struct FBlendSpaceData
{
public:
	TArray<struct FBlendSpaceSegment>            Segments;                                          // 0x0(0x10)(AutoWeak, SimpleDisplay, Protected, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper)
	TArray<struct FBlendSpaceTriangle>           Triangles;                                         // 0x10(0x10)(None)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Engine.EditorElement
struct FEditorElement
{
public:
	int32                                        Indices[0x3];                                      // 0x0(0xC)(None)
	float                                        Weights[0x3];                                      // 0xC(0xC)(None)
};

// 0x1C (0x1C - 0x0)
// ScriptStruct Engine.GridBlendSample
struct FGridBlendSample
{
public:
	struct FEditorElement                        GridElement;                                       // 0x0(0x18)(None)
	float                                        BlendWeight;                                       // 0x18(0x4)(None)
};

// 0x14 (0x14 - 0x0)
// ScriptStruct Engine.PerBoneInterpolation
struct FPerBoneInterpolation
{
public:
	struct FBoneReference                        BoneReference;                                     // 0x0(0x10)(None)
	float                                        InterpolationSpeedPerSec;                          // 0x10(0x4)(None)
};

// 0x80 (0x80 - 0x0)
// ScriptStruct Engine.CompilerNativizationOptions
struct FCompilerNativizationOptions
{
public:
	class FName                                  PlatformName;                                      // 0x0(0x8)(None)
	bool                                         ServerOnlyPlatform;                                // 0x8(0x1)(None)
	bool                                         ClientOnlyPlatform;                                // 0x9(0x1)(None)
	bool                                         bExcludeMonolithicHeaders;                         // 0xA(0x1)(None)
	uint8                                        Pad_39E4[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FName>                          ExcludedModules;                                   // 0x10(0x10)(AutoWeak, Protected, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper)
	TSet<struct FSoftObjectPath>                 ExcludedAssets;                                    // 0x20(0x50)(AssetRegistrySearchable, Protected, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper)
	TArray<class FString>                        ExcludedFolderPaths;                               // 0x70(0x10)(None)
};

// 0x1 (0x1 - 0x0)
// ScriptStruct Engine.BlueprintMacroCosmeticInfo
struct FBlueprintMacroCosmeticInfo
{
public:
	uint8                                        Pad_39E5[0x1];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Engine.BPVariableMetaDataEntry
struct FBPVariableMetaDataEntry
{
public:
	class FName                                  DataKey;                                           // 0x0(0x8)(None)
	class FString                                DataValue;                                         // 0x8(0x10)(None)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Engine.SimpleMemberReference
struct FSimpleMemberReference
{
public:
	class UObject*                               MemberParent;                                      // 0x0(0x8)(None)
	class FName                                  MemberName;                                        // 0x8(0x8)(None)
	struct FGuid                                 MemberGuid;                                        // 0x10(0x10)(None)
};

// 0x1C (0x1C - 0x0)
// ScriptStruct Engine.EdGraphTerminalType
struct FEdGraphTerminalType
{
public:
	class FName                                  TerminalCategory;                                  // 0x0(0x8)(None)
	class FName                                  TerminalSubCategory;                               // 0x8(0x8)(None)
	TWeakObjectPtr<class UObject>                TerminalSubCategoryObject;                         // 0x10(0x8)(None)
	bool                                         bTerminalIsConst;                                  // 0x18(0x1)(None)
	bool                                         bTerminalIsWeakPointer;                            // 0x19(0x1)(None)
	bool                                         bTerminalIsUObjectWrapper;                         // 0x1A(0x1)(None)
	uint8                                        Pad_39E6[0x1];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x58 (0x58 - 0x0)
// ScriptStruct Engine.EdGraphPinType
struct FEdGraphPinType
{
public:
	class FName                                  PinCategory;                                       // 0x0(0x8)(None)
	class FName                                  PinSubCategory;                                    // 0x8(0x8)(None)
	TWeakObjectPtr<class UObject>                PinSubCategoryObject;                              // 0x10(0x8)(ZeroConstructor)
	struct FSimpleMemberReference                PinSubCategoryMemberReference;                     // 0x18(0x20)(ZeroConstructor)
	struct FEdGraphTerminalType                  PinValueType;                                      // 0x38(0x1C)(None)
	enum class EPinContainerType                 ContainerType;                                     // 0x54(0x1)(None)
	uint8                                        bIsArray : 1;                                      // Mask: 0x1, PropSize: 0x10x55(0x1)(None)
	uint8                                        bIsReference : 1;                                  // Mask: 0x2, PropSize: 0x10x55(0x1)(None)
	uint8                                        bIsConst : 1;                                      // Mask: 0x4, PropSize: 0x10x55(0x1)(None)
	uint8                                        bIsWeakPointer : 1;                                // Mask: 0x8, PropSize: 0x10x55(0x1)(None)
	uint8                                        bIsUObjectWrapper : 1;                             // Mask: 0x10, PropSize: 0x10x55(0x1)(None)
	uint8                                        bSerializeAsSinglePrecisionFloat : 1;              // Mask: 0x20, PropSize: 0x10x55(0x1)(None)
	uint8                                        Pad_39E7[0x2];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xD0 (0xD0 - 0x0)
// ScriptStruct Engine.BPVariableDescription
struct FBPVariableDescription
{
public:
	class FName                                  VarName;                                           // 0x0(0x8)(None)
	struct FGuid                                 VarGuid;                                           // 0x8(0x10)(None)
	struct FEdGraphPinType                       VarType;                                           // 0x18(0x58)(None)
	class FString                                FriendlyName;                                      // 0x70(0x10)(AdvancedDisplay, Protected, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash)
	class FText                                  Category;                                          // 0x80(0x18)(AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper)
	uint64                                       PropertyFlags;                                     // 0x98(0x8)(None)
	class FName                                  RepNotifyFunc;                                     // 0xA0(0x8)(None)
	enum class ELifetimeCondition                ReplicationCondition;                              // 0xA8(0x1)(None)
	uint8                                        Pad_39E8[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FBPVariableMetaDataEntry>      MetaDataArray;                                     // 0xB0(0x10)(ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash)
	class FString                                DefaultValue;                                      // 0xC0(0x10)(None)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Engine.BPInterfaceDescription
struct FBPInterfaceDescription
{
public:
	class UClass*                                Interface;                                         // 0x0(0x8)(ZeroConstructor)
	TArray<class UEdGraph*>                      Graphs;                                            // 0x8(0x10)(None)
};

// 0x40 (0x40 - 0x0)
// ScriptStruct Engine.EditedDocumentInfo
struct FEditedDocumentInfo
{
public:
	struct FSoftObjectPath                       EditedObjectPath;                                  // 0x0(0x20)(None)
	struct FVector2D                             SavedViewOffset;                                   // 0x20(0x10)(None)
	float                                        SavedZoomAmount;                                   // 0x30(0x4)(None)
	uint8                                        Pad_39EB[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UObject*                               EditedObject;                                      // 0x38(0x8)(None)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct Engine.BPEditorBookmarkNode
struct FBPEditorBookmarkNode
{
public:
	struct FGuid                                 NodeGuid;                                          // 0x0(0x10)(None)
	struct FGuid                                 ParentGuid;                                        // 0x10(0x10)(None)
	class FText                                  DisplayName;                                       // 0x20(0x18)(None)
};

// 0x1 (0x1 - 0x0)
// ScriptStruct Engine.Bookmark2DJumpToSettings
struct FBookmark2DJumpToSettings
{
public:
	uint8                                        Pad_39EC[0x1];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// ScriptStruct Engine.BookmarkBaseJumpToSettings
struct FBookmarkBaseJumpToSettings
{
public:
	uint8                                        Pad_39ED[0x1];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// ScriptStruct Engine.GeomSelection
struct FGeomSelection
{
public:
	int32                                        Type;                                              // 0x0(0x4)(None)
	int32                                        Index;                                             // 0x4(0x4)(None)
	int32                                        SelectionIndex;                                    // 0x8(0x4)(None)
};

// 0x4 (0x4 - 0x0)
// ScriptStruct Engine.FloatAnimationAttribute
struct FFloatAnimationAttribute
{
public:
	float                                        Value;                                             // 0x0(0x4)(None)
};

// 0x4 (0x4 - 0x0)
// ScriptStruct Engine.IntegerAnimationAttribute
struct FIntegerAnimationAttribute
{
public:
	int32                                        Value;                                             // 0x0(0x4)(None)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Engine.StringAnimationAttribute
struct FStringAnimationAttribute
{
public:
	class FString                                Value;                                             // 0x0(0x10)(None)
};

// 0x60 (0x60 - 0x0)
// ScriptStruct Engine.TransformAnimationAttribute
struct FTransformAnimationAttribute
{
public:
	struct FTransform                            Value;                                             // 0x0(0x60)(None)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Engine.VectorAnimationAttribute
struct FVectorAnimationAttribute
{
public:
	struct FVector                               Value;                                             // 0x0(0x18)(None)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Engine.QuaternionAnimationAttribute
struct FQuaternionAnimationAttribute
{
public:
	struct FQuat                                 Value;                                             // 0x0(0x20)(None)
};

// 0x0 (0x20 - 0x20)
// ScriptStruct Engine.NonBlendableQuaternionAnimationAttribute
struct FNonBlendableQuaternionAnimationAttribute : public FQuaternionAnimationAttribute
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Engine.NonBlendableVectorAnimationAttribute
struct FNonBlendableVectorAnimationAttribute : public FVectorAnimationAttribute
{
public:
};

// 0x0 (0x60 - 0x60)
// ScriptStruct Engine.NonBlendableTransformAnimationAttribute
struct FNonBlendableTransformAnimationAttribute : public FTransformAnimationAttribute
{
public:
};

// 0x0 (0x4 - 0x4)
// ScriptStruct Engine.NonBlendableFloatAnimationAttribute
struct FNonBlendableFloatAnimationAttribute : public FFloatAnimationAttribute
{
public:
};

// 0x0 (0x4 - 0x4)
// ScriptStruct Engine.NonBlendableIntegerAnimationAttribute
struct FNonBlendableIntegerAnimationAttribute : public FIntegerAnimationAttribute
{
public:
};

// 0x50 (0x50 - 0x0)
// ScriptStruct Engine.PostProcessSettingsMaterialAdjuster
struct FPostProcessSettingsMaterialAdjuster
{
public:
	class UMaterialInterface*                    PostProcessParentMaterial;                         // 0x0(0x8)(ZeroConstructor)
	class UMaterialParameterCollection*          MaterialParamCollecton;                            // 0x8(0x8)(None)
	TArray<class FName>                          ScalarParameterNames;                              // 0x10(0x10)(AutoWeak, ContainsInstancedReference, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper)
	TArray<float>                                ScalarParameterValues;                             // 0x20(0x10)(ContainsInstancedReference, AssetRegistrySearchable, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper)
	TArray<class FName>                          VectorParameterNames;                              // 0x30(0x10)(SimpleDisplay, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper)
	TArray<struct FVector>                       VectorParameterValues;                             // 0x40(0x10)(None)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Engine.WeightedBlendable
struct FWeightedBlendable
{
public:
	float                                        Weight;                                            // 0x0(0x4)(None)
	uint8                                        Pad_39F4[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UObject*                               Object;                                            // 0x8(0x8)(None)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Engine.WeightedBlendables
struct FWeightedBlendables
{
public:
	TArray<struct FWeightedBlendable>            Array;                                             // 0x0(0x10)(None)
};

// 0x30 (0x30 - 0x0)
// ScriptStruct Engine.ClutterData
struct FClutterData
{
public:
	float                                        Density;                                           // 0x0(0x4)(None)
	float                                        MinSize;                                           // 0x4(0x4)(None)
	float                                        MaxSize;                                           // 0x8(0x4)(None)
	int32                                        GenerationSeed;                                    // 0xC(0x4)(None)
	bool                                         bAllowShadows;                                     // 0x10(0x1)(None)
	uint8                                        Pad_39F6[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UStaticMesh*                           StaticMesh;                                        // 0x18(0x8)(ZeroConstructor)
	class UTexture2D*                            VisibilityTexture;                                 // 0x20(0x8)(None)
	int32                                        TextureChannel;                                    // 0x28(0x4)(None)
	uint8                                        Pad_39F7[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Engine.OverrideClutterLayer
struct FOverrideClutterLayer
{
public:
	int32                                        LayerID;                                           // 0x0(0x4)(None)
	uint8                                        Pad_39F8[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FClutterData>                  ClutterLayers;                                     // 0x8(0x10)(None)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct Engine.ClutterPropertyOverride
struct FClutterPropertyOverride
{
public:
	int32                                        LayerID;                                           // 0x0(0x4)(None)
	int32                                        ArrayIndex;                                        // 0x4(0x4)(None)
	bool                                         OverrideDensity;                                   // 0x8(0x1)(None)
	uint8                                        Pad_39F9[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Density;                                           // 0xC(0x4)(None)
	bool                                         OverrideMinSize;                                   // 0x10(0x1)(None)
	uint8                                        Pad_39FA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinSize;                                           // 0x14(0x4)(None)
	bool                                         OverrideMaxSize;                                   // 0x18(0x1)(None)
	uint8                                        Pad_39FB[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MaxSize;                                           // 0x1C(0x4)(None)
	bool                                         OverrideGenerationSeed;                            // 0x20(0x1)(None)
	uint8                                        Pad_39FC[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        GenerationSeed;                                    // 0x24(0x4)(None)
	bool                                         OverrideAllowShadows;                              // 0x28(0x1)(None)
	bool                                         bAllowShadows;                                     // 0x29(0x1)(None)
	bool                                         OverrideStaticMesh;                                // 0x2A(0x1)(None)
	uint8                                        Pad_39FD[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UStaticMesh*                           StaticMesh;                                        // 0x30(0x8)(ZeroConstructor)
	bool                                         OverrideVisibilityTexture;                         // 0x38(0x1)(None)
	uint8                                        Pad_39FE[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            VisibilityTexture;                                 // 0x40(0x8)(None)
	bool                                         OverrideTextureChannel;                            // 0x48(0x1)(None)
	uint8                                        Pad_39FF[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        TextureChannel;                                    // 0x4C(0x4)(None)
};

// 0x770 (0x770 - 0x0)
// ScriptStruct Engine.PostProcessSettings
struct FPostProcessSettings
{
public:
	uint8                                        bOverride_TemperatureType : 1;                     // Mask: 0x1, PropSize: 0x10x0(0x1)(None)
	uint8                                        bOverride_WhiteTemp : 1;                           // Mask: 0x2, PropSize: 0x10x0(0x1)(None)
	uint8                                        bOverride_WhiteTint : 1;                           // Mask: 0x4, PropSize: 0x10x0(0x1)(None)
	uint8                                        bOverride_ColorSaturation : 1;                     // Mask: 0x8, PropSize: 0x10x0(0x1)(None)
	uint8                                        bOverride_ColorContrast : 1;                       // Mask: 0x10, PropSize: 0x10x0(0x1)(None)
	uint8                                        bOverride_ColorGamma : 1;                          // Mask: 0x20, PropSize: 0x10x0(0x1)(None)
	uint8                                        bOverride_ColorGain : 1;                           // Mask: 0x40, PropSize: 0x10x0(0x1)(None)
	uint8                                        bOverride_ColorOffset : 1;                         // Mask: 0x80, PropSize: 0x10x0(0x1)(None)
	uint8                                        bOverride_ColorSaturationShadows : 1;              // Mask: 0x1, PropSize: 0x10x1(0x1)(None)
	uint8                                        bOverride_ColorContrastShadows : 1;                // Mask: 0x2, PropSize: 0x10x1(0x1)(None)
	uint8                                        bOverride_ColorGammaShadows : 1;                   // Mask: 0x4, PropSize: 0x10x1(0x1)(None)
	uint8                                        bOverride_ColorGainShadows : 1;                    // Mask: 0x8, PropSize: 0x10x1(0x1)(None)
	uint8                                        bOverride_ColorOffsetShadows : 1;                  // Mask: 0x10, PropSize: 0x10x1(0x1)(None)
	uint8                                        bOverride_ColorSaturationMidtones : 1;             // Mask: 0x20, PropSize: 0x10x1(0x1)(None)
	uint8                                        bOverride_ColorContrastMidtones : 1;               // Mask: 0x40, PropSize: 0x10x1(0x1)(None)
	uint8                                        bOverride_ColorGammaMidtones : 1;                  // Mask: 0x80, PropSize: 0x10x1(0x1)(None)
	uint8                                        bOverride_ColorGainMidtones : 1;                   // Mask: 0x1, PropSize: 0x10x2(0x1)(None)
	uint8                                        bOverride_ColorOffsetMidtones : 1;                 // Mask: 0x2, PropSize: 0x10x2(0x1)(None)
	uint8                                        bOverride_ColorSaturationHighlights : 1;           // Mask: 0x4, PropSize: 0x10x2(0x1)(None)
	uint8                                        bOverride_ColorContrastHighlights : 1;             // Mask: 0x8, PropSize: 0x10x2(0x1)(None)
	uint8                                        bOverride_ColorGammaHighlights : 1;                // Mask: 0x10, PropSize: 0x10x2(0x1)(None)
	uint8                                        bOverride_ColorGainHighlights : 1;                 // Mask: 0x20, PropSize: 0x10x2(0x1)(None)
	uint8                                        bOverride_ColorOffsetHighlights : 1;               // Mask: 0x40, PropSize: 0x10x2(0x1)(None)
	uint8                                        bOverride_ColorCorrectionShadowsMax : 1;           // Mask: 0x80, PropSize: 0x10x2(0x1)(None)
	uint8                                        bOverride_ColorCorrectionHighlightsMin : 1;        // Mask: 0x1, PropSize: 0x10x3(0x1)(None)
	uint8                                        bOverride_ColorCorrectionHighlightsMax : 1;        // Mask: 0x2, PropSize: 0x10x3(0x1)(None)
	uint8                                        bOverride_BlueCorrection : 1;                      // Mask: 0x4, PropSize: 0x10x3(0x1)(None)
	uint8                                        bOverride_ExpandGamut : 1;                         // Mask: 0x8, PropSize: 0x10x3(0x1)(None)
	uint8                                        bOverride_ToneCurveAmount : 1;                     // Mask: 0x10, PropSize: 0x10x3(0x1)(None)
	uint8                                        bOverride_FilmSlope : 1;                           // Mask: 0x20, PropSize: 0x10x3(0x1)(None)
	uint8                                        bOverride_FilmToe : 1;                             // Mask: 0x40, PropSize: 0x10x3(0x1)(None)
	uint8                                        bOverride_FilmShoulder : 1;                        // Mask: 0x80, PropSize: 0x10x3(0x1)(None)
	uint8                                        bOverride_FilmBlackClip : 1;                       // Mask: 0x1, PropSize: 0x10x4(0x1)(None)
	uint8                                        bOverride_FilmWhiteClip : 1;                       // Mask: 0x2, PropSize: 0x10x4(0x1)(None)
	uint8                                        bOverride_SceneColorTint : 1;                      // Mask: 0x4, PropSize: 0x10x4(0x1)(None)
	uint8                                        bOverride_SceneFringeIntensity : 1;                // Mask: 0x8, PropSize: 0x10x4(0x1)(None)
	uint8                                        bOverride_ChromaticAberrationStartOffset : 1;      // Mask: 0x10, PropSize: 0x10x4(0x1)(None)
	uint8                                        bOverride_AmbientCubemapTint : 1;                  // Mask: 0x20, PropSize: 0x10x4(0x1)(None)
	uint8                                        bOverride_AmbientCubemapIntensity : 1;             // Mask: 0x40, PropSize: 0x10x4(0x1)(None)
	uint8                                        bOverride_BloomMethod : 1;                         // Mask: 0x80, PropSize: 0x10x4(0x1)(None)
	uint8                                        bOverride_BloomIntensity : 1;                      // Mask: 0x1, PropSize: 0x10x5(0x1)(None)
	uint8                                        bOverride_BloomThreshold : 1;                      // Mask: 0x2, PropSize: 0x10x5(0x1)(None)
	uint8                                        bOverride_Bloom1Tint : 1;                          // Mask: 0x4, PropSize: 0x10x5(0x1)(None)
	uint8                                        bOverride_Bloom1Size : 1;                          // Mask: 0x8, PropSize: 0x10x5(0x1)(None)
	uint8                                        bOverride_Bloom2Size : 1;                          // Mask: 0x10, PropSize: 0x10x5(0x1)(None)
	uint8                                        bOverride_Bloom2Tint : 1;                          // Mask: 0x20, PropSize: 0x10x5(0x1)(None)
	uint8                                        bOverride_Bloom3Tint : 1;                          // Mask: 0x40, PropSize: 0x10x5(0x1)(None)
	uint8                                        bOverride_Bloom3Size : 1;                          // Mask: 0x80, PropSize: 0x10x5(0x1)(None)
	uint8                                        bOverride_Bloom4Tint : 1;                          // Mask: 0x1, PropSize: 0x10x6(0x1)(None)
	uint8                                        bOverride_Bloom4Size : 1;                          // Mask: 0x2, PropSize: 0x10x6(0x1)(None)
	uint8                                        bOverride_Bloom5Tint : 1;                          // Mask: 0x4, PropSize: 0x10x6(0x1)(None)
	uint8                                        bOverride_Bloom5Size : 1;                          // Mask: 0x8, PropSize: 0x10x6(0x1)(None)
	uint8                                        bOverride_Bloom6Tint : 1;                          // Mask: 0x10, PropSize: 0x10x6(0x1)(None)
	uint8                                        bOverride_Bloom6Size : 1;                          // Mask: 0x20, PropSize: 0x10x6(0x1)(None)
	uint8                                        bOverride_BloomSizeScale : 1;                      // Mask: 0x40, PropSize: 0x10x6(0x1)(None)
	uint8                                        bOverride_BloomConvolutionTexture : 1;             // Mask: 0x80, PropSize: 0x10x6(0x1)(None)
	uint8                                        bOverride_BloomConvolutionScatterDispersion : 1;   // Mask: 0x1, PropSize: 0x10x7(0x1)(None)
	uint8                                        bOverride_BloomConvolutionSize : 1;                // Mask: 0x2, PropSize: 0x10x7(0x1)(None)
	uint8                                        bOverride_BloomConvolutionCenterUV : 1;            // Mask: 0x4, PropSize: 0x10x7(0x1)(None)
	uint8                                        bOverride_BloomConvolutionPreFilter : 1;           // Mask: 0x8, PropSize: 0x10x7(0x1)(None)
	uint8                                        bOverride_BloomConvolutionPreFilterMin : 1;        // Mask: 0x10, PropSize: 0x10x7(0x1)(None)
	uint8                                        bOverride_BloomConvolutionPreFilterMax : 1;        // Mask: 0x20, PropSize: 0x10x7(0x1)(None)
	uint8                                        bOverride_BloomConvolutionPreFilterMult : 1;       // Mask: 0x40, PropSize: 0x10x7(0x1)(None)
