#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x1E52 (0x219A - 0x348)
// AnimBlueprintGeneratedClass FPVWeaponAnimBP_Base_Carrying.FPVWeaponAnimBP_Base_Carrying_C
class UFPVWeaponAnimBP_Base_Carrying_C : public UAnimInstance
{
public:
	uint8                                        Pad_461E[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x350(0x8)(AssetRegistrySearchable, SimpleDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimBlueprintGeneratedMutableData    __AnimBlueprintMutables;                           // 0x358(0x31)(ContainsInstancedReference, SimpleDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	uint8                                        Pad_461F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimSubsystemInstance                AnimBlueprintExtension_PropertyAccess;             // 0x390(0x8)(SimpleDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimSubsystemInstance                AnimBlueprintExtension_Base;                       // 0x398(0x8)(ContainsInstancedReference, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_Root                        AnimGraphNode_Root;                                // 0x3A0(0x20)(AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_1;                              // 0x3C0(0x48)(ContainsInstancedReference, Protected, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_16;                 // 0x408(0x28)(Protected, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_15;                 // 0x430(0x28)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_14;                 // 0x458(0x28)(AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_13;                 // 0x480(0x28)(ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_12;                 // 0x4A8(0x28)(SimpleDisplay, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_11;                 // 0x4D0(0x28)(ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_10;                 // 0x4F8(0x28)(AssetRegistrySearchable, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9;                  // 0x520(0x28)(ContainsInstancedReference, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8;                  // 0x548(0x28)(AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7;                  // 0x570(0x28)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6;                  // 0x598(0x28)(AssetRegistrySearchable, SimpleDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5;                  // 0x5C0(0x28)(ContainsInstancedReference, SimpleDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4;                  // 0x5E8(0x28)(SimpleDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3;                  // 0x610(0x28)(ContainsInstancedReference, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2;                  // 0x638(0x28)(AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_18;                   // 0x660(0x48)(ZeroConstructor, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8;                       // 0x6A8(0x20)(AssetRegistrySearchable, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_17;                   // 0x6C8(0x48)(ZeroConstructor, ContainsInstancedReference, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_7;                       // 0x710(0x20)(BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_16;                   // 0x730(0x48)(ZeroConstructor, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_6;                       // 0x778(0x20)(AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_15;                   // 0x798(0x48)(ZeroConstructor, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_9;                   // 0x7E0(0x48)(SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_14;                   // 0x828(0x48)(ZeroConstructor, ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, Protected, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_8;                   // 0x870(0x48)(AssetRegistrySearchable, AdvancedDisplay, Protected, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_13;                   // 0x8B8(0x48)(ZeroConstructor, ContainsInstancedReference, AdvancedDisplay, Protected, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_7;                   // 0x900(0x48)(AdvancedDisplay, Protected, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_12;                   // 0x948(0x48)(ZeroConstructor, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, Protected, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_5;                       // 0x990(0x20)(AssetRegistrySearchable, SimpleDisplay, Protected, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_11;                   // 0x9B0(0x48)(ZeroConstructor, ContainsInstancedReference, SimpleDisplay, Protected, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_4;                       // 0x9F8(0x20)(SimpleDisplay, Protected, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_10;                   // 0xA18(0x48)(ZeroConstructor, ContainsInstancedReference, AssetRegistrySearchable, Protected, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_3;                       // 0xA60(0x20)(AssetRegistrySearchable, Protected, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_9;                    // 0xA80(0x48)(ZeroConstructor, ContainsInstancedReference, Protected, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_6;                   // 0xAC8(0x48)(Protected, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_8;                    // 0xB10(0x48)(ZeroConstructor, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_5;                   // 0xB58(0x48)(AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_7;                    // 0xBA0(0x48)(ZeroConstructor, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_4;                   // 0xBE8(0x48)(SimpleDisplay, AdvancedDisplay, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_6;                    // 0xC30(0x48)(ZeroConstructor, ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_2;                       // 0xC78(0x20)(AssetRegistrySearchable, AdvancedDisplay, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_1;                      // 0xC98(0xC8)(ContainsInstancedReference, AdvancedDisplay, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend;                    // 0xD60(0xE0)(ZeroConstructor, AdvancedDisplay, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1;                  // 0xE40(0x28)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult;                    // 0xE68(0x28)(AssetRegistrySearchable, SimpleDisplay, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_5;                    // 0xE90(0x48)(ZeroConstructor, ContainsInstancedReference, SimpleDisplay, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_1;                       // 0xED8(0x20)(SimpleDisplay, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_4;                    // 0xEF8(0x48)(ZeroConstructor, ContainsInstancedReference, AssetRegistrySearchable, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult;                         // 0xF40(0x20)(AssetRegistrySearchable, BlueprintCallable, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine;                        // 0xF60(0xC8)(ContainsInstancedReference, AssetRegistrySearchable, BlueprintCallable, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	uint8                                        Pad_4622[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_6;                        // 0x1030(0x1A0)(ZeroConstructor, AssetRegistrySearchable, BlueprintCallable, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;             // 0x11D0(0x20)(ContainsInstancedReference, BlueprintCallable, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;             // 0x11F0(0x20)(BlueprintCallable, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_5;                        // 0x1210(0x1A0)(ZeroConstructor, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x13B0(0x20)(AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x13D0(0x20)(ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_Slot                        AnimGraphNode_Slot;                                // 0x13F0(0x48)(SimpleDisplay, AdvancedDisplay, Protected, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3;                    // 0x1438(0x48)(ZeroConstructor, ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, Protected, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2;                    // 0x1480(0x48)(ZeroConstructor, AssetRegistrySearchable, AdvancedDisplay, Protected, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x14C8(0x20)(ContainsInstancedReference, AdvancedDisplay, Protected, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x14E8(0x20)(AdvancedDisplay, Protected, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_3;                   // 0x1508(0x48)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, Protected, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_4;                        // 0x1550(0x1A0)(ZeroConstructor, AssetRegistrySearchable, SimpleDisplay, Protected, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_2;                   // 0x16F0(0x48)(ContainsInstancedReference, SimpleDisplay, Protected, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_1;                   // 0x1738(0x48)(SimpleDisplay, Protected, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1;                    // 0x1780(0x48)(ZeroConstructor, ContainsInstancedReference, AssetRegistrySearchable, Protected, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x17C8(0x20)(AssetRegistrySearchable, Protected, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x17E8(0x20)(ContainsInstancedReference, Protected, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	uint8                                        Pad_4623[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_3;                        // 0x1810(0x1A0)(ZeroConstructor, Protected, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose;                      // 0x19B0(0x108)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	uint8                                        Pad_4624[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_2;                        // 0x1AC0(0x1A0)(ZeroConstructor, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose;                       // 0x1C60(0x28)(ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool;                     // 0x1C88(0x48)(SimpleDisplay, AdvancedDisplay, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer;                      // 0x1CD0(0x48)(ZeroConstructor, ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1D18(0x20)(AssetRegistrySearchable, AdvancedDisplay, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1D38(0x20)(ContainsInstancedReference, AdvancedDisplay, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	uint8                                        Pad_4625[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_1;                        // 0x1D60(0x1A0)(ZeroConstructor, AdvancedDisplay, BlueprintAuthorityOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone;                          // 0x1F00(0x1A0)(ZeroConstructor)
	bool                                         IsRunning;                                         // 0x20A0(0x1)(None)
	bool                                         IsTargeting;                                       // 0x20A1(0x1)(None)
	bool                                         bIsMoving;                                         // 0x20A2(0x1)(None)
	bool                                         bUseMoving;                                        // 0x20A3(0x1)(None)
	uint8                                        Pad_4626[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       MovementAnimRate;                                  // 0x20A8(0x8)(None)
	bool                                         bIsSwimming;                                       // 0x20B0(0x1)(None)
	bool                                         bUseSwimming;                                      // 0x20B1(0x1)(None)
	uint8                                        Pad_4627[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       LastSwimmingTime;                                  // 0x20B8(0x8)(None)
	bool                                         bUseInventory;                                     // 0x20C0(0x1)(None)
	bool                                         bIsInventory;                                      // 0x20C1(0x1)(None)
	uint8                                        Pad_4628[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               DefaultTranslation;                                // 0x20C8(0x18)(None)
	bool                                         bUseNoClipAmmoIdle;                                // 0x20E0(0x1)(None)
	bool                                         bHasClipAmmo;                                      // 0x20E1(0x1)(None)
	bool                                         bIsUsingShield;                                    // 0x20E2(0x1)(None)
	uint8                                        Pad_4629[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       UsingShieldWeight;                                 // 0x20E8(0x8)(None)
	bool                                         bIsBlockingWithShield;                             // 0x20F0(0x1)(None)
	uint8                                        Pad_462A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               BlockingShieldTranslation;                         // 0x20F8(0x18)(None)
	double                                       BlockingShieldWeight;                              // 0x2110(0x8)(None)
	struct FRotator                              BlockingShieldRotation;                            // 0x2118(0x18)(None)
	bool                                         bUseCarryingAnimation;                             // 0x2130(0x1)(None)
	bool                                         bIsClimbing;                                       // 0x2131(0x1)(None)
	uint8                                        Pad_462B[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       ClimbingRate;                                      // 0x2138(0x8)(None)
	double                                       ClimbAnimSpeedMultiplier;                          // 0x2140(0x8)(None)
	double                                       MaxClimbingRate;                                   // 0x2148(0x8)(None)
	bool                                         IsNearLadderTop;                                   // 0x2150(0x1)(None)
	bool                                         IsDraggingCharacter;                               // 0x2151(0x1)(None)
	uint8                                        Pad_462C[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       MaxSwimRate;                                       // 0x2158(0x8)(None)
	double                                       SwimPowerMult;                                     // 0x2160(0x8)(None)
	double                                       SwimRate;                                          // 0x2168(0x8)(None)
	bool                                         bIsUsingGliderSuit;                                // 0x2170(0x1)(None)
	bool                                         bPreventSwimmingAnims;                             // 0x2171(0x1)(None)
	uint8                                        Pad_462D[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       SwimmingOnSurfaceAlpha;                            // 0x2178(0x8)(None)
	float                                        DefaultTransformAlpha;                             // 0x2180(0x4)(None)
	uint8                                        Pad_462E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       LastStartMoveTime;                                 // 0x2188(0x8)(None)
	double                                       LastMovedForDurationStopTime;                      // 0x2190(0x8)(None)
	bool                                         bHasMovedForDuration;                              // 0x2198(0x1)(None)
	bool                                         bShouldUseNonRunMovementAnim;                      // 0x2199(0x1)(None)

	static class UClass* StaticClass();
	static class UFPVWeaponAnimBP_Base_Carrying_C* GetDefaultObj();

	void AnimGraph(const struct FPoseLink& AnimGraph);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVWeaponAnimBP_Base_Carrying_AnimGraphNode_TransitionResult_80BFA98C4CD37EBCF07EEC857A2229F5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVWeaponAnimBP_Base_Carrying_AnimGraphNode_TransitionResult_62FC01B340CC6EB1F23009A48B4FD947();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVWeaponAnimBP_Base_Carrying_AnimGraphNode_ModifyBone_70A04D6E48386E0DFEA18CA4F032C0F0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVWeaponAnimBP_Base_Carrying_AnimGraphNode_BlendListByBool_9EA20B4E41810D6AE8627299ED89781A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVWeaponAnimBP_Base_Carrying_AnimGraphNode_ModifyBone_8750F37449831C164C5B298D622C2A40();
