#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x20F (0x210 - 0x1)
// ScriptStruct FPVWeaponAnimBP_Base_Carrying.FPVWeaponAnimBP_Base_Carrying_C.AnimBlueprintGeneratedConstantData
struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                        Pad_462F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  __NameProperty_471;                                // 0x4(0x8)(None)
	class FName                                  __NameProperty_472;                                // 0xC(0x8)(None)
	int32                                        __IntProperty_473;                                 // 0x14(0x4)(None)
	class FName                                  __NameProperty_474;                                // 0x18(0x8)(None)
	int32                                        __IntProperty_475;                                 // 0x20(0x4)(None)
	class FName                                  __NameProperty_476;                                // 0x24(0x8)(None)
	int32                                        __IntProperty_477;                                 // 0x2C(0x4)(None)
	enum class EAlphaBlendOption                 __EnumProperty_478;                                // 0x30(0x1)(None)
	uint8                                        Pad_4630[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  __NameProperty_479;                                // 0x34(0x8)(None)
	int32                                        __IntProperty_480;                                 // 0x3C(0x4)(None)
	class FName                                  __NameProperty_481;                                // 0x40(0x8)(None)
	int32                                        __IntProperty_482;                                 // 0x48(0x4)(None)
	class FName                                  __NameProperty_483;                                // 0x4C(0x8)(None)
	uint8                                        Pad_4631[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                __ArrayProperty_484;                               // 0x58(0x10)(AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	class FName                                  __NameProperty_485;                                // 0x68(0x8)(None)
	TArray<float>                                __ArrayProperty_486;                               // 0x70(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	enum class EAlphaBlendOption                 __EnumProperty_487;                                // 0x80(0x1)(None)
	uint8                                        Pad_4632[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                __ArrayProperty_488;                               // 0x88(0x10)(ContainsInstancedReference, AdvancedDisplay, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	enum class EAnimSyncMethod                   __EnumProperty_489;                                // 0x98(0x1)(None)
	uint8                                        Pad_4633[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  __NameProperty_490;                                // 0x9C(0x8)(None)
	class FName                                  __NameProperty_491;                                // 0xA4(0x8)(None)
	class FName                                  __NameProperty_492;                                // 0xAC(0x8)(None)
	int32                                        __IntProperty_493;                                 // 0xB4(0x4)(None)
	class FName                                  __NameProperty_494;                                // 0xB8(0x8)(None)
	int32                                        __IntProperty_495;                                 // 0xC0(0x4)(None)
	uint8                                        Pad_4634[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                __ArrayProperty_496;                               // 0xC8(0x10)(AdvancedDisplay, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<float>                                __ArrayProperty_497;                               // 0xD8(0x10)(SimpleDisplay, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	class UBlendProfile*                         __BlendProfile_498;                                // 0xE8(0x8)(ZeroConstructor)
	class UCurveFloat*                           __CurveFloat_499;                                  // 0xF0(0x8)(ZeroConstructor)
	enum class EAlphaBlendOption                 __EnumProperty_500;                                // 0xF8(0x1)(None)
	enum class EBlendListTransitionType          __EnumProperty_501;                                // 0xF9(0x1)(None)
	uint8                                        Pad_4636[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                __ArrayProperty_502;                               // 0x100(0x10)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, Protected, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	bool                                         __BoolProperty_503;                                // 0x110(0x1)(None)
	uint8                                        Pad_4637[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        __FloatProperty_504;                               // 0x114(0x4)(None)
	struct FInputScaleBiasClampConstants         __StructProperty_505;                              // 0x118(0x2C)(None)
	float                                        __FloatProperty_506;                               // 0x144(0x4)(None)
	bool                                         __BoolProperty_507;                                // 0x148(0x1)(None)
	enum class EAnimSyncMethod                   __EnumProperty_508;                                // 0x149(0x1)(None)
	enum class EAnimGroupRole                    __ByteProperty_509;                                // 0x14A(0x1)(None)
	uint8                                        Pad_4639[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  __NameProperty_510;                                // 0x14C(0x8)(None)
	uint8                                        Pad_463B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNodeFunctionRef                  __StructProperty_511;                              // 0x158(0x20)(ZeroConstructor)
	struct FAnimSubsystem_PropertyAccess         AnimBlueprintExtension_PropertyAccess;             // 0x178(0x80)(ZeroConstructor, AssetRegistrySearchable, SimpleDisplay, Protected, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FAnimSubsystem_Base                   AnimBlueprintExtension_Base;                       // 0x1F8(0x18)(None)
};

// 0x30 (0x31 - 0x1)
// ScriptStruct FPVWeaponAnimBP_Base_Carrying.FPVWeaponAnimBP_Base_Carrying_C.AnimBlueprintGeneratedMutableData
struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
public:
	bool                                         __BoolProperty;                                    // 0x1(0x1)(None)
	uint8                                        Pad_463D[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        __FloatProperty_0;                                 // 0x4(0x4)(None)
	bool                                         __BoolProperty_1;                                  // 0x8(0x1)(None)
	uint8                                        Pad_463E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        __FloatProperty_2;                                 // 0xC(0x4)(None)
	bool                                         __BoolProperty_3;                                  // 0x10(0x1)(None)
	bool                                         __BoolProperty_4;                                  // 0x11(0x1)(None)
	uint8                                        Pad_463F[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        __FloatProperty_5;                                 // 0x14(0x4)(None)
	bool                                         __BoolProperty_6;                                  // 0x18(0x1)(None)
	uint8                                        Pad_4640[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        __FloatProperty_7;                                 // 0x1C(0x4)(None)
	bool                                         __BoolProperty_8;                                  // 0x20(0x1)(None)
	uint8                                        Pad_4641[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        __FloatProperty_9;                                 // 0x24(0x4)(None)
	bool                                         __BoolProperty_10;                                 // 0x28(0x1)(None)
	bool                                         __BoolProperty_11;                                 // 0x29(0x1)(None)
	bool                                         __BoolProperty_12;                                 // 0x2A(0x1)(None)
	uint8                                        Pad_4642[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        __FloatProperty_13;                                // 0x2C(0x4)(None)
	bool                                         __BoolProperty_14;                                 // 0x30(0x1)(None)
};

}


