#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xBD8 (0x24A0 - 0x18C8)
// WidgetBlueprintGeneratedClass HostSession_Switch.HostSession_Switch_C
class UHostSession_Switch_C : public UUI_HostSession
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x18C8(0x8)(AutoWeak, AssetRegistrySearchable, AdvancedDisplay, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash)
	class UWidgetAnimation*                      Close;                                             // 0x18D0(0x8)(Edit, ZeroConstructor)
	class UWidgetAnimation*                      Open;                                              // 0x18D8(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   AcceptPassword;                                    // 0x18E0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      ActiveEventTextBlock;                              // 0x18E8(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             AdminLogging;                                      // 0x18F0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      AdminTextField;                                    // 0x18F8(0x8)(Edit, ZeroConstructor)
	class UButton*                               AdvancedSettingsButton;                            // 0x1900(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             AllowAnyoneBabyImprintCuddle;                      // 0x1908(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             AllowCaveBuildingPvE;                              // 0x1910(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             AllowCustomRecipes;                                // 0x1918(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             AllowFlyerCarryPvE;                                // 0x1920(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             AllowFlyerSpeedLevelingCheckbox;                   // 0x1928(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             AllowMultiplePlatformFloorsCheckBox;               // 0x1930(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             AllowRaidDinoFeeding;                              // 0x1938(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             AllowUnlimitedRespecsCheckBox;                     // 0x1940(0x8)(Edit, ZeroConstructor)
	class USlider*                               AutoPvEStartTimeSecondsSlider;                     // 0x1948(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      AutoPvEStartTimeSecondsValue;                      // 0x1950(0x8)(Edit, ZeroConstructor)
	class USlider*                               AutoPvEStopTimeSecondsSlider;                      // 0x1958(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      AutoPvEStopTimeSecondsValue;                       // 0x1960(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             AutoPvETimer;                                      // 0x1968(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             AutoPvEUseSystemTime;                              // 0x1970(0x8)(Edit, ZeroConstructor)
	class USlider*                               BabyCuddleGracePeriodMultiplierSlider;             // 0x1978(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      BabyCuddleGracePeriodMultiplierValue;              // 0x1980(0x8)(Edit, ZeroConstructor)
	class USlider*                               BabyCuddleIntervalMultiplierSlider;                // 0x1988(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      BabyCuddleIntervalMultiplierValue;                 // 0x1990(0x8)(Edit, ZeroConstructor)
	class USlider*                               BabyCuddleLoseImprintQualitySpeedMultiplierSlider; // 0x1998(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      BabyCuddleLoseImprintQualitySpeedMultiplierValue;  // 0x19A0(0x8)(Edit, ZeroConstructor)
	class USlider*                               BabyFoodConsumptionSpeedSlider;                    // 0x19A8(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      BabyFoodConsumptionSpeedValue;                     // 0x19B0(0x8)(Edit, ZeroConstructor)
	class USlider*                               BabyImprintingStatScaleMultiplierSlider;           // 0x19B8(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      BabyImprintingStatScaleMultiplierValue;            // 0x19C0(0x8)(Edit, ZeroConstructor)
	class USlider*                               BabyMatureSpeedSlider;                             // 0x19C8(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      BabyMatureSpeedValue;                              // 0x19D0(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   CancelButton;                                      // 0x19D8(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   CancelPassword;                                    // 0x19E0(0x8)(Edit, ZeroConstructor)
	class UButton*                               CancelUploadSaveFileButton;                        // 0x19E8(0x8)(Edit, ZeroConstructor)
	class USlider*                               CorpseDecompositionTimeSlider;                     // 0x19F0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      CorpseDecompositionTimeValue;                      // 0x19F8(0x8)(Edit, ZeroConstructor)
	class USlider*                               CraftingSkillBonusSlider;                          // 0x1A00(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      CraftingSkillBonusValue;                           // 0x1A08(0x8)(Edit, ZeroConstructor)
	class USlider*                               CraftXPMultiplierSlider;                           // 0x1A10(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      CraftXPMultiplierValue;                            // 0x1A18(0x8)(Edit, ZeroConstructor)
	class UImage*                                CreatureBottomBorder;                              // 0x1A20(0x8)(Edit, ZeroConstructor)
	class UImage*                                CreatureTopBorder;                                 // 0x1A28(0x8)(Edit, ZeroConstructor)
	class USlider*                               CropDecaySpeedSlider;                              // 0x1A30(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      CropDecaySpeedValue;                               // 0x1A38(0x8)(Edit, ZeroConstructor)
	class USlider*                               CropGrowthSpeedSlider;                             // 0x1A40(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      CropGrowthSpeedValue;                              // 0x1A48(0x8)(Edit, ZeroConstructor)
	class USlider*                               CustomRecipeEffectivenessSlider;                   // 0x1A50(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      CustomRecipeEffectivenessValue;                    // 0x1A58(0x8)(Edit, ZeroConstructor)
	class USlider*                               CustomRecipeSkillSlider;                           // 0x1A60(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      CustomRecipeSkillValue;                            // 0x1A68(0x8)(Edit, ZeroConstructor)
	class USlider*                               DayCycleSpeedSlider;                               // 0x1A70(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      DayCycleSpeedValue;                                // 0x1A78(0x8)(Edit, ZeroConstructor)
	class USlider*                               DayTimeSpeedSlider;                                // 0x1A80(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      DayTimeSpeedValue;                                 // 0x1A88(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             DestroyOldBiomeStructuresAndDinos;                 // 0x1A90(0x8)(Edit, ZeroConstructor)
	class USlider*                               DifficultySlider;                                  // 0x1A98(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      DifficultyValue;                                   // 0x1AA0(0x8)(Edit, ZeroConstructor)
	class USlider*                               DinoCharacterFoodDrainSlider;                      // 0x1AA8(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      DinoCharacterFoodDrainValue;                       // 0x1AB0(0x8)(Edit, ZeroConstructor)
	class USlider*                               DinoCharacterHealthRecoverySlider;                 // 0x1AB8(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      DinoCharacterHealthRecoveryValue;                  // 0x1AC0(0x8)(Edit, ZeroConstructor)
	class USlider*                               DinoCharacterStaminaDrainSlider;                   // 0x1AC8(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      DinoCharacterStaminaDrainValue;                    // 0x1AD0(0x8)(Edit, ZeroConstructor)
	class USlider*                               DinoCountSlider;                                   // 0x1AD8(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      DinoCountValue;                                    // 0x1AE0(0x8)(Edit, ZeroConstructor)
	class USlider*                               DinoDamageSlider;                                  // 0x1AE8(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      DinoDamageValue;                                   // 0x1AF0(0x8)(Edit, ZeroConstructor)
	class USlider*                               DinoHarvestingDamageSlider;                        // 0x1AF8(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      DinoHarvestingDamageValue;                         // 0x1B00(0x8)(Edit, ZeroConstructor)
	class USlider*                               DinoResistanceSlider;                              // 0x1B08(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      DinoResistanceValue;                               // 0x1B10(0x8)(Edit, ZeroConstructor)
	class USlider*                               DinoTurretDamageSlider;                            // 0x1B18(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      DinoTurretDamageValue;                             // 0x1B20(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             DisableDinoDecayPvE;                               // 0x1B28(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             DisableDinoRidingCheckbox;                         // 0x1B30(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             DisableDinoTameCheckbox;                           // 0x1B38(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             DisableFriendlyFire;                               // 0x1B40(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             DisableImprintDinoBuff;                            // 0x1B48(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             DisableLootCrates;                                 // 0x1B50(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             DisablePvEGamma;                                   // 0x1B58(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             DisableStructureDecayPvE;                          // 0x1B60(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             DisableStructurePlacementCollisionCheckbox;        // 0x1B68(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   EasyPresetButton;                                  // 0x1B70(0x8)(Edit, ZeroConstructor)
	class USlider*                               EggHatchSpeedSlider;                               // 0x1B78(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      EggHatchSpeedValue;                                // 0x1B80(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             EnableExtraStructurePreventionVolumes;             // 0x1B88(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             EnablePvPGamma;                                    // 0x1B90(0x8)(Edit, ZeroConstructor)
	class UButton*                               EngramsButton;                                     // 0x1B98(0x8)(Edit, ZeroConstructor)
	class USlider*                               FishingLootQualitySlider;                          // 0x1BA0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      FishingLootQualityValue;                           // 0x1BA8(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             FlyerPlatformAllowUnalignedDinoBasing;             // 0x1BB0(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             ForceAllowCaveFlyers;                              // 0x1BB8(0x8)(Edit, ZeroConstructor)
	class USlider*                               FuelConsumptionIntervalMultiplierSlider;           // 0x1BC0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      FuelConsumptionIntervalMultiplierValue;            // 0x1BC8(0x8)(Edit, ZeroConstructor)
	class UButton*                               GeneralSettingsButton;                             // 0x1BD0(0x8)(Edit, ZeroConstructor)
	class USlider*                               GenericXPMultiplierSlider;                         // 0x1BD8(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      GenericXPMultiplierValue;                          // 0x1BE0(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             GlobalVoiceChatCheckbox;                           // 0x1BE8(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   HardPresetButton;                                  // 0x1BF0(0x8)(Edit, ZeroConstructor)
	class USlider*                               HarvestAmountSlider;                               // 0x1BF8(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      HarvestAmountValue;                                // 0x1C00(0x8)(Edit, ZeroConstructor)
	class USlider*                               HarvestHealthSlider;                               // 0x1C08(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      HarvestHealthValue;                                // 0x1C10(0x8)(Edit, ZeroConstructor)
	class USlider*                               HarvestXPMultiplierSlider;                         // 0x1C18(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      HarvestXPMultiplierValue;                          // 0x1C20(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   HostSessionButton;                                 // 0x1C28(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_42;                                          // 0x1C30(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_132;                                         // 0x1C38(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_151;                                         // 0x1C40(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_152;                                         // 0x1C48(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_161;                                         // 0x1C50(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_171;                                         // 0x1C58(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_177;                                         // 0x1C60(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_178;                                         // 0x1C68(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_179;                                         // 0x1C70(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_180;                                         // 0x1C78(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_181;                                         // 0x1C80(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_186;                                         // 0x1C88(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_430;                                         // 0x1C90(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_814;                                         // 0x1C98(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_815;                                         // 0x1CA0(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_1189;                                        // 0x1CA8(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_1190;                                        // 0x1CB0(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_1927;                                        // 0x1CB8(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_1928;                                        // 0x1CC0(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_2711;                                        // 0x1CC8(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_2712;                                        // 0x1CD0(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_3512;                                        // 0x1CD8(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_3513;                                        // 0x1CE0(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_4614;                                        // 0x1CE8(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_4615;                                        // 0x1CF0(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_5468;                                        // 0x1CF8(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_5469;                                        // 0x1D00(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_8080;                                        // 0x1D08(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_8081;                                        // 0x1D10(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             IncreasePvPRespawnInterval;                        // 0x1D18(0x8)(Edit, ZeroConstructor)
	class USlider*                               IncreasePvPRespawnIntervalBaseAmountSlider;        // 0x1D20(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      IncreasePvPRespawnIntervalBaseAmountValue;         // 0x1D28(0x8)(Edit, ZeroConstructor)
	class USlider*                               IncreasePvPRespawnIntervalCheckPeriodSlider;       // 0x1D30(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      IncreasePvPRespawnIntervalCheckPeriodValue;        // 0x1D38(0x8)(Edit, ZeroConstructor)
	class USlider*                               IncreasePvPRespawnIntervalSlider;                  // 0x1D40(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      IncreasePvPRespawnIntervalValue;                   // 0x1D48(0x8)(Edit, ZeroConstructor)
	class USlider*                               ItemDecompositionTimeSlider;                       // 0x1D50(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      ItemDecompositionTimeValue;                        // 0x1D58(0x8)(Edit, ZeroConstructor)
	class USlider*                               KillXPMultiplierSlider;                            // 0x1D60(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      KillXPMultiplierValue;                             // 0x1D68(0x8)(Edit, ZeroConstructor)
	class USlider*                               LayEggIntervalSlider;                              // 0x1D70(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      LayEggIntervalValue;                               // 0x1D78(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      ListenServerTetherDistanceMultiplier;              // 0x1D80(0x8)(Edit, ZeroConstructor)
	class USlider*                               ListenServerTetherDistanceMultiplierSlider;        // 0x1D88(0x8)(Edit, ZeroConstructor)
	class UMapSelect_Entry_C*                    MapSelect_Entry;                                   // 0x1D90(0x8)(Edit, ZeroConstructor)
	class UMapSelect_Session_C*                  MapSelect_Session;                                 // 0x1D98(0x8)(Edit, ZeroConstructor)
	class UCanvasPanel*                          MapSelection;                                      // 0x1DA0(0x8)(Edit, ZeroConstructor)
	class USlider*                               MatingIntervalSlider;                              // 0x1DA8(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      MatingIntervalValue;                               // 0x1DB0(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             MaxDifficultyCheckbox;                             // 0x1DB8(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      MaxExperienceDinoEditBox;                          // 0x1DC0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      MaxExperiencePlayerEditBox;                        // 0x1DC8(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      MaxNumberOfPlayersInTribeEditBox;                  // 0x1DD0(0x8)(Edit, ZeroConstructor)
	class USlider*                               MaxStructuresInRange;                              // 0x1DD8(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      MaxStructuresInRangeValue;                         // 0x1DE0(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   MediumPresetButton;                                // 0x1DE8(0x8)(Edit, ZeroConstructor)
	class USlider*                               NightTimeSpeedSlider;                              // 0x1DF0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      NightTimeSpeedValue;                               // 0x1DF8(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             NonPermanentDiseases;                              // 0x1E00(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             NotifyPlayerJoinedCheckbox;                        // 0x1E08(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             NotifyPlayerLeftCheckbox;                          // 0x1E10(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             NoTributesDownloadsCheckbox;                       // 0x1E18(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             OnlyAllowSpecifiedEngrams;                         // 0x1E20(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             OverideStructurePlatformPrevention;                // 0x1E28(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             OverwriteMapWithBackupChkBox;                      // 0x1E30(0x8)(Edit, ZeroConstructor)
	class UWidgetSwitcher*                       PanelSwitcher;                                     // 0x1E38(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             PassiveDefensesDamageRiderlessDinos;               // 0x1E40(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PasswordField;                                     // 0x1E48(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamed_Damage_Slider;              // 0x1E50(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamed_Damage_Value;               // 0x1E58(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamed_Food_Slider;                // 0x1E60(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamed_Food_Value;                 // 0x1E68(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamed_Health_Slider;              // 0x1E70(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamed_Health_Value;               // 0x1E78(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamed_Oxygen_Slider;              // 0x1E80(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamed_Oxygen_Value;               // 0x1E88(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamed_Speed_Slider;               // 0x1E90(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamed_Speed_Value;                // 0x1E98(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamed_Stamina_Slider;             // 0x1EA0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamed_Stamina_Value;              // 0x1EA8(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamed_Temperature_Slider;         // 0x1EB0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamed_Temperature_Value;          // 0x1EB8(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamed_TemperatureFortitude_Slider; // 0x1EC0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamed_TemperatureFortitude_Value; // 0x1EC8(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamed_Torpidity_Slider;           // 0x1ED0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamed_Torpidity_Value;            // 0x1ED8(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamed_Water_Slider;               // 0x1EE0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamed_Water_Value;                // 0x1EE8(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamed_Weight_Slider;              // 0x1EF0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamed_Weight_Value;               // 0x1EF8(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamedAdd_Damage_Slider;           // 0x1F00(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamedAdd_Damage_Value;            // 0x1F08(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamedAdd_Food_Slider;             // 0x1F10(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamedAdd_Food_Value;              // 0x1F18(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamedAdd_Health_Slider;           // 0x1F20(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamedAdd_Health_Value;            // 0x1F28(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamedAdd_Oxygen_Slider;           // 0x1F30(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamedAdd_Oxygen_Value;            // 0x1F38(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamedAdd_Speed_Slider;            // 0x1F40(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamedAdd_Speed_Value;             // 0x1F48(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamedAdd_Stamina_Slider;          // 0x1F50(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamedAdd_Stamina_Value;           // 0x1F58(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamedAdd_Temperature_Slider;      // 0x1F60(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamedAdd_Temperature_Value;       // 0x1F68(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamedAdd_TemperatureFortitude_Slider; // 0x1F70(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamedAdd_TemperatureFortitude_Value; // 0x1F78(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamedAdd_Torpidity_Slider;        // 0x1F80(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamedAdd_Torpidity_Value;         // 0x1F88(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamedAdd_Water_Slider;            // 0x1F90(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamedAdd_Water_Value;             // 0x1F98(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamedAdd_Weight_Slider;           // 0x1FA0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamedAdd_Weight_Value;            // 0x1FA8(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamedAff_Damage_Slider;           // 0x1FB0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamedAff_Damage_Value;            // 0x1FB8(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamedAff_Food_Slider;             // 0x1FC0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamedAff_Food_Value;              // 0x1FC8(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamedAff_Health_Slider;           // 0x1FD0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamedAff_Health_Value;            // 0x1FD8(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamedAff_Oxygen_Slider;           // 0x1FE0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamedAff_Oxygen_Value;            // 0x1FE8(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamedAff_Speed_Slider;            // 0x1FF0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamedAff_Speed_Value;             // 0x1FF8(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamedAff_Stamina_Slider;          // 0x2000(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamedAff_Stamina_Value;           // 0x2008(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamedAff_Temperature_Slider;      // 0x2010(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamedAff_Temperature_Value;       // 0x2018(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamedAff_TemperatureFortitude_Slider; // 0x2020(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamedAff_TemperatureFortitude_Value; // 0x2028(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamedAff_Torpidity_Slider;        // 0x2030(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamedAff_Torpidity_Value;         // 0x2038(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamedAff_Water_Slider;            // 0x2040(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamedAff_Water_Value;             // 0x2048(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoTamedAff_Weight_Slider;           // 0x2050(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoTamedAff_Weight_Value;            // 0x2058(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoWild_Damage_Slider;               // 0x2060(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoWild_Damage_Value;                // 0x2068(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoWild_Food_Slider;                 // 0x2070(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoWild_Food_Value;                  // 0x2078(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoWild_Health_Slider;               // 0x2080(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoWild_Health_Value;                // 0x2088(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoWild_Oxygen_Slider;               // 0x2090(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoWild_Oxygen_Value;                // 0x2098(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoWild_Speed_Slider;                // 0x20A0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoWild_Speed_Value;                 // 0x20A8(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoWild_Stamina_Slider;              // 0x20B0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoWild_Stamina_Value;               // 0x20B8(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoWild_Temperature_Slider;          // 0x20C0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoWild_Temperature_Value;           // 0x20C8(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoWild_TemperatureFortitude_Slider; // 0x20D0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoWild_TemperatureFortitude_Value;  // 0x20D8(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoWild_Torpidity_Slider;            // 0x20E0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoWild_Torpidity_Value;             // 0x20E8(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoWild_Water_Slider;                // 0x20F0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoWild_Water_Value;                 // 0x20F8(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsDinoWild_Weight_Slider;               // 0x2100(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsDinoWild_Weight_Value;                // 0x2108(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsPlayer_Damage_Slider;                 // 0x2110(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsPlayer_Damage_Value;                  // 0x2118(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsPlayer_Food_Slider;                   // 0x2120(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsPlayer_Food_Value;                    // 0x2128(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsPlayer_Health_Slider;                 // 0x2130(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsPlayer_Health_Value;                  // 0x2138(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsPlayer_Oxygen_Slider;                 // 0x2140(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsPlayer_Oxygen_Value;                  // 0x2148(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsPlayer_Speed_Slider;                  // 0x2150(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsPlayer_Speed_Value;                   // 0x2158(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsPlayer_Stamina_Slider;                // 0x2160(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsPlayer_Stamina_Value;                 // 0x2168(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsPlayer_Temperature_Slider;            // 0x2170(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsPlayer_Temperature_Value;             // 0x2178(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsPlayer_TemperatureFortitude_Slider;   // 0x2180(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsPlayer_TemperatureFortitude_Value;    // 0x2188(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsPlayer_Torpidity_Slider;              // 0x2190(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsPlayer_Torpidity_Value;               // 0x2198(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsPlayer_Water_Slider;                  // 0x21A0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsPlayer_Water_Value;                   // 0x21A8(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerLevelStatsPlayer_Weight_Slider;                 // 0x21B0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerLevelStatsPlayer_Weight_Value;                  // 0x21B8(0x8)(Edit, ZeroConstructor)
	class USlider*                               PerPlatformMaxStructuresMultiplier_Slider;         // 0x21C0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PerPlatformMaxStructuresMultiplier_Value;          // 0x21C8(0x8)(Edit, ZeroConstructor)
	class USlider*                               PlayerCharacterFoodDrainSlider;                    // 0x21D0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PlayerCharacterFoodDrainValue;                     // 0x21D8(0x8)(Edit, ZeroConstructor)
	class USlider*                               PlayerCharacterHealthRecoverySlider;               // 0x21E0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PlayerCharacterHealthRecoveryValue;                // 0x21E8(0x8)(Edit, ZeroConstructor)
	class USlider*                               PlayerCharacterStaminaDrainSlider;                 // 0x21F0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PlayerCharacterStaminaDrainValue;                  // 0x21F8(0x8)(Edit, ZeroConstructor)
	class USlider*                               PlayerCharacterWaterDrainSlider;                   // 0x2200(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PlayerCharacterWaterDrainValue;                    // 0x2208(0x8)(Edit, ZeroConstructor)
	class USlider*                               PlayerDamageSlider;                                // 0x2210(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PlayerDamageValue;                                 // 0x2218(0x8)(Edit, ZeroConstructor)
	class USlider*                               PlayerHarvestingDamageSlider;                      // 0x2220(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PlayerHarvestingDamageValue;                       // 0x2228(0x8)(Edit, ZeroConstructor)
	class USlider*                               PlayerResistanceSlider;                            // 0x2230(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PlayerResistanceValue;                             // 0x2238(0x8)(Edit, ZeroConstructor)
	class USlider*                               PoopIntervalSlider;                                // 0x2240(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PoopIntervalValue;                                 // 0x2248(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             PreventDiseases;                                   // 0x2250(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             PreventDownloadDinos;                              // 0x2258(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             PreventDownloadItems;                              // 0x2260(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             PreventDownloadSurvivors;                          // 0x2268(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             PreventOfflinePvP;                                 // 0x2270(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PreventOfflinePvPIntervalEditBox;                  // 0x2278(0x8)(Edit, ZeroConstructor)
	class USlider*                               PreventOfflinePvPIntervalSlider;                   // 0x2280(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             PreventTribeAlliances;                             // 0x2288(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             PrivateMatchCB;                                    // 0x2290(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             ProximityChatCheckbox;                             // 0x2298(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             PvEAllowTribeWar;                                  // 0x22A0(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             PvEAllowTribeWarCancel;                            // 0x22A8(0x8)(Edit, ZeroConstructor)
	class USlider*                               PvEDinoDecayPeriodSlider;                          // 0x22B0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PvEDinoDecayPeriodValue;                           // 0x22B8(0x8)(Edit, ZeroConstructor)
	class USlider*                               PvEStructureDecayPeriodSlider;                     // 0x22C0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PvEStructureDecayPeriodValue;                      // 0x22C8(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             PvPDinoDecay;                                      // 0x22D0(0x8)(Edit, ZeroConstructor)
	class USlider*                               PvPZoneStructureDamageSlider;                      // 0x22D8(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      PvPZoneStructureDamageValue;                       // 0x22E0(0x8)(Edit, ZeroConstructor)
	class USlider*                               RaidDinoCharacterFoodDrainMultiplierSlider;        // 0x22E8(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      RaidDinoCharacterFoodDrainMultiplierValue;         // 0x22F0(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   ResetSettings;                                     // 0x22F8(0x8)(Edit, ZeroConstructor)
	class USlider*                               ResourceNoReplenishRadiusPlayersSlider;            // 0x2300(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      ResourceNoReplenishRadiusPlayersValue;             // 0x2308(0x8)(Edit, ZeroConstructor)
	class USlider*                               ResourceNoReplenishRadiusStructuresSlider;         // 0x2310(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      ResourceNoReplenishRadiusStructuresValue;          // 0x2318(0x8)(Edit, ZeroConstructor)
	class USlider*                               ResourcesRespawnPeriodSlider;                      // 0x2320(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      ResourcesRespawnPeriodValue;                       // 0x2328(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             ServerCrosshairCheckbox;                           // 0x2330(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             ServerForceNoHUDCheckbox;                          // 0x2338(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             ServerHardcoreCheckbox;                            // 0x2340(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             ServerPvECheckbox;                                 // 0x2348(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      SessionNameField;                                  // 0x2350(0x8)(Edit, ZeroConstructor)
	class UCanvasPanel*                          SessionsPanel;                                     // 0x2358(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             ShowCreativeModeCheckbox;                          // 0x2360(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             ShowFloatingDamageText;                            // 0x2368(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             ShowMapPlayerLocationCheckbox;                     // 0x2370(0x8)(Edit, ZeroConstructor)
	class USlider*                               SpecialXPMultiplierSlider;                         // 0x2378(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      SpecialXPMultiplierValue;                          // 0x2380(0x8)(Edit, ZeroConstructor)
	class USlider*                               SpoilingTimeSlider;                                // 0x2388(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      SpoilingTimeValue;                                 // 0x2390(0x8)(Edit, ZeroConstructor)
	class USlider*                               StructureDamageRepairCooldownSlider;               // 0x2398(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      StructureDamageRepairCooldownValue;                // 0x23A0(0x8)(Edit, ZeroConstructor)
	class USlider*                               StructureDamageSlider;                             // 0x23A8(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      StructureDamageValue;                              // 0x23B0(0x8)(Edit, ZeroConstructor)
	class USlider*                               StructurePreventResourceRadiusMultiplierSlider;    // 0x23B8(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      StructurePreventResourceRadiusMultiplierValue;     // 0x23C0(0x8)(Edit, ZeroConstructor)
	class USlider*                               StructureResistanceSlider;                         // 0x23C8(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      StructureResistanceValue;                          // 0x23D0(0x8)(Edit, ZeroConstructor)
	class USlider*                               SupplyCrateLootQualitySlider;                      // 0x23D8(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      SupplyCrateLootQualityValue;                       // 0x23E0(0x8)(Edit, ZeroConstructor)
	class UImage*                                Tab3_Crafting;                                     // 0x23E8(0x8)(Edit, ZeroConstructor)
	class UImage*                                Tab3_Creatures;                                    // 0x23F0(0x8)(Edit, ZeroConstructor)
	class UImage*                                Tab3_Inventory;                                    // 0x23F8(0x8)(Edit, ZeroConstructor)
	class UWidgetSwitcher*                       TabBgSwitcher;                                     // 0x2400(0x8)(Edit, ZeroConstructor)
	class USlider*                               TamingSpeedSlider;                                 // 0x2408(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      TamingSpeedValue;                                  // 0x2410(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             ThirdPersonCheckbox;                               // 0x2418(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             UseCorpseLocatorCheckbox;                          // 0x2420(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             UseSingleplayerSettingsCheckbox;                   // 0x2428(0x8)(Edit, ZeroConstructor)
	class USlider*                               XPSlider;                                          // 0x2430(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      XPValue;                                           // 0x2438(0x8)(ZeroConstructor)
	TMap<class FString, int32>                   MapNameToIndex;                                    // 0x2440(0x50)(AssetRegistrySearchable, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient)
	TArray<struct FInstalledMod>                 InstalledMods;                                     // 0x2490(0x10)(None)

	static class UClass* StaticClass();
	static class UHostSession_Switch_C* GetDefaultObj();

	void BPPopulateMods(const TArray<struct FInstalledMod>& ReturnValue);
	void DoSettingsMatchAnyDefaults(bool Matches, bool CallFunc_DoesSettingsMatchSettingsDataAsset_ReturnValue, bool CallFunc_DoesSettingsMatchSettingsDataAsset_ReturnValue_1, bool CallFunc_DoesSettingsMatchSettingsDataAsset_ReturnValue_2);
	void GetSelectedMapIndex(int32 ReturnValue, int32 CallFunc_GetSelectedMapIndex_index);
	void IsInMapSelectView(bool ReturnValue, bool CallFunc_IsVisible_ReturnValue);
	void GetMapSelectScrollBox(class UScrollBox* ReturnValue);
	void MoveToMainScreen();
