#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x2DA (0x6D2 - 0x3F8)
// RigVMBlueprintGeneratedClass Human_GroundConform_CtrlRig.Human_GroundConform_CtrlRig_C
class UHuman_GroundConform_CtrlRig_C : public UControlRig
{
public:
	struct FRigPose                              Pose;                                              // 0x3F8(0x70)(AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FPBIKEffector>                 IKEffectors;                                       // 0x468(0x10)(AutoWeak, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FVector>                       EffectorPos;                                       // 0x478(0x10)(AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<double>                               Settings_TraceRadii;                               // 0x488(0x10)(AutoWeak, SimpleDisplay, AdvancedDisplay, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<double>                               Settings_TraceLengths;                             // 0x498(0x10)(ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<bool>                                 Settings_ConstrainLength;                          // 0x4A8(0x10)(AssetRegistrySearchable, AdvancedDisplay, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<double>                               Settings_BendStiffness;                            // 0x4B8(0x10)(AutoWeak, AdvancedDisplay, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<double>                               Settings_SpringDampingFactor;                      // 0x4C8(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<double>                               Settings_SpringStrengthFactor;                     // 0x4D8(0x10)(AssetRegistrySearchable, SimpleDisplay, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FPBIKBoneSetting>              PBIKBoneSettings;                                  // 0x4E8(0x10)(ContainsInstancedReference, SimpleDisplay, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         bFoundCtrlParent;                                  // 0x4F8(0x1)(None)
	uint8                                        Pad_C11[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TailAndNeck_RotationStiffness;                     // 0x4FC(0x4)(None)
	TArray<struct FRigElementKey>                SortedEffectorBones;                               // 0x500(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<int32>                                SortedRigElements_IndexArray;                      // 0x510(0x10)(AutoWeak, AssetRegistrySearchable, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FRigElementKey>                SortedParentBones;                                 // 0x520(0x10)(ContainsInstancedReference, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FQuat>                         EffectorRotations;                                 // 0x530(0x10)(BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FVector>                       TracePathPositions;                                // 0x540(0x10)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	bool                                         bBreakTracePath;                                   // 0x550(0x1)(None)
	uint8                                        Pad_C14[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               MeshScale;                                         // 0x558(0x18)(None)
	double                                       GroundConform_GravityFactor;                       // 0x570(0x8)(None)
	bool                                         GroundConform_IsBeingDragged;                      // 0x578(0x1)(None)
	bool                                         Swimming;                                          // 0x579(0x1)(None)
	bool                                         GroundConform_Motionless;                          // 0x57A(0x1)(None)
	uint8                                        Pad_C15[0x5];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigPose                              PoseLastFrame;                                     // 0x580(0x70)(None)
	bool                                         Interpolate;                                       // 0x5F0(0x1)(None)
	bool                                         IsFalling;                                         // 0x5F1(0x1)(None)
	uint8                                        Pad_C16[0xE];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RootControlTransform_LastFrame;                    // 0x600(0x60)(None)
	double                                       DetectedNoMotion_LastFrame;                        // 0x660(0x8)(None)
	uint8                                        Pad_C17[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            HipTransform_LastFrame;                            // 0x670(0x60)(None)
	bool                                         Has_Initially_Updated_Bone_Distances;              // 0x6D0(0x1)(None)
	bool                                         bHasDynamicBase_;                                  // 0x6D1(0x1)(None)

	static class UClass* StaticClass();
	static class UHuman_GroundConform_CtrlRig_C* GetDefaultObj();

};

// 0x145C (0x1484 - 0x28)
// RigVMMemoryStorageGeneratorClass Human_GroundConform_CtrlRig.RigVMMemory_Literal
class URigVMMemory_Literal : public URigVMMemoryStorage
{
public:
	struct FRigElementKey                        RigVMModel___RigUnit_SetRotation_2_Item__Const;    // 0x28(0xC)(None)
	enum class ERigVMTransformSpace              RigVMModel___RigUnit_SetRotation_2_Space__Const;   // 0x34(0x1)(None)
	bool                                         RigVMModel___RigUnit_SetRotation_2_bInitial__Const; // 0x35(0x1)(None)
	uint8                                        Pad_C1E[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               RigVMModel___RigVMFunction_MathQuaternionFromEuler_Euler__Const; // 0x38(0x18)(None)
	enum class EEulerRotationOrder               RigVMModel___RigVMFunction_MathQuaternionFromEuler_RotationOrder__Const; // 0x50(0x1)(None)
	uint8                                        Pad_C1F[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RigVMModel___RigUnit_SetRotation_2_Weight__Const;  // 0x54(0x4)(None)
	bool                                         RigVMModel___RigUnit_SetRotation_2_bPropagateToChildren__Const; // 0x58(0x1)(None)
	uint8                                        Pad_C21[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RigVMModel___GroundConformForwardsSolve_DebugDrawThickness__Const; // 0x5C(0x4)(None)
	double                                       RigVMModel___GroundConformForwardsSolve_DebugDrawScale__Const; // 0x60(0x8)(None)
	float                                        RigVMModel___GroundConformForwardsSolve_SpringStrength__Const; // 0x68(0x4)(None)
	uint8                                        Pad_C23[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       RigVMModel___GroundConformForwardsSolve_DampingFactor__Const; // 0x70(0x8)(None)
	struct FRigElementKey                        RigVMModel___GroundConformForwardsSolve_Root_Bone__Const; // 0x78(0xC)(None)
	struct FRigElementKey                        RigVMModel___GroundConformForwardsSolve_Hip_Bone__Const; // 0x84(0xC)(None)
	float                                        RigVMModel___GroundConformForwardsSolve_Effector_Rotation_Alpha__Const; // 0x90(0x4)(None)
	float                                        RigVMModel___GroundConformForwardsSolve_Effector_Pin_Rotation__Const; // 0x94(0x4)(None)
	TArray<double>                               RigVMModel___GroundConformForwardsSolve_TimingBias__Const; // 0x98(0x10)(AssetRegistrySearchable, SimpleDisplay, BlueprintCallable, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	double                                       RigVMModel___GroundConformForwardsSolve_TimingBiasSpeed__Const; // 0xA8(0x8)(None)
	float                                        RigVMModel___GroundConformForwardsSolve_ForceSleepTimeLimit__Const; // 0xB0(0x4)(None)
	bool                                         LocalVariableDefault__GroundConformForwardsSolve_bNotAppliedCachedPose__Const; // 0xB4(0x1)(None)
	bool                                         LocalVariableDefault__GroundConformForwardsSolve_bComponentMotionDetected__Const; // 0xB5(0x1)(None)
	bool                                         LocalVariableDefault__GroundConformForwardsSolve_bTempMotionDetected__Const; // 0xB6(0x1)(None)
	enum class ERigVMTransformSpace              GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_SetTransform_4_Space__Const; // 0xB7(0x1)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_SetTransform_4_bInitial__Const; // 0xB8(0x1)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_GetTransform_bInitial__Const; // 0xB9(0x1)(None)
	uint8                                        Pad_C26[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_SetTransform_4_Weight__Const; // 0xBC(0x4)(None)
	struct FTransform                            GroundConformForwardsSolve___GroundConformForwardsSolve_To_World_Value__Const; // 0xC0(0x60)(None)
	int32                                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigVMDispatch_ArrayGetAtIndex_1_2_1_Index__Const; // 0x120(0x4)(None)
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_4_Name__Const; // 0x124(0x8)(None)
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_4_1_Name__Const; // 0x12C(0x8)(None)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_4_1_Value__Const; // 0x134(0x4)(None)
	struct FRigElementKey                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_5_1_Item__Const; // 0x138(0xC)(None)
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_5_1_Name__Const; // 0x144(0x8)(None)
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_Name__Const; // 0x14C(0x8)(None)
	int32                                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_1_Value__Const; // 0x154(0x4)(None)
	bool                                         LocalVariableDefault__CheckForAnimationMotion_CallGroundConform__Const; // 0x158(0x1)(None)
	bool                                         LocalVariableDefault__CheckForAnimationMotion_DetectedPoseDifference__Const; // 0x159(0x1)(None)
	uint8                                        Pad_C28[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            LocalVariableDefault__CheckForAnimationMotion_To_World_World__Const; // 0x160(0x60)(None)
	enum class ERigVMTransformSpace              CheckForAnimationMotion___CheckForAnimationMotion_GetTransform_1_1_Space__Const; // 0x1C0(0x1)(None)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_GetTransform_1_1_bInitial__Const; // 0x1C1(0x1)(None)
	enum class ERigElementType                   CheckForAnimationMotion___CheckForAnimationMotion_HierarchyGetPoseItemArray_1_ElementType__Const; // 0x1C2(0x1)(None)
	uint8                                        Pad_C2A[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CheckForAnimationMotion___CheckForAnimationMotion_PoseGetDelta_RotationThreshold__Const; // 0x1C4(0x4)(None)
	struct FRigElementKeyCollection              CheckForAnimationMotion___CheckForAnimationMotion_PoseGetDelta_ItemsToCompare__Const; // 0x1C8(0x10)(ContainsInstancedReference, AssetRegistrySearchable, Protected, BlueprintAuthorityOnly, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         LocalVariable__FunctionLibrary___CheckForAnimationMotion_VariableNode_1_Value__Const; // 0x1D8(0x1)(None)
	uint8                                        Pad_C2C[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CheckForAnimationMotion___CheckForAnimationMotion_IsNearlyEqual_Tolerance__Const; // 0x1DC(0x4)(None)
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_2_Name__Const; // 0x1E0(0x8)(None)
	int32                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Subtract_B__Const; // 0x1E8(0x4)(None)
	enum class ERigElementType                   GroundConformForwardsSolve___GroundConformForwardsSolve_HierarchyGetPoseItemArray_ElementType__Const; // 0x1EC(0x1)(None)
	uint8                                        Pad_C2D[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FRigElementKey>                GroundConformForwardsSolve___GroundConformForwardsSolve_HierarchyGetPoseItemArray_ItemsToGet__Const; // 0x1F0(0x10)(AutoWeak, SimpleDisplay, BlueprintCallable, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_VariableNode_1_Value__Const; // 0x200(0x1)(None)
	uint8                                        Pad_C2F[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_2_Name__Const; // 0x204(0x8)(None)
	enum class ERigVMTransformSpace              Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_Space__Const; // 0x20C(0x1)(None)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_bInitial__Const; // 0x20D(0x1)(None)
	uint8                                        Pad_C31[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_Name__Const; // 0x210(0x8)(None)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_Default__Const; // 0x218(0x4)(None)
	uint8                                        Pad_C32[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Minimum_1_B__Const; // 0x220(0x8)(None)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_Name__Const; // 0x228(0x8)(None)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_Default__Const; // 0x230(0x18)(None)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_2_Name__Const; // 0x248(0x8)(None)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_Name__Const; // 0x250(0x8)(None)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_5_Name__Const; // 0x258(0x8)(None)
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_5_Default__Const; // 0x260(0xC)(None)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_1_Name__Const; // 0x26C(0x8)(None)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_2_1_1_Name__Const; // 0x274(0x8)(None)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_3_1_Name__Const; // 0x27C(0x8)(None)
	uint8                                        Pad_C33[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               LookAt_1_1___LookAt_DISPATCH_RigDispatch_CoreNotEquals_B__Const; // 0x288(0x18)(None)
	float                                        LookAt_1_1___LookAt_Scale_Factor__Const;           // 0x2A0(0x4)(None)
	uint8                                        Pad_C34[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               LookAt_1_1___LookAt_Rotate_Vector_1_Vector__Const; // 0x2A8(0x18)(None)
	TArray<struct FRigElementKey>                LocalVariableDefault__MakeArrayFromStartToEndBone_ChildrenArray__Const; // 0x2C0(0x10)(ContainsInstancedReference, AssetRegistrySearchable, BlueprintCallable, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FRigElementKey>                LocalVariableDefault__MakeArrayFromStartToEndBone_ParentsArray__Const; // 0x2D0(0x10)(AssetRegistrySearchable, BlueprintCallable, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FRigElementKey>                LocalVariableDefault__MakeArrayFromStartToEndBone_OutChain__Const; // 0x2E0(0x10)(AssetRegistrySearchable, AdvancedDisplay, BlueprintAuthorityOnly, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	bool                                         LocalVariableDefault__MakeArrayFromStartToEndBone_ChainComplete__Const; // 0x2F0(0x1)(None)
	uint8                                        Pad_C36[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_Prefix__Const; // 0x2F8(0x10)(AssetRegistrySearchable, SimpleDisplay, BlueprintAuthorityOnly, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	bool                                         MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_Enabled__Const; // 0x308(0x1)(None)
	uint8                                        Pad_C37[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_ScreenDuration__Const; // 0x30C(0x4)(None)
	struct FLinearColor                          MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_ScreenColor__Const; // 0x310(0x10)(None)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_1_Prefix__Const; // 0x320(0x10)(ContainsInstancedReference, AssetRegistrySearchable, BlueprintAuthorityOnly, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	bool                                         MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_CollectionChildrenArray_bIncludeParent__Const; // 0x330(0x1)(None)
	enum class ERigElementType                   MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_CollectionChildrenArray_TypeToSearch__Const; // 0x331(0x1)(None)
	uint8                                        Pad_C3B[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_Prefix__Const; // 0x338(0x10)(SimpleDisplay, TextExportTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_1_Prefix__Const; // 0x348(0x10)(ContainsInstancedReference, AssetRegistrySearchable, TextExportTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_2_Prefix__Const; // 0x358(0x10)(AssetRegistrySearchable, TextExportTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_2_1_Prefix__Const; // 0x368(0x10)(ContainsInstancedReference, TextExportTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_3_Prefix__Const; // 0x378(0x10)(TextExportTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_3_1_Prefix__Const; // 0x388(0x10)(AutoWeak, BlueprintCallable, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FRigElementKey>                LocalVariableDefault__CalculateLengthOfElementChain_NewLocalVar__Const; // 0x398(0x10)(AssetRegistrySearchable, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	bool                                         LocalVariableDefault__CalculateLengthOfElementChain_MathIntEquals_Result__Const; // 0x3A8(0x1)(None)
	uint8                                        Pad_C3F[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        LocalVariableDefault__CalculateLengthOfElementChain_numBones__Const; // 0x3AC(0x4)(None)
	float                                        LocalVariableDefault__CalculateLengthOfElementChain_currentDistance__Const; // 0x3B0(0x4)(None)
	float                                        LocalVariableDefault__CalculateLengthOfElementChain_averageDistance__Const; // 0x3B4(0x4)(None)
	class FString                                CalculateLengthOfElementChain___CalculateLengthOfElementChain_DISPATCH_RigDispatch_Print_Prefix__Const; // 0x3B8(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         CalculateLengthOfElementChain___CalculateLengthOfElementChain_DISPATCH_RigDispatch_Print_Enabled__Const; // 0x3C8(0x1)(None)
	uint8                                        Pad_C41[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_DISPATCH_RigDispatch_Print_ScreenDuration__Const; // 0x3CC(0x4)(None)
	struct FLinearColor                          CalculateLengthOfElementChain___CalculateLengthOfElementChain_DISPATCH_RigDispatch_Print_ScreenColor__Const; // 0x3D0(0x10)(None)
	int32                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathIntSub_1_B__Const; // 0x3E0(0x4)(None)
	float                                        LocalVariable__FunctionLibrary___CalculateLengthOfElementChain_VariableNode_7_Value__Const; // 0x3E4(0x4)(None)
	enum class ERigVMTransformSpace              CalculateLengthOfElementChain___CalculateLengthOfElementChain_GetTransform_1_Space__Const; // 0x3E8(0x1)(None)
	uint8                                        Pad_C42[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_Name__Const; // 0x3EC(0x8)(None)
	int32                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigVMDispatch_ArrayGetAtIndex_Index__Const; // 0x3F4(0x4)(None)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_Name__Const; // 0x3F8(0x8)(None)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_5_Name__Const; // 0x400(0x8)(None)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_Strength__Const; // 0x408(0x4)(None)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_1_Strength__Const; // 0x40C(0x4)(None)
	int32                                        GroundConformForwardsSolve___GroundConformForwardsSolve_GroundConform_HitNotifyCheckFrame__Const; // 0x410(0x4)(None)
	uint8                                        Pad_C43[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_Multiply_B__Const; // 0x418(0x8)(None)
	bool                                         LocalVariableDefault__GroundConform_SphereTrace_bHit__Const; // 0x420(0x1)(None)
	bool                                         LocalVariableDefault__GroundConform_FirstSphereTrace_bHit__Const; // 0x421(0x1)(None)
	uint8                                        Pad_C44[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        LocalVariableDefault__GroundConform_CurrentIndex__Const; // 0x424(0x4)(None)
	struct FRigElementKey                        LocalVariableDefault__GroundConform_CurrentElement__Const; // 0x428(0xC)(None)
	uint8                                        Pad_C46[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FHitResult                            LocalVariableDefault__GroundConform_SphereTraceByTraceChannel_WorldSpaceHitResult__Const; // 0x438(0xF0)(None)
	TArray<struct FVector>                       LocalVariableDefault__GroundConform_EffectorPositionCache__Const; // 0x528(0x10)(AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         LocalVariableDefault__GroundConform_HasMotion__Const; // 0x538(0x1)(None)
	uint8                                        Pad_C48[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       LocalVariableDefault__GroundConform_CurrentElementGravity__Const; // 0x540(0x8)(None)
	bool                                         LocalVariableDefault__GroundConform_bShouldCheckHitNotify__Const; // 0x548(0x1)(None)
	uint8                                        Pad_C49[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        LocalVariableDefault__GroundConform_CurrentControl__Const; // 0x54C(0xC)(None)
	struct FVector                               LocalVariableDefault__GroundConform_TargetPosition__Const; // 0x558(0x18)(None)
	struct FQuat                                 LocalVariableDefault__GroundConform_TargetRotation__Const; // 0x570(0x20)(None)
	struct FTransform                            LocalVariableDefault__GroundConform_ParentTransform__Const; // 0x590(0x60)(None)
	struct FTransform                            LocalVariableDefault__GroundConform_CurrentTransform__Const; // 0x5F0(0x60)(None)
	float                                        LocalVariableDefault__GroundConform_DistanceToParent__Const; // 0x650(0x4)(None)
	uint8                                        Pad_C4A[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               LocalVariableDefault__GroundConform_PreviousPosition__Const; // 0x658(0x18)(None)
	struct FVector                               LocalVariableDefault__GroundConform_Solver_Position__Const; // 0x670(0x18)(None)
	struct FVector                               LocalVariableDefault__GroundConform_If_4_Result__Const; // 0x688(0x18)(None)
	struct FVector                               LocalVariableDefault__GroundConform_TrueIn__Const; // 0x6A0(0x18)(None)
	struct FVector                               LocalVariableDefault__GroundConform_FalseIn__Const; // 0x6B8(0x18)(None)
	bool                                         LocalVariableDefault__GroundConform_BoolIn__Const; // 0x6D0(0x1)(None)
	uint8                                        Pad_C4C[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FVector>                       LocalVariableDefault__GroundConform_TracePathPositions_Local__Const; // 0x6D8(0x10)(ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         LocalVariableDefault__GroundConform_bHasDynamicBase_LastFrame_Local__Const; // 0x6E8(0x1)(None)
	uint8                                        Pad_C4D[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               LocalVariableDefault__GroundConform_TraceHitPosition_Local__Const; // 0x6F0(0x18)(None)
	struct FVector                               LocalVariableDefault__GroundConform_TraceCenter_Local__Const; // 0x708(0x18)(None)
	int32                                        GroundConform___GroundConform_DISPATCH_RigVMDispatch_ArrayGetAtIndex_2_Index__Const; // 0x720(0x4)(None)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_17_Name__Const; // 0x724(0x8)(None)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_17_Default__Const; // 0x72C(0x1)(None)
	uint8                                        Pad_C50[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_9_Name__Const; // 0x730(0x8)(None)
	bool                                         LocalVariable__FunctionLibrary___GroundConform_VariableNode_80_Value__Const; // 0x738(0x1)(None)
	uint8                                        Pad_C51[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        GroundConform___GroundConform_Subtract_9_B__Const; // 0x73C(0x4)(None)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_Name__Const; // 0x740(0x8)(None)
	enum class ERigVMTransformSpace              GroundConform___GroundConform_GetTransform_3_Space__Const; // 0x748(0x1)(None)
	uint8                                        Pad_C52[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_7_Name__Const; // 0x74C(0x8)(None)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_2_Name__Const; // 0x754(0x8)(None)
	struct FRigElementKey                        GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_2_Default__Const; // 0x75C(0xC)(None)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_5_1_Name__Const; // 0x768(0x8)(None)
	struct FRigElementKey                        GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_5_1_Default__Const; // 0x770(0xC)(None)
	uint8                                        Pad_C59[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       GroundConform___GroundConform_Add_2_B__Const;      // 0x780(0x8)(None)
	double                                       GroundConform___GroundConform_Clamp_2_Minimum__Const; // 0x788(0x8)(None)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_Name__Const; // 0x790(0x8)(None)
	float                                        GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_Default__Const; // 0x798(0x4)(None)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_2_Name__Const; // 0x79C(0x8)(None)
	uint8                                        Pad_C5A[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_4_Default__Const; // 0x7A8(0x18)(None)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_7_Name__Const; // 0x7C0(0x8)(None)
	struct FVector                               GroundConform___GroundConform_Add_3_Add_3_B__Const; // 0x7C8(0x18)(None)
	double                                       GroundConform___GroundConform_Multiply_5_B__Const; // 0x7E0(0x8)(None)
	TArray<struct FVector>                       GroundConform___GroundConform_ArrayAppend_Other__Const; // 0x7E8(0x10)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, NonPIEDuplicateTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	double                                       GroundConform___GroundConform_Add_9_A__Const;      // 0x7F8(0x8)(None)
	double                                       GroundConform___GroundConform_Add_9_1_A__Const;    // 0x800(0x8)(None)
	double                                       GroundConform___GroundConform_Multiply_4_3_B__Const; // 0x808(0x8)(None)
	enum class ETraceTypeQuery                   GroundConform___GroundConform_SphereTraceByTraceChannel_TraceChannel__Const; // 0x810(0x1)(None)
	uint8                                        Pad_C5C[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        GroundConform___GroundConform_ArrayGetAtIndex_8_1_1_Index__Const; // 0x814(0x4)(None)
	uint8                                        Pad_C5D[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQuat                                 GroundConform___GroundConform_From_World_4_1_Value__Const; // 0x820(0x20)(None)
	double                                       GroundConform___GroundConform_Less_1_B__Const;     // 0x840(0x8)(None)
	int32                                        MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_CoreNotEquals_B__Const; // 0x848(0x4)(None)
	class FName                                  MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_6_1_Name__Const; // 0x84C(0x8)(None)
	struct FRigElementKey                        MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_6_1_Default__Const; // 0x854(0xC)(None)
	class FName                                  MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_14_Name__Const; // 0x860(0x8)(None)
	class FName                                  LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_DISPATCH_RigDispatch_GetMetadata_2_Name__Const; // 0x868(0x8)(None)
	struct FTransform                            LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_DISPATCH_RigDispatch_GetMetadata_2_Default__Const; // 0x870(0x60)(None)
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_If_6_True__Const; // 0x8D0(0x8)(None)
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_If_6_False__Const; // 0x8D8(0x8)(None)
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Multiply_3_Multiply_3_1_B__Const; // 0x8E0(0x8)(None)
	struct FVector                               ReorientBone___ReorientBone_DISPATCH_RigDispatch_CoreNotEquals_B__Const; // 0x8E8(0x18)(None)
	class FName                                  ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_Name__Const; // 0x900(0x8)(None)
	class FName                                  ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_Name__Const; // 0x908(0x8)(None)
	struct FRigElementKey                        ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_Default__Const; // 0x910(0xC)(None)
	class FName                                  ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_1_Name__Const; // 0x91C(0x8)(None)
	uint8                                        Pad_C63[0xC];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQuat                                 ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_1_Default__Const; // 0x930(0x20)(None)
	double                                       GroundConform___GroundConform_Interpolate_1_1_B__Const; // 0x950(0x8)(None)
	double                                       GroundConform___GroundConform_Interpolate_1_2_A__Const; // 0x958(0x8)(None)
	double                                       GroundConform___GroundConform_Interpolate_1_2_B__Const; // 0x960(0x8)(None)
	struct FVector                               LocalVariableDefault__Solver_PostZConstraint__Const; // 0x968(0x18)(None)
	double                                       Solver___Solver_GreaterEqual_1_B__Const;           // 0x980(0x8)(None)
	double                                       Solver___Solver_Subtract_6_A__Const;               // 0x988(0x8)(None)
	double                                       Solver___Solver_Power_A__Const;                    // 0x990(0x8)(None)
	double                                       Solver___Solver_Multiply_B__Const;                 // 0x998(0x8)(None)
	double                                       Solver___Solver_Clamp_2_1_Minimum__Const;          // 0x9A0(0x8)(None)
	class FName                                  Solver___Solver_DISPATCH_RigDispatch_GetMetadata_Name__Const; // 0x9A8(0x8)(None)
	struct FVector                               Solver___Solver_DISPATCH_RigDispatch_GetMetadata_Default__Const; // 0x9B0(0x18)(None)
	double                                       Solver___Solver_Multiply_7_B__Const;               // 0x9C8(0x8)(None)
	double                                       Solver___Solver_Remap_1_SourceMaximum__Const;      // 0x9D0(0x8)(None)
	double                                       Solver___Solver_Remap_1_TargetMinimum__Const;      // 0x9D8(0x8)(None)
	double                                       Solver___Solver_Remap_1_TargetMaximum__Const;      // 0x9E0(0x8)(None)
	bool                                         Solver___Solver_Remap_1_bClamp__Const;             // 0x9E8(0x1)(None)
	uint8                                        Pad_C68[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Solver___Solver_Divide_2_B__Const;                 // 0x9F0(0x8)(None)
	double                                       Solver___Solver_Greater_3_B__Const;                // 0x9F8(0x8)(None)
	float                                        Solver___Solver_Scale_2_1_Factor__Const;           // 0xA00(0x4)(None)
	uint8                                        Pad_C6A[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Solver___Solver_Multiply_8_B__Const;               // 0xA08(0x8)(None)
	int32                                        Solver___Solver_DISPATCH_RigDispatch_CoreEquals_B__Const; // 0xA10(0x4)(None)
	bool                                         Solver___Solver_If_2_Condition__Const;             // 0xA14(0x1)(None)
	uint8                                        Pad_C6B[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  Solver___Solver_DISPATCH_RigDispatch_GetMetadata_2_Name__Const; // 0xA18(0x8)(None)
	struct FTransform                            Solver___Solver_DISPATCH_RigDispatch_GetMetadata_2_Default__Const; // 0xA20(0x60)(None)
	double                                       Solver___Solver_Multiply_5_B__Const;               // 0xA80(0x8)(None)
	double                                       Solver___Solver_Clamp_1_Maximum__Const;            // 0xA88(0x8)(None)
	float                                        Solver___Solver_Interpolate_T__Const;              // 0xA90(0x4)(None)
	int32                                        ParentChainLengthConstraint___ParentChainLengthConstraint_DISPATCH_RigDispatch_CoreEquals_B__Const; // 0xA94(0x4)(None)
	struct FVector                               ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_CoreNotEquals_B__Const; // 0xA98(0x18)(None)
	class FName                                  ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_Name__Const; // 0xAB0(0x8)(None)
	class FName                                  ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_Name__Const; // 0xAB8(0x8)(None)
	struct FRigElementKey                        ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_Default__Const; // 0xAC0(0xC)(None)
	class FName                                  ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_1_Name__Const; // 0xACC(0x8)(None)
	uint8                                        Pad_C6D[0xC];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQuat                                 ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_1_Default__Const; // 0xAE0(0x20)(None)
	float                                        GroundConform___GroundConform_SpringInterpQuaternionV2_Strength__Const; // 0xB00(0x4)(None)
	float                                        GroundConform___GroundConform_SpringInterpQuaternionV2_CriticalDamping__Const; // 0xB04(0x4)(None)
	uint8                                        Pad_C6E[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPBIKEffector                         GroundConform___GroundConform_ArraySetAtIndex_Element__Const; // 0xB10(0x90)(None)
	struct FTransform                            GroundConform___GroundConform_Set_Transform_1_Value__Const; // 0xBA0(0x60)(None)
	class FString                                GroundConform___GroundConform_DISPATCH_RigVMDispatch_Print_Prefix__Const; // 0xC00(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, Protected, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	float                                        GroundConform___GroundConform_DISPATCH_RigVMDispatch_Print_ScreenDuration__Const; // 0xC10(0x4)(None)
	struct FLinearColor                          GroundConform___GroundConform_DISPATCH_RigVMDispatch_Print_ScreenColor__Const; // 0xC14(0x10)(None)
	struct FLinearColor                          GroundConform___GroundConform_DebugLineItemSpace_1_Color__Const; // 0xC24(0x10)(None)
	uint8                                        Pad_C75[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               GroundConform___GroundConform_RigVMFunction_MathQuaternionFromTwoVectors_A__Const; // 0xC38(0x18)(None)
	struct FLinearColor                          GroundConform___GroundConform_DebugRectangleItemSpace_1_Color__Const; // 0xC50(0x10)(None)
	double                                       GroundConform___GroundConform_Multiply_8_B__Const; // 0xC60(0x8)(None)
	double                                       GroundConform___GroundConform_Multiply_8_1_B__Const; // 0xC68(0x8)(None)
	struct FLinearColor                          GroundConform___GroundConform_DebugLineItemSpace_1_2_Color__Const; // 0xC70(0x10)(None)
	struct FLinearColor                          GroundConform___GroundConform_DebugLineItemSpace_1_1_Color__Const; // 0xC80(0x10)(None)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_5_Name__Const; // 0xC90(0x8)(None)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_14_Name__Const; // 0xC98(0x8)(None)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_1_Name__Const; // 0xCA0(0x8)(None)
	class FName                                  GroundConform___GroundConform_If_5_True__Const;    // 0xCA8(0x8)(None)
	class FName                                  GroundConform___GroundConform_If_5_False__Const;   // 0xCB0(0x8)(None)
	TArray<struct FTransform>                    GroundConform___GroundConform_DrawTransforms_Transforms__Const; // 0xCB8(0x10)(AutoWeak, AssetRegistrySearchable, AdvancedDisplay, Protected, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	double                                       GroundConform___GroundConform_Multiply_12_B__Const; // 0xCC8(0x8)(None)
	double                                       GroundConform___GroundConform_Multiply_4_B__Const; // 0xCD0(0x8)(None)
	enum class ERigUnitDebugTransformMode        GroundConform___GroundConform_DrawTransforms_Mode__Const; // 0xCD8(0x1)(None)
	uint8                                        Pad_C79[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          GroundConform___GroundConform_DrawTransforms_Color__Const; // 0xCDC(0x10)(None)
	uint8                                        Pad_C7B[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FTransform>                    LocalVariableDefault__DrawTransforms_the_transforms__Const; // 0xCF0(0x10)(ContainsInstancedReference, AdvancedDisplay, Protected, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FTransform                            DrawTransforms___DrawTransforms_DebugTransformMutableItemSpace_WorldOffset__Const; // 0xD00(0x60)(None)
	bool                                         DrawTransforms___DrawTransforms_DebugTransformMutableItemSpace_bEnabled__Const; // 0xD60(0x1)(None)
	uint8                                        Pad_C80[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_4_Value__Const; // 0xD64(0x4)(None)
	float                                        GroundConform___GroundConform_RigVMFunction_DebugArcNoSpace_MaximumDegrees__Const; // 0xD68(0x4)(None)
	int32                                        GroundConform___GroundConform_RigVMFunction_DebugArcNoSpace_Detail__Const; // 0xD6C(0x4)(None)
	struct FVector                               GroundConform___GroundConform_RigVMFunction_MathQuaternionFromEuler_Euler__Const; // 0xD70(0x18)(None)
	enum class EEulerRotationOrder               GroundConform___GroundConform_RigVMFunction_MathQuaternionFromEuler_RotationOrder__Const; // 0xD88(0x1)(None)
	uint8                                        Pad_C83[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          GroundConform___GroundConform_RigVMFunction_DebugArcNoSpace_1_Color__Const; // 0xD8C(0x10)(None)
	uint8                                        Pad_C84[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_Greater_B__Const; // 0xDA0(0x8)(None)
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_5_Name__Const; // 0xDA8(0x8)(None)
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_8_Name__Const; // 0xDB0(0x8)(None)
	struct FVector                               GroundConformForwardsSolve___GroundConformForwardsSolve_Add_5_B__Const; // 0xDB8(0x18)(None)
	struct FVector                               GroundConformForwardsSolve___GroundConformForwardsSolve_Add_2_1_B__Const; // 0xDD0(0x18)(None)
	enum class ETraceTypeQuery                   GroundConformForwardsSolve___GroundConformForwardsSolve_SphereTraceByTraceChannel_1_TraceChannel__Const; // 0xDE8(0x1)(None)
	uint8                                        Pad_C85[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_SphereTraceByTraceChannel_1_Radius__Const; // 0xDEC(0x4)(None)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Scale_Factor__Const; // 0xDF0(0x4)(None)
	struct FLinearColor                          GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_DebugLineNoSpace_1_Color__Const; // 0xDF4(0x10)(None)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_DebugLineNoSpace_1_Thickness__Const; // 0xE04(0x4)(None)
	struct FVector                               GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_6_Default__Const; // 0xE08(0x18)(None)
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_9_Name__Const; // 0xE20(0x8)(None)
	enum class ERigElementType                   RigVMModel___HierarchySetPoseItemArray_1_1_ElementType__Const; // 0xE28(0x1)(None)
	enum class ERigVMTransformSpace              RigVMModel___HierarchySetPoseItemArray_1_1_Space__Const; // 0xE29(0x1)(None)
	uint8                                        Pad_C8C[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FRigElementKey>                RigVMModel___HierarchySetPoseItemArray_1_1_ItemsToSet__Const; // 0xE30(0x10)(AdvancedDisplay, Protected, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	class FName                                  RigVMModel___PBIK_1_Root__Const;                   // 0xE40(0x8)(None)
	TArray<struct FPBIKBoneSetting>              RigVMModel___PBIK_1_BoneSettings__Const;           // 0xE48(0x10)(AutoWeak, AssetRegistrySearchable, SimpleDisplay, Protected, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<class FName>                          RigVMModel___PBIK_1_ExcludedBones__Const;          // 0xE58(0x10)(AutoWeak, ContainsInstancedReference, SimpleDisplay, Protected, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FPBIKSolverSettings                   RigVMModel___PBIK_1_Settings__Const;               // 0xE68(0x3C)(None)
	struct FPBIKDebug                            RigVMModel___PBIK_1_Debug__Const;                  // 0xEA4(0x8)(None)
	class FName                                  RigVMModel___DISPATCH_RigDispatch_GetMetadata_2_Name__Const; // 0xEAC(0x8)(None)
	int32                                        RigVMModel___DISPATCH_RigDispatch_GetMetadata_2_Default__Const; // 0xEB4(0x4)(None)
	enum class ERigElementType                   RigVMModel___HierarchyGetPoseItemArray_1_1_ElementType__Const; // 0xEB8(0x1)(None)
	uint8                                        Pad_C8E[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FRigElementKey>                RigVMModel___RigUnit_ItemArray_Items__Const;       // 0xEC0(0x10)(SimpleDisplay, Protected, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FRigElementKey>                RigVMModel___RigUnit_ItemArray_1_Items__Const;     // 0xED0(0x10)(ContainsInstancedReference, AssetRegistrySearchable, Protected, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FRigPoseElement>               LocalVariableDefault__GroundConform_Constructor_CalculateLengthOfChain_Bones__Const; // 0xEE0(0x10)(AutoWeak, ContainsInstancedReference, Protected, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FRigElementKey>                LocalVariableDefault__SortRigElements_NewElements__Const; // 0xEF0(0x10)(AutoWeak, Protected, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	int32                                        LocalVariableDefault__SortRigElements_InsertIndex__Const; // 0xF00(0x4)(None)
	int32                                        LocalVariableDefault__SortRigElements_NewElementsNum__Const; // 0xF04(0x4)(None)
	TArray<struct FRigElementKey>                LocalVariableDefault__SortRigElements_ArrayIntersection_Result__Const; // 0xF08(0x10)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FRigElementKey>                LocalVariableDefault__SortRigElements_CollectionChildrenArray_Items__Const; // 0xF18(0x10)(AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         LocalVariableDefault__SortRigElements_bBreakLoop__Const; // 0xF28(0x1)(None)
	uint8                                        Pad_C93[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<int32>                                LocalVariableDefault__SortRigElements_SortedIndexArray__Const; // 0xF30(0x10)(AutoWeak, SimpleDisplay, AdvancedDisplay, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	int32                                        LocalVariableDefault__SortRigElements_MainLoopIndex__Const; // 0xF40(0x4)(None)
	int32                                        LocalVariable__FunctionLibrary___SortRigElements_VariableNode_13_Value__Const; // 0xF44(0x4)(None)
	struct FRigElementKey                        SortRigElements___SortRigElements_DISPATCH_RigDispatch_CoreEquals_B__Const; // 0xF48(0xC)(None)
	int32                                        SortRigElements___SortRigElements_ArrayInsert_1_1_Element__Const; // 0xF54(0x4)(None)
	bool                                         SortRigElements___SortRigElements_CollectionChildrenArray_bIncludeParent__Const; // 0xF58(0x1)(None)
	bool                                         SortRigElements___SortRigElements_CollectionChildrenArray_bRecursive__Const; // 0xF59(0x1)(None)
	enum class ERigElementType                   SortRigElements___SortRigElements_CollectionChildrenArray_TypeToSearch__Const; // 0xF5A(0x1)(None)
	uint8                                        Pad_C94[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SortRigElements___SortRigElements_Add_B__Const;    // 0xF5C(0x4)(None)
	TArray<struct FRigElementKey>                LocalVariableDefault__SortByIndexArray_NewElements__Const; // 0xF60(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	int32                                        SortByIndexArray_1___SortByIndexArray_GreaterEqual_B__Const; // 0xF70(0x4)(None)
	uint8                                        Pad_C95[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<double>                               LocalVariableDefault__SortByIndexArrayFloat_NewElements__Const; // 0xF78(0x10)(AssetRegistrySearchable, AdvancedDisplay, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	int32                                        SortByIndexArrayFloat___SortByIndexArrayFloat_GreaterEqual_B__Const; // 0xF88(0x4)(None)
	uint8                                        Pad_C96[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<double>                               LocalVariableDefault__SortByIndexArrayFloat_NewElements__Const; // 0xF90(0x10)(ContainsInstancedReference, AdvancedDisplay, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	int32                                        SortByIndexArrayFloat_1___SortByIndexArrayFloat_GreaterEqual_B__Const; // 0xFA0(0x4)(None)
	uint8                                        Pad_C98[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<bool>                                 LocalVariableDefault__SortByIndexArrayBoolean_NewElements__Const; // 0xFA8(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	int32                                        SortByIndexArrayBoolean___SortByIndexArrayBoolean_GreaterEqual_B__Const; // 0xFB8(0x4)(None)
	uint8                                        Pad_C99[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<double>                               LocalVariableDefault__SortByIndexArrayFloat_NewElements__Const; // 0xFC0(0x10)(AutoWeak, AssetRegistrySearchable, SimpleDisplay, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	int32                                        SortByIndexArrayFloat_1_1___SortByIndexArrayFloat_GreaterEqual_B__Const; // 0xFD0(0x4)(None)
	uint8                                        Pad_C9C[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<double>                               LocalVariableDefault__SortByIndexArrayFloat_NewElements__Const; // 0xFD8(0x10)(ContainsInstancedReference, SimpleDisplay, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	int32                                        SortByIndexArrayFloat_1_1_1___SortByIndexArrayFloat_GreaterEqual_B__Const; // 0xFE8(0x4)(None)
	uint8                                        Pad_C9D[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<double>                               LocalVariableDefault__SortByIndexArrayFloat_NewElements__Const; // 0xFF0(0x10)(Protected, BlueprintCallable, NonPIEDuplicateTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	int32                                        SortByIndexArrayFloat_0___SortByIndexArrayFloat_GreaterEqual_B__Const; // 0x1000(0x4)(None)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_GetMetadata_4_1_Name__Const; // 0x1004(0x8)(None)
	struct FRigElementKey                        GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_GetMetadata_4_1_Default__Const; // 0x100C(0xC)(None)
	struct FRigElementKey                        GroundConform_Constructor_1___GroundConform_Constructor_If_1_False__Const; // 0x1018(0xC)(None)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_Concat_1_B__Const; // 0x1024(0x8)(None)
	uint8                                        Pad_C9F[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            GroundConform_Constructor_1___GroundConform_Constructor_SpawnControl_OffsetTransform__Const; // 0x1030(0x60)(None)
	enum class ERigVMTransformSpace              GroundConform_Constructor_1___GroundConform_Constructor_GetTransform_Space__Const; // 0x1090(0x1)(None)
	bool                                         GroundConform_Constructor_1___GroundConform_Constructor_GetTransform_bInitial__Const; // 0x1091(0x1)(None)
	uint8                                        Pad_CA0[0xE];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigUnit_HierarchyAddControlTransform_Settings GroundConform_Constructor_1___GroundConform_Constructor_SpawnControl_Settings__Const; // 0x10A0(0xC0)(SimpleDisplay, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FVector                               GroundConform_Constructor_1___GroundConform_Constructor_Scale_Value__Const; // 0x1160(0x18)(None)
	uint8                                        Pad_CA1[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPBIKEffector                         GroundConform_Constructor_1___GroundConform_Constructor_ArrayAdd_Element__Const; // 0x1180(0x90)(None)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_1_Name__Const; // 0x1210(0x8)(None)
	struct FVector                               GroundConform_Constructor_1___GroundConform_Constructor_ArrayAdd_1_Element__Const; // 0x1218(0x18)(None)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_3_Name__Const; // 0x1230(0x8)(None)
	uint8                                        Pad_CA2[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQuat                                 GroundConform_Constructor_1___GroundConform_Constructor_ArrayAdd_3_Element__Const; // 0x1240(0x20)(None)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_5_Name__Const; // 0x1260(0x8)(None)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_Name__Const; // 0x1268(0x8)(None)
	bool                                         GroundConform_Constructor_1___GroundConform_Constructor_GetTransform_2_2_bInitial__Const; // 0x1270(0x1)(None)
	uint8                                        Pad_CA3[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_3_Name__Const; // 0x1274(0x8)(None)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_4_2_1_Name__Const; // 0x127C(0x8)(None)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_2_Name__Const; // 0x1284(0x8)(None)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_1_Name__Const; // 0x128C(0x8)(None)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_4_2_1_1_Name__Const; // 0x1294(0x8)(None)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_3_1_Name__Const; // 0x129C(0x8)(None)
	uint8                                        Pad_CA8[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               LookAt_1_1___LookAt_DISPATCH_RigDispatch_CoreNotEquals_B__Const; // 0x12A8(0x18)(None)
	float                                        LookAt_1_1___LookAt_Scale_Factor__Const;           // 0x12C0(0x4)(None)
	uint8                                        Pad_CA9[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               LookAt_1_1___LookAt_Rotate_Vector_1_Vector__Const; // 0x12C8(0x18)(None)
	TArray<struct FRigElementKey>                LocalVariableDefault__MakeArrayFromStartToEndBone_ChildrenArray__Const; // 0x12E0(0x10)(AutoWeak, AssetRegistrySearchable, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FRigElementKey>                LocalVariableDefault__MakeArrayFromStartToEndBone_ParentsArray__Const; // 0x12F0(0x10)(AutoWeak, ContainsInstancedReference, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FRigElementKey>                LocalVariableDefault__MakeArrayFromStartToEndBone_OutChain__Const; // 0x1300(0x10)(ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	bool                                         LocalVariableDefault__MakeArrayFromStartToEndBone_ChainComplete__Const; // 0x1310(0x1)(None)
	uint8                                        Pad_CAB[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_Prefix__Const; // 0x1318(0x10)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	bool                                         MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_Enabled__Const; // 0x1328(0x1)(None)
	uint8                                        Pad_CAC[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_ScreenDuration__Const; // 0x132C(0x4)(None)
	struct FLinearColor                          MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_ScreenColor__Const; // 0x1330(0x10)(None)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_4_1_Prefix__Const; // 0x1340(0x10)(SimpleDisplay, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	bool                                         MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_CollectionChildrenArray_bIncludeParent__Const; // 0x1350(0x1)(None)
	enum class ERigElementType                   MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_CollectionChildrenArray_TypeToSearch__Const; // 0x1351(0x1)(None)
	uint8                                        Pad_CAE[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_Prefix__Const; // 0x1358(0x10)(ContainsInstancedReference, AssetRegistrySearchable, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_1_Prefix__Const; // 0x1368(0x10)(AssetRegistrySearchable, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_2_Prefix__Const; // 0x1378(0x10)(ContainsInstancedReference, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_2_1_Prefix__Const; // 0x1388(0x10)(Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_3_Prefix__Const; // 0x1398(0x10)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, BlueprintAuthorityOnly, NonPIEDuplicateTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	class FString                                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_3_1_Prefix__Const; // 0x13A8(0x10)(TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FRigElementKey>                LocalVariableDefault__CalculateLengthOfElementChain_NewLocalVar__Const; // 0x13B8(0x10)(ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	bool                                         LocalVariableDefault__CalculateLengthOfElementChain_MathIntEquals_Result__Const; // 0x13C8(0x1)(None)
	uint8                                        Pad_CB2[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        LocalVariableDefault__CalculateLengthOfElementChain_numBones__Const; // 0x13CC(0x4)(None)
	float                                        LocalVariableDefault__CalculateLengthOfElementChain_currentDistance__Const; // 0x13D0(0x4)(None)
	float                                        LocalVariableDefault__CalculateLengthOfElementChain_averageDistance__Const; // 0x13D4(0x4)(None)
	class FString                                CalculateLengthOfElementChain___CalculateLengthOfElementChain_DISPATCH_RigDispatch_Print_Prefix__Const; // 0x13D8(0x10)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         CalculateLengthOfElementChain___CalculateLengthOfElementChain_DISPATCH_RigDispatch_Print_Enabled__Const; // 0x13E8(0x1)(None)
	uint8                                        Pad_CB5[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_DISPATCH_RigDispatch_Print_ScreenDuration__Const; // 0x13EC(0x4)(None)
	struct FLinearColor                          CalculateLengthOfElementChain___CalculateLengthOfElementChain_DISPATCH_RigDispatch_Print_ScreenColor__Const; // 0x13F0(0x10)(None)
	int32                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathIntSub_1_B__Const; // 0x1400(0x4)(None)
	float                                        LocalVariable__FunctionLibrary___CalculateLengthOfElementChain_VariableNode_7_Value__Const; // 0x1404(0x4)(None)
	enum class ERigVMTransformSpace              CalculateLengthOfElementChain___CalculateLengthOfElementChain_GetTransform_1_Space__Const; // 0x1408(0x1)(None)
	uint8                                        Pad_CB6[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_4_Name__Const; // 0x140C(0x8)(None)
	float                                        GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_GetMetadata_Default__Const; // 0x1414(0x4)(None)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_4_Name__Const; // 0x1418(0x8)(None)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_4_1_Name__Const; // 0x1420(0x8)(None)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_4_1_1_Name__Const; // 0x1428(0x8)(None)
	class FName                                  SnapControlsToBoneElements___SnapControlsToBoneElements_DISPATCH_RigDispatch_GetMetadata_3_Name__Const; // 0x1430(0x8)(None)
	struct FRigElementKey                        SnapControlsToBoneElements___SnapControlsToBoneElements_DISPATCH_RigDispatch_GetMetadata_3_Default__Const; // 0x1438(0xC)(None)
	enum class ERigVMTransformSpace              SnapControlsToBoneElements___SnapControlsToBoneElements_Set_Transform_Space__Const; // 0x1444(0x1)(None)
	bool                                         SnapControlsToBoneElements___SnapControlsToBoneElements_Set_Transform_bInitial__Const; // 0x1445(0x1)(None)
	uint8                                        Pad_CB7[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        SnapControlsToBoneElements___SnapControlsToBoneElements_RigUnit_GetTransform_20_Item__Const; // 0x1448(0xC)(None)
	float                                        SnapControlsToBoneElements___SnapControlsToBoneElements_Set_Transform_Weight__Const; // 0x1454(0x4)(None)
	bool                                         SnapControlsToBoneElements___SnapControlsToBoneElements_Set_Transform_bPropagateToChildren__Const; // 0x1458(0x1)(None)
	uint8                                        Pad_CB8[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        SnapControlsToBoneElements___SnapControlsToBoneElements_Set_Transform_1_Item__Const; // 0x145C(0xC)(None)
	TArray<struct FRigElementKey>                LocalVariableDefault__InitConstrainLengthArray_NewArray__Const; // 0x1468(0x10)(None)
	int32                                        InitConstrainLengthArray___InitConstrainLengthArray_Greater_B__Const; // 0x1478(0x4)(None)
	class FName                                  InitConstrainLengthArray___InitConstrainLengthArray_DISPATCH_RigDispatch_SetMetadata_6_Name__Const; // 0x147C(0x8)(None)

	static class UClass* StaticClass();
	static class URigVMMemory_Literal* GetDefaultObj();

};

// 0x5D50 (0x5D78 - 0x28)
// RigVMMemoryStorageGeneratorClass Human_GroundConform_CtrlRig.RigVMMemory_Work
class URigVMMemory_Work : public URigVMMemoryStorage
{
public:
	uint8                                        Pad_CDE[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQuat                                 RigVMModel___RigVMFunction_MathQuaternionFromEuler_Result; // 0x30(0x20)(None)
	TArray<struct FCachedRigElement>             RigVMModel___RigUnit_SetRotation_2_CachedIndex;    // 0x50(0x10)(SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         RigVMModel___GroundConformForwardsSolve_DidNotApplyCachedPose; // 0x60(0x1)(None)
	bool                                         RigVMModel___GroundConformForwardsSolve_Argument;  // 0x61(0x1)(None)
	uint8                                        Pad_CE0[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_Root_Control; // 0x64(0xC)(None)
	struct FRigElementKey                        GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_Root_Bone; // 0x70(0xC)(None)
	struct FRigElementKey                        GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_Hip_Bone; // 0x7C(0xC)(None)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_Effector_Rotation_Alpha; // 0x88(0x4)(None)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_Effector_Strength_Alpha; // 0x8C(0x4)(None)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_Effector_Position_Alpha; // 0x90(0x4)(None)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_Effector_Pin_Rotation; // 0x94(0x4)(None)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_EnableGroundConforming; // 0x98(0x4)(None)
	uint8                                        Pad_CE3[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<double>                               GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_TimingBias; // 0xA0(0x10)(ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, Protected, BlueprintCallable, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_TimingBiasSpeed; // 0xB0(0x8)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_ShowDebug; // 0xB8(0x1)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_IsFalling; // 0xB9(0x1)(None)
	uint8                                        Pad_CE4[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_SleepPositionThreshold; // 0xC0(0x8)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_Return_DidNotApplyCachedPose; // 0xC8(0x1)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_Return_Argument; // 0xC9(0x1)(None)
	uint8                                        Pad_CE5[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Entry_ForceSleepTimeLimit; // 0xCC(0x4)(None)
	struct FTransform                            GroundConformForwardsSolve___GroundConformForwardsSolve_Multiply_1_Result; // 0xD0(0x60)(None)
	struct FTransform                            GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_GetTransform_Transform; // 0x130(0x60)(None)
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_GetTransform_CachedIndex; // 0x190(0x10)(AutoWeak, ContainsInstancedReference, AdvancedDisplay, Protected, BlueprintCallable, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FTransform                            GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_GetTransform_20_Transform; // 0x1A0(0x60)(None)
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_GetTransform_20_CachedIndex; // 0x200(0x10)(AutoWeak, AdvancedDisplay, Protected, BlueprintCallable, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_SetTransform_4_CachedIndex; // 0x210(0x10)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, Protected, BlueprintCallable, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_MathBoolAnd_1_Result; // 0x220(0x1)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_MathBoolNot_2_1_Result; // 0x221(0x1)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_MathBoolNot_Result; // 0x222(0x1)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0x223(0x1)(None)
	uint8                                        Pad_CE6[0xC];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            GroundConformForwardsSolve___GroundConformForwardsSolve_To_World_World; // 0x230(0x60)(None)
	struct FTransform                            GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_4_Value; // 0x290(0x60)(None)
	struct FRigElementKey                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigVMDispatch_ArrayGetAtIndex_1_2_1_Element; // 0x2F0(0xC)(None)
	uint8                                        Pad_CE7[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_4_Cache; // 0x300(0x10)(AssetRegistrySearchable, SimpleDisplay, Protected, BlueprintCallable, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_4_Found; // 0x310(0x1)(None)
	bool                                         LocalVariable__GroundConformForwardsSolve_bComponentMotionDetected; // 0x311(0x1)(None)
	uint8                                        Pad_CE8[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_6_Cache; // 0x318(0x10)(AutoWeak, SimpleDisplay, Protected, BlueprintCallable, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_6_Success; // 0x328(0x1)(None)
	uint8                                        Pad_CE9[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigVMDispatch_ArrayGetAtIndex_1_Element; // 0x32C(0xC)(None)
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_4_1_Cache; // 0x338(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, Protected, BlueprintCallable, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_4_1_Success; // 0x348(0x1)(None)
	uint8                                        Pad_CEA[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_5_1_Cache; // 0x350(0x10)(AssetRegistrySearchable, Protected, BlueprintCallable, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_5_1_Success; // 0x360(0x1)(None)
	uint8                                        Pad_CEE[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_3_Value; // 0x364(0x4)(None)
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_3_Cache; // 0x368(0x10)(ContainsInstancedReference, Protected, BlueprintCallable, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_3_Found; // 0x378(0x1)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_MathBoolAnd_3_Result; // 0x379(0x1)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_Less_1_Result; // 0x37A(0x1)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_Greater_2_1_Result; // 0x37B(0x1)(None)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_Timeline_1_1_Time; // 0x37C(0x4)(None)
	TArray<float>                                GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_Timeline_1_1_AccumulatedValue; // 0x380(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, BlueprintCallable, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<bool>                                 GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_Timeline_1_1_bIsInitialized; // 0x390(0x10)(AutoWeak, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, BlueprintCallable, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_4_Cache; // 0x3A0(0x10)(ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, BlueprintCallable, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Add_1_Result; // 0x3B0(0x4)(None)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_GetDeltaTime_1_Result; // 0x3B4(0x4)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_4_Success; // 0x3B8(0x1)(None)
	uint8                                        Pad_CF1[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_ControlFlowBranch_3_BlockToRun; // 0x3BC(0x8)(None)
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_ControlFlowBranch_2_BlockToRun; // 0x3C4(0x8)(None)
	int32                                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_Value; // 0x3CC(0x4)(None)
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_Cache; // 0x3D0(0x10)(SimpleDisplay, AdvancedDisplay, BlueprintCallable, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_Found; // 0x3E0(0x1)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_LessEqual_Result; // 0x3E1(0x1)(None)
	uint8                                        Pad_CF5[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_1_Cache; // 0x3E8(0x10)(AutoWeak, AssetRegistrySearchable, AdvancedDisplay, BlueprintCallable, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_1_Success; // 0x3F8(0x1)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_CheckForAnimationMotion_ShouldCallGroundConform; // 0x3F9(0x1)(None)
	uint8                                        Pad_CF7[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_CheckForAnimationMotion_DetectedNoMotion; // 0x400(0x8)(None)
	uint8                                        Pad_CFA[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            GroundConformForwardsSolve___GroundConformForwardsSolve_CheckForAnimationMotion_RootControlTransform; // 0x410(0x60)(None)
	struct FTransform                            GroundConformForwardsSolve___GroundConformForwardsSolve_CheckForAnimationMotion_HipTransform; // 0x470(0x60)(None)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_CheckForAnimationMotion_Position_Threshold; // 0x4D0(0x4)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_MathBoolNot_2_Result; // 0x4D4(0x1)(None)
	uint8                                        Pad_CFC[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        CheckForAnimationMotion___CheckForAnimationMotion_Entry_Root_Control; // 0x4D8(0xC)(None)
	struct FRigElementKey                        CheckForAnimationMotion___CheckForAnimationMotion_Entry_Hip_Bone; // 0x4E4(0xC)(None)
	struct FTransform                            CheckForAnimationMotion___CheckForAnimationMotion_Entry_HipTransformLastFrame; // 0x4F0(0x60)(None)
	struct FTransform                            CheckForAnimationMotion___CheckForAnimationMotion_Return_HipTransform; // 0x550(0x60)(None)
	float                                        CheckForAnimationMotion___CheckForAnimationMotion_Entry_Position_Threshold; // 0x5B0(0x4)(None)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_Entry_NotOnPlatform; // 0x5B4(0x1)(None)
	uint8                                        Pad_CFD[0xB];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            CheckForAnimationMotion___CheckForAnimationMotion_To_World_World; // 0x5C0(0x60)(None)
	struct FTransform                            CheckForAnimationMotion___CheckForAnimationMotion_GetTransform_1_1_Transform; // 0x620(0x60)(None)
	TArray<struct FCachedRigElement>             CheckForAnimationMotion___CheckForAnimationMotion_GetTransform_1_1_CachedIndex; // 0x680(0x10)(ContainsInstancedReference, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	bool                                         LocalVariable__CheckForAnimationMotion_DetectedPoseDifference; // 0x690(0x1)(None)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_MathBoolNot_Result; // 0x691(0x1)(None)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_PoseGetDelta_PosesAreEqual; // 0x692(0x1)(None)
	uint8                                        Pad_CFF[0x5];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigPose                              CheckForAnimationMotion___CheckForAnimationMotion_HierarchyGetPoseItemArray_1_Pose; // 0x698(0x70)(AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FRigElementKeyCollection              CheckForAnimationMotion___CheckForAnimationMotion_PoseGetDelta_ItemsToCompare__IO; // 0x708(0x10)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	struct FRigElementKeyCollection              CheckForAnimationMotion___CheckForAnimationMotion_PoseGetDelta_ItemsWithDelta; // 0x718(0x10)(AutoWeak, ContainsInstancedReference, AdvancedDisplay, BlueprintCallable, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	class FName                                  CheckForAnimationMotion___CheckForAnimationMotion_Branch_BlockToRun; // 0x728(0x8)(None)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_MathBoolOr_MathBoolOr_1_Result; // 0x730(0x1)(None)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_MathBoolOr_MathBoolOr_Result; // 0x731(0x1)(None)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_DISPATCH_RigDispatch_CoreNotEquals_Result; // 0x732(0x1)(None)
	uint8                                        Pad_D03[0x5];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             CheckForAnimationMotion___CheckForAnimationMotion_GetTransform_1_CachedIndex; // 0x738(0x10)(AdvancedDisplay, BlueprintCallable, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_RigVMFunction_MathBoolAnd_Result; // 0x748(0x1)(None)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_MathBoolNot_1_Result; // 0x749(0x1)(None)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_IsNearlyEqual_Result; // 0x74A(0x1)(None)
	uint8                                        Pad_D04[0x5];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               CheckForAnimationMotion___CheckForAnimationMotion_IsNearlyEqual_A; // 0x750(0x18)(None)
	struct FVector                               CheckForAnimationMotion___CheckForAnimationMotion_IsNearlyEqual_B; // 0x768(0x18)(None)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_MathBoolOr_1_MathBoolOr_1_1_Result; // 0x780(0x1)(None)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_MathBoolOr_1_MathBoolOr_1_Result; // 0x781(0x1)(None)
	uint8                                        Pad_D07[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CheckForAnimationMotion___CheckForAnimationMotion_Cast_Result; // 0x784(0x4)(None)
	bool                                         CheckForAnimationMotion___CheckForAnimationMotion_MathBoolNot_4_Result; // 0x788(0x1)(None)
	uint8                                        Pad_D08[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_2_Cache; // 0x790(0x10)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, BlueprintCallable, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_2_Success; // 0x7A0(0x1)(None)
	uint8                                        Pad_D0A[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigVMDispatch_ArrayGetAtIndex_1_2_Element; // 0x7A4(0xC)(None)
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_5_Cache; // 0x7B0(0x10)(AutoWeak, ContainsInstancedReference, SimpleDisplay, BlueprintCallable, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_3_2_Value; // 0x7C0(0x4)(None)
	uint8                                        Pad_D0D[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_3_2_Cache; // 0x7C8(0x10)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_3_2_Found; // 0x7D8(0x1)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_5_Success; // 0x7D9(0x1)(None)
	uint8                                        Pad_D0E[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_Cache; // 0x7E0(0x10)(AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	int32                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Subtract_Result; // 0x7F0(0x4)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_Success; // 0x7F4(0x1)(None)
	uint8                                        Pad_D0F[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_Branch_1_BlockToRun; // 0x7F8(0x8)(None)
	struct FRigPose                              GroundConformForwardsSolve___GroundConformForwardsSolve_HierarchyGetPoseItemArray_Pose; // 0x800(0x70)(AutoWeak, ContainsInstancedReference, SimpleDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_MathBoolOr_1_Result; // 0x870(0x1)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_MathBoolAnd_Result; // 0x871(0x1)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_1_Value; // 0x872(0x1)(None)
	uint8                                        Pad_D12[0x5];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_1_Cache; // 0x878(0x10)(AutoWeak, SimpleDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_1_Found; // 0x888(0x1)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_Less_Result; // 0x889(0x1)(None)
	uint8                                        Pad_D13[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_3_1_Value; // 0x88C(0x4)(None)
	struct FRigElementKey                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigVMDispatch_ArrayGetAtIndex_1_1_Element; // 0x890(0xC)(None)
	uint8                                        Pad_D14[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_3_1_Cache; // 0x8A0(0x10)(ContainsInstancedReference, AssetRegistrySearchable, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_3_1_Found; // 0x8B0(0x1)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_MathBoolNot_1_Result; // 0x8B1(0x1)(None)
	uint8                                        Pad_D15[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_ArrayIterator_Element; // 0x8B4(0xC)(None)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_2_Cache; // 0x8C0(0x10)(AssetRegistrySearchable, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Divide_Result; // 0x8D0(0x8)(None)
	uint8                                        Pad_D17[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_Transform; // 0x8E0(0x60)(None)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_CachedIndex; // 0x940(0x10)(AutoWeak, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Divide_A; // 0x950(0x8)(None)
	uint8                                        Pad_D19[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_1_2_2_Transform; // 0x960(0x60)(None)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_1_2_2_CachedIndex; // 0x9C0(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Divide_B; // 0x9D0(0x8)(None)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_2_Value; // 0x9D8(0x4)(None)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_2_Success; // 0x9DC(0x1)(None)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Greater_Result; // 0x9DD(0x1)(None)
	uint8                                        Pad_D1A[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigVMDispatch_ArrayGetNum_Num; // 0x9E0(0x4)(None)
	int32                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_ArrayIterator_Index; // 0x9E4(0x4)(None)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_2_3_Multiply_2_3_1_Result; // 0x9E8(0x4)(None)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_2_3_Multiply_2_3_Result; // 0x9EC(0x4)(None)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_Value; // 0x9F0(0x4)(None)
	uint8                                        Pad_D1D[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_Cache; // 0x9F8(0x10)(AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_Found; // 0xA08(0x1)(None)
	uint8                                        Pad_D1E[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_1_Value; // 0xA0C(0x4)(None)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_1_Cache; // 0xA10(0x10)(ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_1_Found; // 0xA20(0x1)(None)
	uint8                                        Pad_D1F[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Divide_1_Result; // 0xA28(0x8)(None)
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Minimum_1_Result; // 0xA30(0x8)(None)
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Minimum_1_A; // 0xA38(0x8)(None)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_Value; // 0xA40(0x18)(None)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_Cache; // 0xA58(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_Found; // 0xA68(0x1)(None)
	uint8                                        Pad_D23[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Divide_1_B; // 0xA70(0x8)(None)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_2_3_Multiply_2_3_1_B; // 0xA78(0x4)(None)
	uint8                                        Pad_D25[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigVMDispatch_ArraySetAtIndex_Element; // 0xA80(0x8)(None)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_RigVMFunction_ControlFlowBranch_1_BlockToRun; // 0xA88(0x8)(None)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Greater_1_Result; // 0xA90(0x1)(None)
	uint8                                        Pad_D26[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigVMDispatch_ArrayGetNum_1_Num; // 0xA94(0x4)(None)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_2_1_Result; // 0xA98(0x4)(None)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_2_Value; // 0xA9C(0x4)(None)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_2_Cache; // 0xAA0(0x10)(AutoWeak, AssetRegistrySearchable, AdvancedDisplay, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_2_Found; // 0xAB0(0x1)(None)
	uint8                                        Pad_D28[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_1_1_Value; // 0xAB4(0x4)(None)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_1_1_Cache; // 0xAB8(0x10)(ContainsInstancedReference, AdvancedDisplay, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_4_1_1_1_1_Found; // 0xAC8(0x1)(None)
	uint8                                        Pad_D29[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigVMDispatch_ArraySetAtIndex_1_Element; // 0xAD0(0x8)(None)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_RigVMFunction_ControlFlowBranch_1_1_BlockToRun; // 0xAD8(0x8)(None)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_Cache; // 0xAE0(0x10)(AdvancedDisplay, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_MathVectorDistance_2_Result; // 0xAF0(0x4)(None)
	uint8                                        Pad_D2A[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_3_1_2_Result; // 0xAF8(0x18)(None)
	struct FTransform                            Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_2_2_Transform; // 0xB10(0x60)(None)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_2_2_CachedIndex; // 0xB70(0x10)(AutoWeak, AssetRegistrySearchable, SimpleDisplay, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_3_1_2_A; // 0xB80(0x18)(None)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_3_1_1_1_Result; // 0xB98(0x18)(None)
	struct FTransform                            Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_1_2_Transform; // 0xBB0(0x60)(None)
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_5_Value; // 0xC10(0xC)(None)
	uint8                                        Pad_D2B[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_5_Cache; // 0xC20(0x10)(AutoWeak, ContainsInstancedReference, SimpleDisplay, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_5_Found; // 0xC30(0x1)(None)
	uint8                                        Pad_D2C[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_1_2_CachedIndex; // 0xC38(0x10)(SimpleDisplay, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_3_1_1_1_A; // 0xC48(0x18)(None)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_Success; // 0xC60(0x1)(None)
	uint8                                        Pad_D2D[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_1_Value; // 0xC64(0xC)(None)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_1_Cache; // 0xC70(0x10)(ContainsInstancedReference, AssetRegistrySearchable, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_1_Found; // 0xC80(0x1)(None)
	uint8                                        Pad_D2E[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_1_Cache; // 0xC88(0x10)(AutoWeak, ContainsInstancedReference, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_MathVectorDistance_2_1_Result; // 0xC98(0x4)(None)
	uint8                                        Pad_D2F[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_3_1_Result; // 0xCA0(0x18)(None)
	uint8                                        Pad_D30[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_2_2_1_Transform; // 0xCC0(0x60)(None)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_2_2_1_CachedIndex; // 0xD20(0x10)(AutoWeak, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_3_1_A; // 0xD30(0x18)(None)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_3_1_1_Result; // 0xD48(0x18)(None)
	struct FTransform                            Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_1_2_1_Transform; // 0xD60(0x60)(None)
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_2_Value; // 0xDC0(0xC)(None)
	uint8                                        Pad_D31[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_2_Cache; // 0xDD0(0x10)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_If_Result; // 0xDE0(0xC)(None)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_ItemExists_Exists; // 0xDEC(0x1)(None)
	uint8                                        Pad_D32[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_HierarchyGetParent_2_Parent; // 0xDF0(0xC)(None)
	uint8                                        Pad_D33[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_HierarchyGetParent_2_CachedChild; // 0xE00(0x10)(AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_HierarchyGetParent_2_CachedParent; // 0xE10(0x10)(AutoWeak, SimpleDisplay, AdvancedDisplay, Protected, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_ItemExists_CachedIndex; // 0xE20(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, Protected, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_2_Found; // 0xE30(0x1)(None)
	uint8                                        Pad_D34[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_1_2_1_CachedIndex; // 0xE38(0x10)(AssetRegistrySearchable, AdvancedDisplay, Protected, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_3_1_1_B; // 0xE48(0x18)(None)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_1_1_Success; // 0xE60(0x1)(None)
	uint8                                        Pad_D3A[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_2_1_1_Cache; // 0xE68(0x10)(ContainsInstancedReference, AdvancedDisplay, Protected, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_2_1_1_Success; // 0xE78(0x1)(None)
	uint8                                        Pad_D3C[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_5_1_Value; // 0xE7C(0xC)(None)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_5_1_Cache; // 0xE88(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, Protected, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_5_1_Found; // 0xE98(0x1)(None)
	uint8                                        Pad_D3D[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_3_1_Cache; // 0xEA0(0x10)(AutoWeak, AssetRegistrySearchable, SimpleDisplay, Protected, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FQuat                                 Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Multiply_11_Result; // 0xEB0(0x20)(None)
	struct FQuat                                 Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Inverse_1_Result; // 0xED0(0x20)(None)
	struct FQuat                                 Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_LookAt_1_1_Rotation; // 0xEF0(0x20)(None)
	struct FTransform                            Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_3_1_1_Transform; // 0xF10(0x60)(None)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_3_1_1_CachedIndex; // 0xF70(0x10)(ContainsInstancedReference, SimpleDisplay, Protected, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FQuat                                 Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_LookAt_1_1_CurrentRotation; // 0xF80(0x20)(None)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_LookAt_1_1_Position; // 0xFA0(0x18)(None)
	uint8                                        Pad_D3F[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_3_1_Transform; // 0xFC0(0x60)(None)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_GetTransform_3_1_CachedIndex; // 0x1020(0x10)(SimpleDisplay, Protected, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FVector                               Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_LookAt_1_1_ParentPosition; // 0x1030(0x18)(None)
	bool                                         LookAt_1_1___LookAt_DISPATCH_RigDispatch_CoreNotEquals_Result; // 0x1048(0x1)(None)
	uint8                                        Pad_D41[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            LookAt_1_1___LookAt_Cast_Result;                   // 0x1050(0x60)(None)
	struct FMatrix                               LookAt_1_1___LookAt_MathMatrixFromVectors_1_Result; // 0x10B0(0x80)(None)
	struct FVector                               LookAt_1_1___LookAt_Unit_Result;                   // 0x1130(0x18)(None)
	struct FVector                               LookAt_1_1___LookAt_Scale_Result;                  // 0x1148(0x18)(None)
	struct FVector                               LookAt_1_1___LookAt_Subtract_Result;               // 0x1160(0x18)(None)
	struct FVector                               LookAt_1_1___LookAt_MathVectorCross_1_1_Result;    // 0x1178(0x18)(None)
	struct FVector                               LookAt_1_1___LookAt_Rotate_Vector_1_Result;        // 0x1190(0x18)(None)
	struct FVector                               LookAt_1_1___LookAt_MathVectorCross_1_1_1_Result;  // 0x11A8(0x18)(None)
	struct FQuat                                 LookAt_1_1___LookAt_If_True;                       // 0x11C0(0x20)(None)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_3_1_Success; // 0x11E0(0x1)(None)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_CoreNotEquals_Result; // 0x11E1(0x1)(None)
	uint8                                        Pad_D42[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_HierarchyGetParent_Parent; // 0x11E4(0xC)(None)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_HierarchyGetParent_CachedChild; // 0x11F0(0x10)(AutoWeak, AssetRegistrySearchable, Protected, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_HierarchyGetParent_CachedParent; // 0x1200(0x10)(AutoWeak, ContainsInstancedReference, Protected, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FRigElementKey>                Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_MakeArrayFromStartToEndBone_Chain; // 0x1210(0x10)(Protected, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FRigElementKey>                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_CollectionChildrenArray_Items; // 0x1220(0x10)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FRigElementKey>                LocalVariable__MakeArrayFromStartToEndBone_ChildrenArray; // 0x1230(0x10)(BlueprintCallable, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayGetNum_Num; // 0x1240(0x4)(None)
	uint8                                        Pad_D44[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FRigElementKey>                MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_HierarchyGetParentsItemArray_Parents; // 0x1248(0x10)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FCachedRigElement>             MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_HierarchyGetParentsItemArray_CachedChild; // 0x1258(0x10)(AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FRigElementKeyCollection>      MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_HierarchyGetParentsItemArray_CachedParents; // 0x1268(0x10)(AutoWeak, SimpleDisplay, AdvancedDisplay, Protected, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FRigElementKey>                LocalVariable__MakeArrayFromStartToEndBone_ParentsArray; // 0x1278(0x10)(ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, Protected, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayGetNum_1_Num; // 0x1288(0x4)(None)
	bool                                         LocalVariable__MakeArrayFromStartToEndBone_ChainComplete; // 0x128C(0x1)(None)
	bool                                         MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_MathBoolNot_Result; // 0x128D(0x1)(None)
	bool                                         MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayFind_Success; // 0x128E(0x1)(None)
	uint8                                        Pad_D45[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_Element; // 0x1290(0xC)(None)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayFind_Index; // 0x129C(0x4)(None)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayAdd_Index; // 0x12A0(0x4)(None)
	class FName                                  MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_2_Value; // 0x12A4(0x8)(None)
	bool                                         MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_CoreEquals_Result; // 0x12AC(0x1)(None)
	uint8                                        Pad_D47[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_Branch_1_BlockToRun; // 0x12B0(0x8)(None)
	class FName                                  MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_Branch_BlockToRun; // 0x12B8(0x8)(None)
	class FName                                  MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_Branch_2_BlockToRun; // 0x12C0(0x8)(None)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_Index; // 0x12C8(0x4)(None)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_Count; // 0x12CC(0x4)(None)
	float                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_Ratio; // 0x12D0(0x4)(None)
	class FName                                  MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_BlockToRun; // 0x12D4(0x8)(None)
	struct FRigElementKey                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_Element; // 0x12DC(0xC)(None)
	class FName                                  MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_3_Value; // 0x12E8(0x8)(None)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_Index; // 0x12F0(0x4)(None)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_Count; // 0x12F4(0x4)(None)
	float                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_Ratio; // 0x12F8(0x4)(None)
	class FName                                  MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_BlockToRun; // 0x12FC(0x8)(None)
	struct FRigElementKey                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_1_Element; // 0x1304(0xC)(None)
	class FName                                  MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_DISPATCH_RigDispatch_Print_3_1_Value; // 0x1310(0x8)(None)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_1_Index; // 0x1318(0x4)(None)
	int32                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_1_Count; // 0x131C(0x4)(None)
	float                                        MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_1_Ratio; // 0x1320(0x4)(None)
	class FName                                  MakeArrayFromStartToEndBone___MakeArrayFromStartToEndBone_ArrayIterator_1_1_BlockToRun; // 0x1324(0x8)(None)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_CalculateLengthOfElementChain_Length; // 0x132C(0x4)(None)
	int32                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_ArrayGetNum_1_Num; // 0x1330(0x4)(None)
	int32                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathIntSub_1_Result; // 0x1334(0x4)(None)
	int32                                        LocalVariable__CalculateLengthOfElementChain_numBones; // 0x1338(0x4)(None)
	bool                                         CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathBoolNot_Result; // 0x133C(0x1)(None)
	bool                                         CalculateLengthOfElementChain___CalculateLengthOfElementChain_DISPATCH_RigDispatch_CoreEquals_Result; // 0x133D(0x1)(None)
	uint8                                        Pad_D4B[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_ArrayIterator_Index; // 0x1340(0x4)(None)
	int32                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathIntSub_Result; // 0x1344(0x4)(None)
	int32                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_ArrayIterator_Count; // 0x1348(0x4)(None)
	float                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathFloatAdd_Result; // 0x134C(0x4)(None)
	float                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathVectorDistance_Result; // 0x1350(0x4)(None)
	uint8                                        Pad_D4C[0xC];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            CalculateLengthOfElementChain___CalculateLengthOfElementChain_GetTransform_1_Transform; // 0x1360(0x60)(None)
	struct FRigElementKey                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_ArrayIterator_Element; // 0x13C0(0xC)(None)
	uint8                                        Pad_D4D[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             CalculateLengthOfElementChain___CalculateLengthOfElementChain_GetTransform_1_CachedIndex; // 0x13D0(0x10)(AssetRegistrySearchable, AdvancedDisplay, Protected, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FVector                               CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathVectorDistance_A; // 0x13E0(0x18)(None)
	uint8                                        Pad_D4E[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            CalculateLengthOfElementChain___CalculateLengthOfElementChain_GetTransform_Transform; // 0x1400(0x60)(None)
	struct FRigElementKey                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_ArrayGetAtIndex_Element; // 0x1460(0xC)(None)
	int32                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathIntAdd_Result; // 0x146C(0x4)(None)
	TArray<struct FCachedRigElement>             CalculateLengthOfElementChain___CalculateLengthOfElementChain_GetTransform_CachedIndex; // 0x1470(0x10)(AutoWeak, AdvancedDisplay, Protected, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FVector                               CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathVectorDistance_B; // 0x1480(0x18)(None)
	class FName                                  CalculateLengthOfElementChain___CalculateLengthOfElementChain_Branch_BlockToRun; // 0x1498(0x8)(None)
	float                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_ArrayIterator_Ratio; // 0x14A0(0x4)(None)
	class FName                                  CalculateLengthOfElementChain___CalculateLengthOfElementChain_ArrayIterator_BlockToRun; // 0x14A4(0x8)(None)
	float                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathFloatDiv_Result; // 0x14AC(0x4)(None)
	float                                        CalculateLengthOfElementChain___CalculateLengthOfElementChain_MathIntToFloat_Result; // 0x14B0(0x4)(None)
	float                                        LocalVariable__CalculateLengthOfElementChain_averageDistance; // 0x14B4(0x4)(None)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_Cache; // 0x14B8(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, Protected, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_Success; // 0x14C8(0x1)(None)
	uint8                                        Pad_D54[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_Cache; // 0x14D0(0x10)(AssetRegistrySearchable, SimpleDisplay, Protected, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_Value; // 0x14E0(0x4)(None)
	uint8                                        Pad_D55[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_Cache; // 0x14E8(0x10)(ContainsInstancedReference, SimpleDisplay, Protected, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_GetMetadata_Found; // 0x14F8(0x1)(None)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_Success; // 0x14F9(0x1)(None)
	uint8                                        Pad_D56[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Branch_1_BlockToRun; // 0x14FC(0x8)(None)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_Branch_BlockToRun; // 0x1504(0x8)(None)
	struct FRigElementKey                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigVMDispatch_ArrayGetAtIndex_Element; // 0x150C(0xC)(None)
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_Cache; // 0x1518(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, Protected, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_4_1_1_Success; // 0x1528(0x1)(None)
	uint8                                        Pad_D59[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_5_Cache; // 0x1530(0x10)(AutoWeak, AssetRegistrySearchable, Protected, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_DISPATCH_RigDispatch_SetMetadata_5_Success; // 0x1540(0x1)(None)
	uint8                                        Pad_D61[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_ArrayIterator_Count; // 0x1544(0x4)(None)
	float                                        Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_ArrayIterator_Ratio; // 0x1548(0x4)(None)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_ArrayIterator_BlockToRun; // 0x154C(0x8)(None)
	class FName                                  Initially_Update_Bone_Distances___Initially_Update_Bone_Distances_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x1554(0x8)(None)
	uint8                                        Pad_D62[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                GroundConformForwardsSolve___GroundConformForwardsSolve_GroundConform_TraceRadiiArray; // 0x1560(0x10)(ContainsInstancedReference, Protected, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<float>                                GroundConformForwardsSolve___GroundConformForwardsSolve_GroundConform_InBendStiffness; // 0x1570(0x10)(Protected, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigVMDispatch_If_1_Result; // 0x1580(0x8)(None)
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_Minimum_Result; // 0x1588(0x8)(None)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Cast_Result; // 0x1590(0x4)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_MathBoolNot_Result; // 0x1594(0x1)(None)
	uint8                                        Pad_D64[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_Minimum_A; // 0x1598(0x8)(None)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Cast_2_Result; // 0x15A0(0x4)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_MathBoolNot_2_Result; // 0x15A4(0x1)(None)
	uint8                                        Pad_D65[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_Minimum_B; // 0x15A8(0x8)(None)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_Result; // 0x15B0(0x4)(None)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_Target; // 0x15B4(0x4)(None)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_Velocity; // 0x15B8(0x4)(None)
	uint8                                        Pad_D67[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_SimulatedResult; // 0x15C0(0x10)(AutoWeak, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FFloatSpringState>             GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_SpringState; // 0x15D0(0x10)(AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigVMDispatch_If_1_True; // 0x15E0(0x8)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_GroundConform_Motionless; // 0x15E8(0x1)(None)
	uint8                                        Pad_D69[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigVMDispatch_If_2_Result; // 0x15EC(0x4)(None)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_Cast_1_Result; // 0x15F0(0x4)(None)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_1_Result; // 0x15F4(0x4)(None)
	float                                        GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_1_Velocity; // 0x15F8(0x4)(None)
	uint8                                        Pad_D6A[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_1_SimulatedResult; // 0x1600(0x10)(SimpleDisplay, AdvancedDisplay, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FFloatSpringState>             GroundConformForwardsSolve___GroundConformForwardsSolve_SpringInterp_1_SpringState; // 0x1610(0x10)(ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_GroundConform_GroundConformProgressIn; // 0x1620(0x8)(None)
	double                                       GroundConformForwardsSolve___GroundConformForwardsSolve_Multiply_Result; // 0x1628(0x8)(None)
	float                                        GroundConform___GroundConform_Entry_Effector_Rotation_Alpha; // 0x1630(0x4)(None)
	float                                        GroundConform___GroundConform_Entry_Effector_Strength_Alpha; // 0x1634(0x4)(None)
	float                                        GroundConform___GroundConform_Entry_Effector_Position_Alpha; // 0x1638(0x4)(None)
	float                                        GroundConform___GroundConform_Entry_Effector_Pin_Rotation; // 0x163C(0x4)(None)
	float                                        GroundConform___GroundConform_Entry_Effector_Pull_Chain_Alpha; // 0x1640(0x4)(None)
	float                                        GroundConform___GroundConform_Entry_SwimmingDragAmount; // 0x1644(0x4)(None)
	double                                       GroundConform___GroundConform_Entry_GroundConformProgressIn; // 0x1648(0x8)(None)
	TArray<double>                               GroundConform___GroundConform_Entry_TimingBias;    // 0x1650(0x10)(AutoWeak, ContainsInstancedReference, AdvancedDisplay, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	double                                       GroundConform___GroundConform_Entry_TimingBiasSpeed; // 0x1660(0x8)(None)
	bool                                         GroundConform___GroundConform_Entry_WasMotionless; // 0x1668(0x1)(None)
	uint8                                        Pad_D6B[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        GroundConform___GroundConform_Entry_HitNotifyCheckFrame; // 0x166C(0x4)(None)
	bool                                         GroundConform___GroundConform_Entry_TransformBones; // 0x1670(0x1)(None)
	bool                                         GroundConform___GroundConform_Entry_ShowDebug;     // 0x1671(0x1)(None)
	uint8                                        Pad_D6C[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       GroundConform___GroundConform_Entry_SleepPositionThreshold; // 0x1678(0x8)(None)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_17_Value; // 0x1680(0x1)(None)
	uint8                                        Pad_D6E[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        GroundConform___GroundConform_DISPATCH_RigVMDispatch_ArrayGetAtIndex_2_Element; // 0x1684(0xC)(None)
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_17_Cache; // 0x1690(0x10)(AutoWeak, AdvancedDisplay, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_17_Found; // 0x16A0(0x1)(None)
	bool                                         LocalVariable__GroundConform_bHasDynamicBase_LastFrame_Local; // 0x16A1(0x1)(None)
	bool                                         GroundConform___GroundConform_MathBoolNot_5_Result; // 0x16A2(0x1)(None)
	bool                                         LocalVariable__GroundConform_HasMotion;            // 0x16A3(0x1)(None)
	uint8                                        Pad_D6F[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FVector>                       GroundConform___GroundConform_ArrayClone_Clone;    // 0x16A8(0x10)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FVector>                       LocalVariable__GroundConform_EffectorPositionCache; // 0x16B8(0x10)(AssetRegistrySearchable, SimpleDisplay, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FRigElementKey                        GroundConform___GroundConform_ArrayGetAtIndex_14_Element; // 0x16C8(0xC)(None)
	int32                                        GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_9_Value; // 0x16D4(0x4)(None)
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_9_Cache; // 0x16D8(0x10)(AutoWeak, SimpleDisplay, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_9_Found; // 0x16E8(0x1)(None)
	bool                                         GroundConform___GroundConform_LessEqual_2_Result;  // 0x16E9(0x1)(None)
	uint8                                        Pad_D70[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_1_1_Cache; // 0x16F0(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_1_1_Success; // 0x1700(0x1)(None)
	bool                                         LocalVariable__GroundConform_bShouldCheckHitNotify; // 0x1701(0x1)(None)
	uint8                                        Pad_D71[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_6_Cache; // 0x1708(0x10)(AssetRegistrySearchable, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	int32                                        GroundConform___GroundConform_Subtract_9_Result;   // 0x1718(0x4)(None)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_6_Success; // 0x171C(0x1)(None)
	uint8                                        Pad_D72[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  GroundConform___GroundConform_Branch_1_1_BlockToRun; // 0x1720(0x8)(None)
	struct FRigElementKey                        GroundConform___GroundConform_ArrayIterator_1_1_Element; // 0x1728(0xC)(None)
	uint8                                        Pad_D75[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_Cache; // 0x1738(0x10)(ContainsInstancedReference, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	uint8                                        Pad_D76[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            GroundConform___GroundConform_GetTransform_3_Transform; // 0x1750(0x60)(None)
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_GetTransform_3_CachedIndex; // 0x17B0(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FVector                               GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_Value; // 0x17C0(0x18)(None)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_Success; // 0x17D8(0x1)(None)
	uint8                                        Pad_D77[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_7_Cache; // 0x17E0(0x10)(AutoWeak, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FQuat                                 GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_7_Value; // 0x17F0(0x20)(None)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_7_Success; // 0x1810(0x1)(None)
	uint8                                        Pad_D78[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        GroundConform___GroundConform_ArrayIterator_1_1_Index; // 0x1814(0x4)(None)
	int32                                        GroundConform___GroundConform_ArrayIterator_1_1_Count; // 0x1818(0x4)(None)
	float                                        GroundConform___GroundConform_ArrayIterator_1_1_Ratio; // 0x181C(0x4)(None)
	class FName                                  GroundConform___GroundConform_ArrayIterator_1_1_BlockToRun; // 0x1820(0x8)(None)
	int32                                        GroundConform___GroundConform_ArrayIterator_1_Index; // 0x1828(0x4)(None)
	int32                                        LocalVariable__GroundConform_CurrentIndex;         // 0x182C(0x4)(None)
	struct FRigElementKey                        GroundConform___GroundConform_ArrayIterator_1_Element; // 0x1830(0xC)(None)
	struct FRigElementKey                        LocalVariable__GroundConform_CurrentElement;       // 0x183C(0xC)(None)
	struct FRigElementKey                        GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_2_Value; // 0x1848(0xC)(None)
	uint8                                        Pad_D7A[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_2_Cache; // 0x1858(0x10)(ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_2_Found; // 0x1868(0x1)(None)
	uint8                                        Pad_D7B[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        LocalVariable__GroundConform_CurrentControl;       // 0x186C(0xC)(None)
	uint8                                        Pad_D7C[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            GroundConform___GroundConform_GetTransform_5_2_Transform; // 0x1880(0x60)(None)
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_GetTransform_5_2_CachedIndex; // 0x18E0(0x10)(SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FTransform                            LocalVariable__GroundConform_CurrentTransform;     // 0x18F0(0x60)(None)
	struct FTransform                            GroundConform___GroundConform_GetTransform_2_Transform; // 0x1950(0x60)(None)
	struct FRigElementKey                        GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_5_1_Value; // 0x19B0(0xC)(None)
	uint8                                        Pad_D7D[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_5_1_Cache; // 0x19C0(0x10)(AutoWeak, AssetRegistrySearchable, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_5_1_Found; // 0x19D0(0x1)(None)
	uint8                                        Pad_D7E[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_GetTransform_2_CachedIndex; // 0x19D8(0x10)(AutoWeak, ContainsInstancedReference, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	uint8                                        Pad_D7F[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            LocalVariable__GroundConform_ParentTransform;      // 0x19F0(0x60)(None)
	double                                       GroundConform___GroundConform_Multiply_10_Result;  // 0x1A50(0x8)(None)
	double                                       GroundConform___GroundConform_Clamp_1_Result;      // 0x1A58(0x8)(None)
	double                                       GroundConform___GroundConform_Subtract_8_Result;   // 0x1A60(0x8)(None)
	double                                       GroundConform___GroundConform_Add_2_Result;        // 0x1A68(0x8)(None)
	double                                       GroundConform___GroundConform_Multiply_13_1_Result; // 0x1A70(0x8)(None)
	double                                       GroundConform___GroundConform_Multiply_15_Result;  // 0x1A78(0x8)(None)
	double                                       GroundConform___GroundConform_Multiply_13_Result;  // 0x1A80(0x8)(None)
	double                                       GroundConform___GroundConform_Clamp_2_Result;      // 0x1A88(0x8)(None)
	double                                       GroundConform___GroundConform_ArrayGetAtIndex_15_Element; // 0x1A90(0x8)(None)
	double                                       LocalVariable__GroundConform_CurrentElementGravity; // 0x1A98(0x8)(None)
	float                                        GroundConform___GroundConform_If_16_Result;        // 0x1AA0(0x4)(None)
	bool                                         GroundConform___GroundConform_ArrayGetAtIndex_9_1_1_Element; // 0x1AA4(0x1)(None)
	uint8                                        Pad_D80[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_Value; // 0x1AA8(0x4)(None)
	uint8                                        Pad_D82[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_Cache; // 0x1AB0(0x10)(AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_Found; // 0x1AC0(0x1)(None)
	uint8                                        Pad_D83[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_2_Value; // 0x1AC4(0x4)(None)
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_2_Cache; // 0x1AC8(0x10)(AutoWeak, ContainsInstancedReference, AdvancedDisplay, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_2_Found; // 0x1AD8(0x1)(None)
	uint8                                        Pad_D84[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LocalVariable__GroundConform_DistanceToParent;     // 0x1ADC(0x4)(None)
	struct FVector                               GroundConform___GroundConform_Add_5_Result;        // 0x1AE0(0x18)(None)
	struct FVector                               GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_4_Value; // 0x1AF8(0x18)(None)
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_4_Cache; // 0x1B10(0x10)(AdvancedDisplay, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_4_Found; // 0x1B20(0x1)(None)
	uint8                                        Pad_D85[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_7_Value; // 0x1B28(0x18)(None)
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_7_Cache; // 0x1B40(0x10)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_7_Found; // 0x1B50(0x1)(None)
	uint8                                        Pad_D86[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               LocalVariable__GroundConform_TraceCenter_Local;    // 0x1B58(0x18)(None)
	TArray<struct FVector>                       LocalVariable__GroundConform_TracePathPositions_Local; // 0x1B70(0x10)(AutoWeak, ContainsInstancedReference, SimpleDisplay, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FVector                               GroundConform___GroundConform_Add_3_1_Add_3_1_Result; // 0x1B80(0x18)(None)
	struct FVector                               GroundConform___GroundConform_Add_3_1_Add_3_Result; // 0x1B98(0x18)(None)
	struct FVector                               GroundConform___GroundConform_Add_8_Result;        // 0x1BB0(0x18)(None)
	double                                       GroundConform___GroundConform_Multiply_2_Result;   // 0x1BC8(0x8)(None)
	double                                       GroundConform___GroundConform_Multiply_5_Result;   // 0x1BD0(0x8)(None)
	float                                        GroundConform___GroundConform_If_18_Result;        // 0x1BD8(0x4)(None)
	bool                                         GroundConform___GroundConform_MathBoolAnd_2_MathBoolAnd_2_1_Result; // 0x1BDC(0x1)(None)
	bool                                         GroundConform___GroundConform_MathBoolAnd_2_MathBoolAnd_2_Result; // 0x1BDD(0x1)(None)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_12_Found; // 0x1BDE(0x1)(None)
	uint8                                        Pad_D87[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_12_Cache; // 0x1BE0(0x10)(AutoWeak, SimpleDisplay, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	float                                        GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_12_Value; // 0x1BF0(0x4)(None)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_CoreNotEquals_1_Result; // 0x1BF4(0x1)(None)
	uint8                                        Pad_D88[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       GroundConform___GroundConform_ArrayGetAtIndex_6_Element; // 0x1BF8(0x8)(None)
	float                                        GroundConform___GroundConform_If_18_False;         // 0x1C00(0x4)(None)
	uint8                                        Pad_D89[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       GroundConform___GroundConform_Multiply_5_A;        // 0x1C08(0x8)(None)
	struct FVector                               GroundConform___GroundConform_Add_3_1_Add_3_B;     // 0x1C10(0x18)(None)
	struct FVector                               GroundConform___GroundConform_If_1_Result;         // 0x1C28(0x18)(None)
	struct FVector                               GroundConform___GroundConform_Add_3_Add_3_1_Result; // 0x1C40(0x18)(None)
	struct FVector                               GroundConform___GroundConform_Add_3_Add_3_Result;  // 0x1C58(0x18)(None)
	double                                       GroundConform___GroundConform_Multiply_4_2_Result; // 0x1C70(0x8)(None)
	double                                       GroundConform___GroundConform_Multiply_4_2_A;      // 0x1C78(0x8)(None)
	double                                       GroundConform___GroundConform_DISPATCH_RigVMDispatch_If_1_Result; // 0x1C80(0x8)(None)
	bool                                         GroundConform___GroundConform_ArrayGetAtIndex_9_1_1_1_Element; // 0x1C88(0x1)(None)
	uint8                                        Pad_D8B[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       GroundConform___GroundConform_Add_9_Result;        // 0x1C90(0x8)(None)
	double                                       GroundConform___GroundConform_Add_9_1_Result;      // 0x1C98(0x8)(None)
	struct FVector                               GroundConform___GroundConform_Add_3_Add_3_B;       // 0x1CA0(0x18)(None)
	struct FVector                               GroundConform___GroundConform_Interpolate_Result;  // 0x1CB8(0x18)(None)
	struct FVector                               GroundConform___GroundConform_Add_6_Result;        // 0x1CD0(0x18)(None)
	struct FVector                               GroundConform___GroundConform_DISPATCH_RigVMDispatch_If_Result; // 0x1CE8(0x18)(None)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_CoreNotEquals_1_1_Result; // 0x1D00(0x1)(None)
	uint8                                        Pad_D8D[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               GroundConform___GroundConform_DISPATCH_RigVMDispatch_If_True; // 0x1D08(0x18)(None)
	double                                       GroundConform___GroundConform_Multiply_4_3_Result; // 0x1D20(0x8)(None)
	double                                       GroundConform___GroundConform_Multiply_4_3_A;      // 0x1D28(0x8)(None)
	struct FVector                               GroundConform___GroundConform_Add_6_B__IO;         // 0x1D30(0x18)(None)
	float                                        GroundConform___GroundConform_Interpolate_T;       // 0x1D48(0x4)(None)
	uint8                                        Pad_D8E[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FVector>                       GroundConform___GroundConform_ArrayAppend_Other__IO; // 0x1D50(0x10)(ContainsInstancedReference, AssetRegistrySearchable, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         LocalVariable__GroundConform_FirstSphereTrace_bHit; // 0x1D60(0x1)(None)
	bool                                         LocalVariable__GroundConform_SphereTrace_bHit;     // 0x1D61(0x1)(None)
	uint8                                        Pad_D8F[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               GroundConform___GroundConform_ArrayGetAtIndex_8_1_Element; // 0x1D68(0x18)(None)
	bool                                         GroundConform___GroundConform_SphereTraceByTraceChannel_bHit; // 0x1D80(0x1)(None)
	uint8                                        Pad_D90[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               GroundConform___GroundConform_ArrayGetAtIndex_8_Element; // 0x1D88(0x18)(None)
	float                                        GroundConform___GroundConform_ArrayGetAtIndex_2_1_Element; // 0x1DA0(0x4)(None)
	uint8                                        Pad_D91[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               GroundConform___GroundConform_SphereTraceByTraceChannel_HitLocation; // 0x1DA8(0x18)(None)
	struct FVector                               GroundConform___GroundConform_SphereTraceByTraceChannel_HitNormal; // 0x1DC0(0x18)(None)
	struct FHitResult                            GroundConform___GroundConform_SphereTraceByTraceChannel_WorldSpaceHitResult; // 0x1DD8(0xF0)(ZeroConstructor)
	struct FHitResult                            GroundConform___GroundConform_SphereTraceByTraceChannel_1_WorldSpaceHitResult; // 0x1EC8(0xF0)(ZeroConstructor)
	struct FVector                               GroundConform___GroundConform_ArrayGetAtIndex_8_1_1_Element; // 0x1FB8(0x18)(None)
	float                                        GroundConform___GroundConform_ArrayGetAtIndex_2_Element; // 0x1FD0(0x4)(None)
	bool                                         GroundConform___GroundConform_SphereTraceByTraceChannel_1_bHit; // 0x1FD4(0x1)(None)
	uint8                                        Pad_D93[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               GroundConform___GroundConform_SphereTraceByTraceChannel_1_HitLocation; // 0x1FD8(0x18)(None)
	struct FVector                               GroundConform___GroundConform_SphereTraceByTraceChannel_1_HitNormal; // 0x1FF0(0x18)(None)
	struct FHitResult                            GroundConform___GroundConform_If_17_Result;        // 0x2008(0xF0)(ZeroConstructor)
	struct FHitResult                            LocalVariable__GroundConform_SphereTraceByTraceChannel_WorldSpaceHitResult; // 0x20F8(0xF0)(ZeroConstructor)
	bool                                         GroundConform___GroundConform_MathBoolOr_Result;   // 0x21E8(0x1)(None)
	uint8                                        Pad_D94[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               GroundConform___GroundConform_If_2_3_Result;       // 0x21F0(0x18)(None)
	struct FVector                               GroundConform___GroundConform_From_World_3_Global; // 0x2208(0x18)(None)
	struct FVector                               GroundConform___GroundConform_From_World_3_Value__IO; // 0x2220(0x18)(None)
	struct FVector                               GroundConform___GroundConform_If_11_Result;        // 0x2238(0x18)(None)
	struct FVector                               GroundConform___GroundConform_From_World_3_1_Global; // 0x2250(0x18)(None)
	struct FVector                               GroundConform___GroundConform_From_World_3_1_Value__IO; // 0x2268(0x18)(None)
	struct FVector                               LocalVariable__GroundConform_TraceHitPosition_Local; // 0x2280(0x18)(None)
	struct FVector                               GroundConform___GroundConform_MinDistanceToParentConstraint_Result; // 0x2298(0x18)(None)
	struct FVector                               GroundConform___GroundConform_Add_4_Result;        // 0x22B0(0x18)(None)
	struct FVector                               GroundConform___GroundConform_DISPATCH_RigVMDispatch_If_2_Result; // 0x22C8(0x18)(None)
	bool                                         GroundConform___GroundConform_RigVMFunction_MathBoolAnd_1_Result; // 0x22E0(0x1)(None)
	bool                                         GroundConform___GroundConform_Less_1_Result;       // 0x22E1(0x1)(None)
	uint8                                        Pad_D96[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               GroundConform___GroundConform_Rotate_Vector_1_Result; // 0x22E8(0x18)(None)
	struct FQuat                                 GroundConform___GroundConform_From_World_4_1_Global; // 0x2300(0x20)(None)
	struct FVector                               GroundConform___GroundConform_Add_10_1_Result;     // 0x2320(0x18)(None)
	struct FVector                               GroundConform___GroundConform_Add_10_1_A__IO;      // 0x2338(0x18)(None)
	double                                       GroundConform___GroundConform_Less_1_A;            // 0x2350(0x8)(None)
	bool                                         GroundConform___GroundConform_DISPATCH_RigVMDispatch_CoreEquals_2_Result; // 0x2358(0x1)(None)
	uint8                                        Pad_D97[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        GroundConform___GroundConform_DISPATCH_RigVMDispatch_CoreEquals_2_A; // 0x235C(0x4)(None)
	float                                        GroundConform___GroundConform_ArrayGetAtIndex_2_2_1_Element; // 0x2360(0x4)(None)
	uint8                                        Pad_D98[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       GroundConform___GroundConform_MinDistanceToParentConstraint_Radius; // 0x2368(0x8)(None)
	TArray<double>                               GroundConform___GroundConform_MinDistanceToParentConstraint_TraceRadii; // 0x2370(0x10)(AssetRegistrySearchable, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         MinDistanceToParentConstraint___MinDistanceToParentConstraint_MathBoolAnd_Result; // 0x2380(0x1)(None)
	bool                                         MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_CoreNotEquals_Result; // 0x2381(0x1)(None)
	bool                                         MinDistanceToParentConstraint___MinDistanceToParentConstraint_Less_Result; // 0x2382(0x1)(None)
	uint8                                        Pad_D99[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinDistanceToParentConstraint___MinDistanceToParentConstraint_MathVectorLength_Result; // 0x2384(0x4)(None)
	struct FVector                               MinDistanceToParentConstraint___MinDistanceToParentConstraint_Subtract_Result; // 0x2388(0x18)(None)
	struct FVector                               MinDistanceToParentConstraint___MinDistanceToParentConstraint_Subtract_B; // 0x23A0(0x18)(None)
	double                                       MinDistanceToParentConstraint___MinDistanceToParentConstraint_Less_A; // 0x23B8(0x8)(None)
	double                                       MinDistanceToParentConstraint___MinDistanceToParentConstraint_Multiply_Result; // 0x23C0(0x8)(None)
	double                                       MinDistanceToParentConstraint___MinDistanceToParentConstraint_Add_Result; // 0x23C8(0x8)(None)
	double                                       MinDistanceToParentConstraint___MinDistanceToParentConstraint_ArrayGetAtIndex_Element; // 0x23D0(0x8)(None)
	int32                                        MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_14_Value; // 0x23D8(0x4)(None)
	struct FRigElementKey                        MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_6_1_Value; // 0x23DC(0xC)(None)
	TArray<struct FCachedRigElement>             MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_6_1_Cache; // 0x23E8(0x10)(AutoWeak, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_6_1_Found; // 0x23F8(0x1)(None)
	uint8                                        Pad_D9B[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_14_Cache; // 0x2400(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         MinDistanceToParentConstraint___MinDistanceToParentConstraint_DISPATCH_RigDispatch_GetMetadata_14_Found; // 0x2410(0x1)(None)
	uint8                                        Pad_D9E[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               MinDistanceToParentConstraint___MinDistanceToParentConstraint_Add_1_Result; // 0x2418(0x18)(None)
	struct FVector                               MinDistanceToParentConstraint___MinDistanceToParentConstraint_Scale_1_Result; // 0x2430(0x18)(None)
	struct FVector                               MinDistanceToParentConstraint___MinDistanceToParentConstraint_Unit_1_Result; // 0x2448(0x18)(None)
	float                                        MinDistanceToParentConstraint___MinDistanceToParentConstraint_Scale_1_Factor; // 0x2460(0x4)(None)
	uint8                                        Pad_D9F[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               LocalVariable__GroundConform_FalseIn;              // 0x2468(0x18)(None)
	struct FVector                               GroundConform___GroundConform_If_13_Result;        // 0x2480(0x18)(None)
	struct FVector                               GroundConform___GroundConform_LocalBendConstraint_Optimized_1_TranslationOut; // 0x2498(0x18)(None)
	struct FVector                               GroundConform___GroundConform_DistanceToParentConstraint_Result; // 0x24B0(0x18)(None)
	struct FVector                               GroundConform___GroundConform_DistanceToParentConstraint_ParentPosition; // 0x24C8(0x18)(None)
	double                                       GroundConform___GroundConform_DistanceToParentConstraint_ParentDistanceIn; // 0x24E0(0x8)(None)
	struct FVector                               DistanceToParentConstraint___DistanceToParentConstraint_Scale_1_Result; // 0x24E8(0x18)(None)
	struct FVector                               DistanceToParentConstraint___DistanceToParentConstraint_Unit_1_Result; // 0x2500(0x18)(None)
	struct FVector                               DistanceToParentConstraint___DistanceToParentConstraint_Subtract_1_Result; // 0x2518(0x18)(None)
	float                                        DistanceToParentConstraint___DistanceToParentConstraint_Scale_1_Factor; // 0x2530(0x4)(None)
	float                                        GroundConform___GroundConform_ArrayGetAtIndex_7_Element; // 0x2534(0x4)(None)
	struct FVector                               GroundConform___GroundConform_LocalBendConstraint_Optimized_1_Target; // 0x2538(0x18)(None)
	struct FQuat                                 GroundConform___GroundConform_LocalBendConstraint_Optimized_1_DefaultRotation; // 0x2550(0x20)(None)
	double                                       GroundConform___GroundConform_LocalBendConstraint_Optimized_1_ParentDistanceIn; // 0x2570(0x8)(None)
	uint8                                        Pad_DA0[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Make_Absolute_1_2_Global; // 0x2580(0x60)(None)
	struct FTransform                            LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_DISPATCH_RigDispatch_GetMetadata_2_Value; // 0x25E0(0x60)(None)
	TArray<struct FCachedRigElement>             LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_DISPATCH_RigDispatch_GetMetadata_2_Cache; // 0x2640(0x10)(AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FTransform                            LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_DISPATCH_RigDispatch_GetMetadata_2_Default__IO; // 0x2650(0x60)(None)
	bool                                         LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_DISPATCH_RigDispatch_GetMetadata_2_Found; // 0x26B0(0x1)(None)
	uint8                                        Pad_DA1[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_DistanceToParentConstraint_Result; // 0x26B8(0x18)(None)
	struct FVector                               LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Interpolate_2_Result; // 0x26D0(0x18)(None)
	float                                        LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_If_1_Result; // 0x26E8(0x4)(None)
	uint8                                        Pad_DA2[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Multiply_2_Result; // 0x26F0(0x8)(None)
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_If_6_Result; // 0x26F8(0x8)(None)
	bool                                         LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_MathBoolAnd_1_Result; // 0x2700(0x1)(None)
	bool                                         LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Less_Result; // 0x2701(0x1)(None)
	uint8                                        Pad_DA3[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Less_A; // 0x2708(0x8)(None)
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Less_B; // 0x2710(0x8)(None)
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Multiply_2_B; // 0x2718(0x8)(None)
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Multiply_3_Multiply_3_2_Result; // 0x2720(0x8)(None)
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Multiply_3_Multiply_3_1_Result; // 0x2728(0x8)(None)
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Multiply_3_Multiply_3_Result; // 0x2730(0x8)(None)
	float                                        LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_GetDeltaTime_Result; // 0x2738(0x4)(None)
	uint8                                        Pad_DA4[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_Multiply_3_Multiply_3_B; // 0x2740(0x8)(None)
	float                                        LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_If_1_True; // 0x2748(0x4)(None)
	float                                        LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_If_1_False; // 0x274C(0x4)(None)
	struct FVector                               LocalBendConstraint_Optimized_1___LocalBendConstraint_Optimized_DistanceToParentConstraint_ParentPosition; // 0x2750(0x18)(None)
	struct FVector                               DistanceToParentConstraint___DistanceToParentConstraint_Scale_1_Result; // 0x2768(0x18)(None)
	struct FVector                               DistanceToParentConstraint___DistanceToParentConstraint_Unit_1_Result; // 0x2780(0x18)(None)
	struct FVector                               DistanceToParentConstraint___DistanceToParentConstraint_Subtract_1_Result; // 0x2798(0x18)(None)
	float                                        DistanceToParentConstraint___DistanceToParentConstraint_Scale_1_Factor; // 0x27B0(0x4)(None)
	uint8                                        Pad_DA5[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               LocalVariable__GroundConform_TrueIn;               // 0x27B8(0x18)(None)
	bool                                         GroundConform___GroundConform_ArrayGetAtIndex_9_Element; // 0x27D0(0x1)(None)
	bool                                         LocalVariable__GroundConform_BoolIn;               // 0x27D1(0x1)(None)
	uint8                                        Pad_DA6[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               GroundConform___GroundConform_If_4_Result;         // 0x27D8(0x18)(None)
	struct FVector                               LocalVariable__GroundConform_If_4_Result;          // 0x27F0(0x18)(None)
	struct FVector                               LocalVariable__GroundConform_TargetPosition;       // 0x2808(0x18)(None)
	bool                                         GroundConform___GroundConform_MathBoolAnd_Result;  // 0x2820(0x1)(None)
	bool                                         GroundConform___GroundConform_Greater_1_Result;    // 0x2821(0x1)(None)
	uint8                                        Pad_DA7[0xE];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQuat                                 GroundConform___GroundConform_If_12_Result;        // 0x2830(0x20)(None)
	struct FQuat                                 GroundConform___GroundConform_ReorientBone_Result; // 0x2850(0x20)(None)
	struct FVector                               GroundConform___GroundConform_ReorientBone_ParentPosition; // 0x2870(0x18)(None)
	uint8                                        Pad_DA8[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQuat                                 ReorientBone___ReorientBone_If_16_Result;          // 0x2890(0x20)(None)
	bool                                         ReorientBone___ReorientBone_DISPATCH_RigDispatch_CoreNotEquals_Result; // 0x28B0(0x1)(None)
	uint8                                        Pad_DA9[0xF];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQuat                                 ReorientBone___ReorientBone_Multiply_Multiply_1_Result; // 0x28C0(0x20)(None)
	struct FQuat                                 ReorientBone___ReorientBone_Multiply_Multiply_Result; // 0x28E0(0x20)(None)
	struct FQuat                                 ReorientBone___ReorientBone_Unit_3_Result;         // 0x2900(0x20)(None)
	struct FQuat                                 ReorientBone___ReorientBone_MathQuaternionFromAxisAndAngle_Result; // 0x2920(0x20)(None)
	struct FVector                               ReorientBone___ReorientBone_Unit_2_Result;         // 0x2940(0x18)(None)
	struct FVector                               ReorientBone___ReorientBone_MathVectorCross_Result; // 0x2958(0x18)(None)
	struct FVector                               ReorientBone___ReorientBone_Unit_1_Result;         // 0x2970(0x18)(None)
	struct FVector                               ReorientBone___ReorientBone_Subtract_1_Result;     // 0x2988(0x18)(None)
	struct FVector                               ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_Value; // 0x29A0(0x18)(None)
	TArray<struct FCachedRigElement>             ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_Cache; // 0x29B8(0x10)(ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_Found; // 0x29C8(0x1)(None)
	uint8                                        Pad_DAA[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_1_Value; // 0x29D0(0x18)(None)
	struct FRigElementKey                        ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_Value; // 0x29E8(0xC)(None)
	uint8                                        Pad_DAB[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_Cache; // 0x29F8(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, Protected, BlueprintCallable, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_Found; // 0x2A08(0x1)(None)
	uint8                                        Pad_DAC[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_1_Cache; // 0x2A10(0x10)(AutoWeak, AssetRegistrySearchable, AdvancedDisplay, Protected, BlueprintCallable, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_1_Found; // 0x2A20(0x1)(None)
	uint8                                        Pad_DAD[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               ReorientBone___ReorientBone_Unit_Result;           // 0x2A28(0x18)(None)
	struct FVector                               ReorientBone___ReorientBone_Subtract_Result;       // 0x2A40(0x18)(None)
	double                                       ReorientBone___ReorientBone_Acos_Result;           // 0x2A58(0x8)(None)
	float                                        ReorientBone___ReorientBone_Dot___Result;          // 0x2A60(0x4)(None)
	uint8                                        Pad_DAE[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       ReorientBone___ReorientBone_Acos_Value;            // 0x2A68(0x8)(None)
	float                                        ReorientBone___ReorientBone_MathQuaternionFromAxisAndAngle_Angle; // 0x2A70(0x4)(None)
	uint8                                        Pad_DB0[0xC];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQuat                                 ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_1_Value; // 0x2A80(0x20)(None)
	TArray<struct FCachedRigElement>             ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_1_Cache; // 0x2AA0(0x10)(ContainsInstancedReference, AdvancedDisplay, Protected, BlueprintCallable, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         ReorientBone___ReorientBone_DISPATCH_RigDispatch_GetMetadata_1_Found; // 0x2AB0(0x1)(None)
	uint8                                        Pad_DB1[0xF];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQuat                                 ReorientBone___ReorientBone_If_16_False;           // 0x2AC0(0x20)(None)
	struct FQuat                                 GroundConform___GroundConform_If_12_False;         // 0x2AE0(0x20)(None)
	struct FQuat                                 LocalVariable__GroundConform_TargetRotation;       // 0x2B00(0x20)(None)
	bool                                         GroundConform___GroundConform_RigVMFunction_MathBoolOr_Result; // 0x2B20(0x1)(None)
	bool                                         GroundConform___GroundConform_RigVMFunction_MathBoolAnd_Result; // 0x2B21(0x1)(None)
	bool                                         GroundConform___GroundConform_RigVMFunction_MathBoolNot_Result; // 0x2B22(0x1)(None)
	bool                                         GroundConform___GroundConform_IsNearlyEqual_Result; // 0x2B23(0x1)(None)
	uint8                                        Pad_DB2[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               GroundConform___GroundConform_ArrayGetAtIndex_16_Element; // 0x2B28(0x18)(None)
	struct FVector                               GroundConform___GroundConform_ToWorldCustom_1_Result; // 0x2B40(0x18)(None)
	struct FVector                               ToWorldCustom_1___ToWorldCustom_To_World_1_1_World; // 0x2B58(0x18)(None)
	class FName                                  GroundConform___GroundConform_Branch_11_BlockToRun; // 0x2B70(0x8)(None)
	struct FVector                               GroundConform___GroundConform_ArrayGetAtIndex_Element; // 0x2B78(0x18)(None)
	struct FVector                               LocalVariable__GroundConform_PreviousPosition;     // 0x2B90(0x18)(None)
	struct FVector                               GroundConform___GroundConform_ToWorldCustom_Result; // 0x2BA8(0x18)(None)
	struct FVector                               ToWorldCustom___ToWorldCustom_To_World_1_1_World;  // 0x2BC0(0x18)(None)
	double                                       GroundConform___GroundConform_Multiply_1_Result;   // 0x2BD8(0x8)(None)
	double                                       GroundConform___GroundConform_Multiply_1_A;        // 0x2BE0(0x8)(None)
	double                                       GroundConform___GroundConform_ArrayGetAtIndex_10_Element; // 0x2BE8(0x8)(None)
	double                                       GroundConform___GroundConform_Multiply_3_Result;   // 0x2BF0(0x8)(None)
	double                                       GroundConform___GroundConform_If_9_Result;         // 0x2BF8(0x8)(None)
	bool                                         GroundConform___GroundConform_LessEqual_1_1_Result; // 0x2C00(0x1)(None)
	uint8                                        Pad_DB3[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        GroundConform___GroundConform_MathVectorDistance_1_Result; // 0x2C04(0x4)(None)
	struct FVector                               GroundConform___GroundConform_From_World_2_3_Global; // 0x2C08(0x18)(None)
	struct FVector                               GroundConform___GroundConform_From_World_2_3_Value__IO; // 0x2C20(0x18)(None)
	struct FVector                               GroundConform___GroundConform_FromWorldCustom_3_Result; // 0x2C38(0x18)(None)
	struct FVector                               GroundConform___GroundConform_ArrayGetAtIndex_1_1_1_1_Element; // 0x2C50(0x18)(None)
	struct FVector                               FromWorldCustom_3___FromWorldCustom_From_World_Global; // 0x2C68(0x18)(None)
	double                                       GroundConform___GroundConform_LessEqual_1_1_A;     // 0x2C80(0x8)(None)
	float                                        GroundConform___GroundConform_ArrayGetAtIndex_2_1_1_1_Element; // 0x2C88(0x4)(None)
	uint8                                        Pad_DB4[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       GroundConform___GroundConform_LessEqual_1_1_B;     // 0x2C90(0x8)(None)
	double                                       GroundConform___GroundConform_Clamp_Result;        // 0x2C98(0x8)(None)
	double                                       GroundConform___GroundConform_Clamp_Value;         // 0x2CA0(0x8)(None)
	double                                       GroundConform___GroundConform_ArrayGetAtIndex_3_Element; // 0x2CA8(0x8)(None)
	double                                       GroundConform___GroundConform_Multiply_16_Result;  // 0x2CB0(0x8)(None)
	double                                       GroundConform___GroundConform_Interpolate_1_1_Result; // 0x2CB8(0x8)(None)
	double                                       GroundConform___GroundConform_Multiply_Result;     // 0x2CC0(0x8)(None)
	double                                       GroundConform___GroundConform_Interpolate_1_2_Result; // 0x2CC8(0x8)(None)
	struct FVector                               GroundConform___GroundConform_Solver_Position;     // 0x2CD0(0x18)(None)
	uint8                                        Pad_DB5[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQuat                                 GroundConform___GroundConform_Solver_DefaultRot;   // 0x2CF0(0x20)(None)
	double                                       GroundConform___GroundConform_Solver_ParentDistanceIn; // 0x2D10(0x8)(None)
	float                                        GroundConform___GroundConform_ArrayGetAtIndex_7_1_Element; // 0x2D18(0x4)(None)
	uint8                                        Pad_DB6[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       GroundConform___GroundConform_Solver_BendStiffnessIn; // 0x2D20(0x8)(None)
	bool                                         GroundConform___GroundConform_ArrayGetAtIndex_9_3_Element; // 0x2D28(0x1)(None)
	uint8                                        Pad_DB7[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               Solver___Solver_If_4_Result;                       // 0x2D30(0x18)(None)
	bool                                         Solver___Solver_Greater_Result;                    // 0x2D48(0x1)(None)
	uint8                                        Pad_DB8[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Solver___Solver_Greater_A;                         // 0x2D50(0x8)(None)
	struct FVector                               Solver___Solver_If_22_Result;                      // 0x2D58(0x18)(None)
	bool                                         Solver___Solver_Greater_3_Result;                  // 0x2D70(0x1)(None)
	uint8                                        Pad_DB9[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Solver___Solver_MathVectorLength_2_Result;         // 0x2D74(0x4)(None)
	struct FVector                               Solver___Solver_Scale_4_Result;                    // 0x2D78(0x18)(None)
	struct FVector                               Solver___Solver_Subtract_5_Result;                 // 0x2D90(0x18)(None)
	struct FVector                               Solver___Solver_If_1_Result;                       // 0x2DA8(0x18)(None)
	bool                                         Solver___Solver_GreaterEqual_1_Result;             // 0x2DC0(0x1)(None)
	uint8                                        Pad_DBA[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Solver___Solver_GetDeltaTime_3_1_Result;           // 0x2DC4(0x4)(None)
	double                                       Solver___Solver_GreaterEqual_1_A;                  // 0x2DC8(0x8)(None)
	struct FVector                               Solver___Solver_Interpolate_1_1_Result;            // 0x2DD0(0x18)(None)
	double                                       Solver___Solver_Clamp_2_1_Result;                  // 0x2DE8(0x8)(None)
	double                                       Solver___Solver_Subtract_6_Result;                 // 0x2DF0(0x8)(None)
	double                                       Solver___Solver_Power_Result;                      // 0x2DF8(0x8)(None)
	double                                       Solver___Solver_Multiply_Result;                   // 0x2E00(0x8)(None)
	float                                        Solver___Solver_GetDeltaTime_4_1_Result;           // 0x2E08(0x4)(None)
	uint8                                        Pad_DBB[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Solver___Solver_Multiply_A;                        // 0x2E10(0x8)(None)
	float                                        Solver___Solver_Interpolate_1_1_T;                 // 0x2E18(0x4)(None)
	uint8                                        Pad_DBC[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               Solver___Solver_Add_9_Add_9_1_Result;              // 0x2E20(0x18)(None)
	struct FVector                               Solver___Solver_Add_9_Add_9_Result;                // 0x2E38(0x18)(None)
	struct FVector                               Solver___Solver_Scale_3_Result;                    // 0x2E50(0x18)(None)
	struct FVector                               Solver___Solver_Add_1_Result;                      // 0x2E68(0x18)(None)
	struct FVector                               Solver___Solver_DISPATCH_RigDispatch_GetMetadata_Value; // 0x2E80(0x18)(None)
	TArray<struct FCachedRigElement>             Solver___Solver_DISPATCH_RigDispatch_GetMetadata_Cache; // 0x2E98(0x10)(AdvancedDisplay, Protected, BlueprintCallable, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         Solver___Solver_DISPATCH_RigDispatch_GetMetadata_Found; // 0x2EA8(0x1)(None)
	uint8                                        Pad_DBE[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               Solver___Solver_Scale_Result;                      // 0x2EB0(0x18)(None)
	struct FVector                               Solver___Solver_Subtract_Result;                   // 0x2EC8(0x18)(None)
	double                                       Solver___Solver_Multiply_7_Result;                 // 0x2EE0(0x8)(None)
	float                                        Solver___Solver_Scale_Factor;                      // 0x2EE8(0x4)(None)
	uint8                                        Pad_DC0[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Solver___Solver_Multiply_6_Result;                 // 0x2EF0(0x8)(None)
	float                                        Solver___Solver_GetDeltaTime_3_Result;             // 0x2EF8(0x4)(None)
	uint8                                        Pad_DC2[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Solver___Solver_Multiply_6_A;                      // 0x2F00(0x8)(None)
	double                                       Solver___Solver_Power_1_Result;                    // 0x2F08(0x8)(None)
	double                                       Solver___Solver_Remap_1_Result;                    // 0x2F10(0x8)(None)
	double                                       Solver___Solver_Divide_2_Result;                   // 0x2F18(0x8)(None)
	double                                       Solver___Solver_Divide_2_A;                        // 0x2F20(0x8)(None)
	float                                        Solver___Solver_Scale_3_Factor;                    // 0x2F28(0x4)(None)
	uint8                                        Pad_DC5[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Solver___Solver_Divide_3_Result;                   // 0x2F30(0x8)(None)
	float                                        Solver___Solver_GetDeltaTime_2_Result;             // 0x2F38(0x4)(None)
	uint8                                        Pad_DC6[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Solver___Solver_Divide_3_B;                        // 0x2F40(0x8)(None)
	float                                        Solver___Solver_Scale_4_Factor;                    // 0x2F48(0x4)(None)
	uint8                                        Pad_DC7[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Solver___Solver_Greater_3_A;                       // 0x2F50(0x8)(None)
	struct FVector                               Solver___Solver_Add_1_1_Result;                    // 0x2F58(0x18)(None)
	struct FVector                               Solver___Solver_Scale_1_1_Result;                  // 0x2F70(0x18)(None)
	struct FVector                               Solver___Solver_Scale_2_1_Result;                  // 0x2F88(0x18)(None)
	struct FVector                               Solver___Solver_Unit_1_Result;                     // 0x2FA0(0x18)(None)
	double                                       Solver___Solver_Greater_B;                         // 0x2FB8(0x8)(None)
	float                                        Solver___Solver_Interpolate_1_Result;              // 0x2FC0(0x4)(None)
	float                                        Solver___Solver_Interpolate_1_A;                   // 0x2FC4(0x4)(None)
	float                                        Solver___Solver_Interpolate_1_B;                   // 0x2FC8(0x4)(None)
	uint8                                        Pad_DC8[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Solver___Solver_Clamp_2_Result;                    // 0x2FD0(0x8)(None)
	double                                       Solver___Solver_Multiply_8_Result;                 // 0x2FD8(0x8)(None)
	float                                        Solver___Solver_GetDeltaTime_4_Result;             // 0x2FE0(0x4)(None)
	uint8                                        Pad_DC9[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Solver___Solver_Multiply_8_A;                      // 0x2FE8(0x8)(None)
	float                                        Solver___Solver_Interpolate_1_T;                   // 0x2FF0(0x4)(None)
	uint8                                        Pad_DCA[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               Solver___Solver_If_4_True__IO;                     // 0x2FF8(0x18)(None)
	struct FVector                               Solver___Solver_FromWorldCustom_Result;            // 0x3010(0x18)(None)
	struct FVector                               FromWorldCustom___FromWorldCustom_From_World_Global; // 0x3028(0x18)(None)
	struct FVector                               LocalVariable__Solver_PostZConstraint;             // 0x3040(0x18)(None)
	TArray<struct FCachedRigElement>             Solver___Solver_DISPATCH_RigDispatch_SetMetadata_Cache; // 0x3058(0x10)(AutoWeak, AssetRegistrySearchable, SimpleDisplay, Protected, BlueprintCallable, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FVector                               Solver___Solver_Scale_1_Result;                    // 0x3068(0x18)(None)
	struct FVector                               Solver___Solver_Subtract_1_Result;                 // 0x3080(0x18)(None)
	bool                                         Solver___Solver_MathBoolOr_Result;                 // 0x3098(0x1)(None)
	bool                                         Solver___Solver_MathBoolNot_Result;                // 0x3099(0x1)(None)
	bool                                         Solver___Solver_DISPATCH_RigDispatch_CoreEquals_Result; // 0x309A(0x1)(None)
	uint8                                        Pad_DCD[0x5];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               Solver___Solver_ToWorldCustom_Result;              // 0x30A0(0x18)(None)
	struct FVector                               Solver___Solver_If_2_Result;                       // 0x30B8(0x18)(None)
	struct FVector                               Solver___Solver_If_3_Result;                       // 0x30D0(0x18)(None)
	bool                                         Solver___Solver_GreaterEqual_Result;               // 0x30E8(0x1)(None)
	uint8                                        Pad_DCE[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Solver___Solver_MathVectorDistance_Result;         // 0x30EC(0x4)(None)
	struct FTransform                            Solver___Solver_Make_Absolute_1_2_Global;          // 0x30F0(0x60)(None)
	struct FTransform                            Solver___Solver_DISPATCH_RigDispatch_GetMetadata_2_Value; // 0x3150(0x60)(None)
	TArray<struct FCachedRigElement>             Solver___Solver_DISPATCH_RigDispatch_GetMetadata_2_Cache; // 0x31B0(0x10)(AutoWeak, ContainsInstancedReference, SimpleDisplay, Protected, BlueprintCallable, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FTransform                            Solver___Solver_DISPATCH_RigDispatch_GetMetadata_2_Default__IO; // 0x31C0(0x60)(None)
	bool                                         Solver___Solver_DISPATCH_RigDispatch_GetMetadata_2_Found; // 0x3220(0x1)(None)
	uint8                                        Pad_DCF[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               Solver___Solver_MathVectorDistance_B;              // 0x3228(0x18)(None)
	double                                       Solver___Solver_GreaterEqual_A;                    // 0x3240(0x8)(None)
	double                                       Solver___Solver_Multiply_1_Result;                 // 0x3248(0x8)(None)
	double                                       Solver___Solver_Clamp_1_Result;                    // 0x3250(0x8)(None)
	double                                       Solver___Solver_Multiply_5_Result;                 // 0x3258(0x8)(None)
	double                                       Solver___Solver_Subtract_4_Result;                 // 0x3260(0x8)(None)
	struct FVector                               Solver___Solver_Interpolate_Result;                // 0x3268(0x18)(None)
	struct FVector                               Solver___Solver_Add_Result;                        // 0x3280(0x18)(None)
	struct FVector                               Solver___Solver_Scale_2_Result;                    // 0x3298(0x18)(None)
	struct FVector                               Solver___Solver_Unit_Result;                       // 0x32B0(0x18)(None)
	struct FVector                               Solver___Solver_Subtract_2_Result;                 // 0x32C8(0x18)(None)
	float                                        Solver___Solver_Scale_2_Factor;                    // 0x32E0(0x4)(None)
	uint8                                        Pad_DD0[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               ToWorldCustom___ToWorldCustom_To_World_1_1_World;  // 0x32E8(0x18)(None)
	double                                       Solver___Solver_Divide_1_Result;                   // 0x3300(0x8)(None)
	float                                        Solver___Solver_GetDeltaTime_Result;               // 0x3308(0x4)(None)
	uint8                                        Pad_DD2[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Solver___Solver_Divide_1_B;                        // 0x3310(0x8)(None)
	float                                        Solver___Solver_Scale_1_Factor;                    // 0x3318(0x4)(None)
	bool                                         Solver___Solver_DISPATCH_RigDispatch_SetMetadata_Success; // 0x331C(0x1)(None)
	uint8                                        Pad_DD3[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               LocalVariable__GroundConform_Solver_Position;      // 0x3320(0x18)(None)
	struct FVector                               GroundConform___GroundConform_If_5_2_Result;       // 0x3338(0x18)(None)
	struct FVector                               GroundConform___GroundConform_FromWorldCustom_Result; // 0x3350(0x18)(None)
	struct FVector                               FromWorldCustom___FromWorldCustom_From_World_Global; // 0x3368(0x18)(None)
	struct FVector                               GroundConform___GroundConform_If_15_Result;        // 0x3380(0x18)(None)
	bool                                         GroundConform___GroundConform_MathBoolAnd_1_Result; // 0x3398(0x1)(None)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_CoreEquals_Result; // 0x3399(0x1)(None)
	uint8                                        Pad_DD6[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               GroundConform___GroundConform_ToWorldCustom_2_Result; // 0x33A0(0x18)(None)
	struct FVector                               GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_8_Value; // 0x33B8(0x18)(None)
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_8_Cache; // 0x33D0(0x10)(SimpleDisplay, Protected, BlueprintCallable, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_8_Found; // 0x33E0(0x1)(None)
	uint8                                        Pad_DD7[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               ToWorldCustom_2___ToWorldCustom_To_World_1_1_World; // 0x33E8(0x18)(None)
	struct FVector                               GroundConform___GroundConform_ToWorldCustom_3_Result; // 0x3400(0x18)(None)
	struct FVector                               GroundConform___GroundConform_If_10_Result;        // 0x3418(0x18)(None)
	bool                                         GroundConform___GroundConform_ArrayGetAtIndex_9_1_Element; // 0x3430(0x1)(None)
	uint8                                        Pad_DD8[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               GroundConform___GroundConform_DistanceToParentConstraint_1_Result; // 0x3438(0x18)(None)
	struct FVector                               GroundConform___GroundConform_DistanceToParentConstraint_1_ParentPosition; // 0x3450(0x18)(None)
	double                                       GroundConform___GroundConform_DistanceToParentConstraint_1_ParentDistanceIn; // 0x3468(0x8)(None)
	struct FVector                               DistanceToParentConstraint_1___DistanceToParentConstraint_Scale_1_Result; // 0x3470(0x18)(None)
	struct FVector                               DistanceToParentConstraint_1___DistanceToParentConstraint_Unit_1_Result; // 0x3488(0x18)(None)
	struct FVector                               DistanceToParentConstraint_1___DistanceToParentConstraint_Subtract_1_Result; // 0x34A0(0x18)(None)
	float                                        DistanceToParentConstraint_1___DistanceToParentConstraint_Scale_1_Factor; // 0x34B8(0x4)(None)
	uint8                                        Pad_DD9[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               GroundConform___GroundConform_ParentChainLengthConstraint_Result; // 0x34C0(0x18)(None)
	double                                       GroundConform___GroundConform_ParentChainLengthConstraint_ParentChainLengthIn; // 0x34D8(0x8)(None)
	bool                                         ParentChainLengthConstraint___ParentChainLengthConstraint_DISPATCH_RigDispatch_CoreEquals_Result; // 0x34E0(0x1)(None)
	uint8                                        Pad_DDB[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               ParentChainLengthConstraint___ParentChainLengthConstraint_Add_1_Result; // 0x34E8(0x18)(None)
	struct FVector                               ParentChainLengthConstraint___ParentChainLengthConstraint_Scale_1_Result; // 0x3500(0x18)(None)
	struct FVector                               ParentChainLengthConstraint___ParentChainLengthConstraint_Unit_1_Result; // 0x3518(0x18)(None)
	struct FVector                               ParentChainLengthConstraint___ParentChainLengthConstraint_Subtract_1_Result; // 0x3530(0x18)(None)
	float                                        ParentChainLengthConstraint___ParentChainLengthConstraint_Scale_1_Factor; // 0x3548(0x4)(None)
	uint8                                        Pad_DDC[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               ParentChainLengthConstraint___ParentChainLengthConstraint_If_Result; // 0x3550(0x18)(None)
	bool                                         ParentChainLengthConstraint___ParentChainLengthConstraint_GreaterEqual_Result; // 0x3568(0x1)(None)
	uint8                                        Pad_DDD[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ParentChainLengthConstraint___ParentChainLengthConstraint_MathVectorLength_Result; // 0x356C(0x4)(None)
	double                                       ParentChainLengthConstraint___ParentChainLengthConstraint_GreaterEqual_A; // 0x3570(0x8)(None)
	struct FVector                               ParentChainLengthConstraint___ParentChainLengthConstraint_If_1_Result; // 0x3578(0x18)(None)
	struct FVector                               ToWorldCustom_3___ToWorldCustom_To_World_1_1_World; // 0x3590(0x18)(None)
	uint8                                        Pad_DDF[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQuat                                 GroundConform___GroundConform_If_5_1_1_Result;     // 0x35B0(0x20)(None)
	struct FQuat                                 GroundConform___GroundConform_SpringInterpQuaternionV2_Result; // 0x35D0(0x20)(None)
	struct FQuat                                 GroundConform___GroundConform_If_24_Result;        // 0x35F0(0x20)(None)
	bool                                         GroundConform___GroundConform_MathBoolAnd_5_Result; // 0x3610(0x1)(None)
	bool                                         GroundConform___GroundConform_ArrayGetAtIndex_9_4_Element; // 0x3611(0x1)(None)
	uint8                                        Pad_DE0[0xE];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQuat                                 GroundConform___GroundConform_ReorientBone_0_Result; // 0x3620(0x20)(None)
	struct FVector                               GroundConform___GroundConform_ReorientBone_0_ParentPosition; // 0x3640(0x18)(None)
	uint8                                        Pad_DE1[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQuat                                 ReorientBone_0___ReorientBone_If_16_Result;        // 0x3660(0x20)(None)
	bool                                         ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_CoreNotEquals_Result; // 0x3680(0x1)(None)
	uint8                                        Pad_DE2[0xF];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQuat                                 ReorientBone_0___ReorientBone_Multiply_Multiply_1_Result; // 0x3690(0x20)(None)
	struct FQuat                                 ReorientBone_0___ReorientBone_Multiply_Multiply_Result; // 0x36B0(0x20)(None)
	struct FQuat                                 ReorientBone_0___ReorientBone_Unit_3_Result;       // 0x36D0(0x20)(None)
	struct FQuat                                 ReorientBone_0___ReorientBone_MathQuaternionFromAxisAndAngle_Result; // 0x36F0(0x20)(None)
	struct FVector                               ReorientBone_0___ReorientBone_Unit_2_Result;       // 0x3710(0x18)(None)
	struct FVector                               ReorientBone_0___ReorientBone_MathVectorCross_Result; // 0x3728(0x18)(None)
	struct FVector                               ReorientBone_0___ReorientBone_Unit_1_Result;       // 0x3740(0x18)(None)
	struct FVector                               ReorientBone_0___ReorientBone_Subtract_1_Result;   // 0x3758(0x18)(None)
	struct FVector                               ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_Value; // 0x3770(0x18)(None)
	TArray<struct FCachedRigElement>             ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_Cache; // 0x3788(0x10)(ContainsInstancedReference, AssetRegistrySearchable, Protected, BlueprintCallable, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_Found; // 0x3798(0x1)(None)
	uint8                                        Pad_DE4[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_1_Value; // 0x37A0(0x18)(None)
	struct FRigElementKey                        ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_Value; // 0x37B8(0xC)(None)
	uint8                                        Pad_DE5[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_Cache; // 0x37C8(0x10)(AutoWeak, ContainsInstancedReference, Protected, BlueprintCallable, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_Found; // 0x37D8(0x1)(None)
	uint8                                        Pad_DE6[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_1_Cache; // 0x37E0(0x10)(AutoWeak, Protected, BlueprintCallable, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_2_1_Found; // 0x37F0(0x1)(None)
	uint8                                        Pad_DE7[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               ReorientBone_0___ReorientBone_Unit_Result;         // 0x37F8(0x18)(None)
	struct FVector                               ReorientBone_0___ReorientBone_Subtract_Result;     // 0x3810(0x18)(None)
	double                                       ReorientBone_0___ReorientBone_Acos_Result;         // 0x3828(0x8)(None)
	float                                        ReorientBone_0___ReorientBone_Dot___Result;        // 0x3830(0x4)(None)
	uint8                                        Pad_DE8[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       ReorientBone_0___ReorientBone_Acos_Value;          // 0x3838(0x8)(None)
	float                                        ReorientBone_0___ReorientBone_MathQuaternionFromAxisAndAngle_Angle; // 0x3840(0x4)(None)
	uint8                                        Pad_DE9[0xC];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQuat                                 ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_1_Value; // 0x3850(0x20)(None)
	TArray<struct FCachedRigElement>             ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_1_Cache; // 0x3870(0x10)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, BlueprintCallable, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         ReorientBone_0___ReorientBone_DISPATCH_RigDispatch_GetMetadata_1_Found; // 0x3880(0x1)(None)
	uint8                                        Pad_DEB[0xF];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQuat                                 ReorientBone_0___ReorientBone_If_16_False;         // 0x3890(0x20)(None)
	struct FQuat                                 GroundConform___GroundConform_ArrayGetAtIndex_4_Element; // 0x38B0(0x20)(None)
	struct FVector                               GroundConform___GroundConform_SpringInterpQuaternionV2_AngularVelocity; // 0x38D0(0x18)(None)
	TArray<struct FQuat>                         GroundConform___GroundConform_SpringInterpQuaternionV2_SimulatedResult; // 0x38E8(0x10)(AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, BlueprintCallable, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FQuaternionSpringState>        GroundConform___GroundConform_SpringInterpQuaternionV2_SpringState; // 0x38F8(0x10)(AutoWeak, SimpleDisplay, AdvancedDisplay, BlueprintCallable, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FVector                               GroundConform___GroundConform_FromWorldCustom_1_Result; // 0x3908(0x18)(None)
	struct FVector                               GroundConform___GroundConform_ArrayGetAtIndex_1_Element; // 0x3920(0x18)(None)
	struct FVector                               FromWorldCustom_1___FromWorldCustom_From_World_Global; // 0x3938(0x18)(None)
	struct FPBIKEffector                         GroundConform___GroundConform_ArraySetAtIndex_Element__IO; // 0x3950(0x90)(None)
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_1_Cache; // 0x39E0(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, BlueprintCallable, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FVector                               GroundConform___GroundConform_Subtract_6_Result;   // 0x39F0(0x18)(None)
	struct FVector                               GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_6_Value; // 0x3A08(0x18)(None)
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_6_Cache; // 0x3A20(0x10)(AssetRegistrySearchable, AdvancedDisplay, BlueprintCallable, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_6_Found; // 0x3A30(0x1)(None)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_1_Success; // 0x3A31(0x1)(None)
	uint8                                        Pad_DEE[0xE];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            GroundConform___GroundConform_Set_Transform_1_Value__IO; // 0x3A40(0x60)(None)
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_Set_Transform_1_CachedIndex; // 0x3AA0(0x10)(ContainsInstancedReference, AdvancedDisplay, BlueprintCallable, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConform___GroundConform_DISPATCH_RigVMDispatch_CoreEquals_Result; // 0x3AB0(0x1)(None)
	uint8                                        Pad_DF0[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               GroundConform___GroundConform_ArrayGetAtIndex_1_2_Element; // 0x3AB8(0x18)(None)
	class FName                                  GroundConform___GroundConform_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x3AD0(0x8)(None)
	bool                                         GroundConform___GroundConform_MathBoolOr_4_Result; // 0x3AD8(0x1)(None)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_CoreEquals_2_Result; // 0x3AD9(0x1)(None)
	uint8                                        Pad_DF1[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQuat                                 GroundConform___GroundConform_RigVMFunction_MathQuaternionFromTwoVectors_Result; // 0x3AE0(0x20)(None)
	struct FVector                               GroundConform___GroundConform_Rotate_Vector_Result; // 0x3B00(0x18)(None)
	uint8                                        Pad_DF2[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQuat                                 GroundConform___GroundConform_From_World_4_Global; // 0x3B20(0x20)(None)
	struct FVector                               GroundConform___GroundConform_Add_10_Result;       // 0x3B40(0x18)(None)
	struct FVector                               GroundConform___GroundConform_Add_10_A__IO;        // 0x3B58(0x18)(None)
	struct FVector                               GroundConform___GroundConform_From_World_3_2_Global; // 0x3B70(0x18)(None)
	struct FVector                               GroundConform___GroundConform_From_World_3_2_Value__IO; // 0x3B88(0x18)(None)
	struct FTransform                            GroundConform___GroundConform_DebugRectangleItemSpace_1_Transform__IO; // 0x3BA0(0x60)(None)
	double                                       GroundConform___GroundConform_Multiply_8_Result;   // 0x3C00(0x8)(None)
	float                                        GroundConform___GroundConform_DebugRectangleItemSpace_1_Scale; // 0x3C08(0x4)(None)
	uint8                                        Pad_DF3[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       GroundConform___GroundConform_Multiply_6_Result;   // 0x3C10(0x8)(None)
	double                                       GroundConform___GroundConform_Multiply_6_A;        // 0x3C18(0x8)(None)
	float                                        GroundConform___GroundConform_DebugRectangleItemSpace_1_Thickness; // 0x3C20(0x4)(None)
	uint8                                        Pad_DF4[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               GroundConform___GroundConform_From_World_5_Global; // 0x3C28(0x18)(None)
	struct FVector                               GroundConform___GroundConform_From_World_5_Value__IO; // 0x3C40(0x18)(None)
	uint8                                        Pad_DF5[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            GroundConform___GroundConform_DebugRectangleItemSpace_1_1_Transform__IO; // 0x3C60(0x60)(None)
	double                                       GroundConform___GroundConform_Multiply_8_1_Result; // 0x3CC0(0x8)(None)
	float                                        GroundConform___GroundConform_DebugRectangleItemSpace_1_1_Scale; // 0x3CC8(0x4)(None)
	float                                        GroundConform___GroundConform_DebugRectangleItemSpace_1_1_Thickness; // 0x3CCC(0x4)(None)
	class FName                                  GroundConform___GroundConform_Branch_BlockToRun;   // 0x3CD0(0x8)(None)
	struct FVector                               GroundConform___GroundConform_ArrayGetAtIndex_8_2_1_Element; // 0x3CD8(0x18)(None)
	struct FVector                               GroundConform___GroundConform_ArrayGetAtIndex_8_2_Element; // 0x3CF0(0x18)(None)
	float                                        GroundConform___GroundConform_DebugLineItemSpace_1_2_Thickness; // 0x3D08(0x4)(None)
	uint8                                        Pad_DF6[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               GroundConform___GroundConform_DebugLineItemSpace_1_1_A; // 0x3D10(0x18)(None)
	float                                        GroundConform___GroundConform_DebugLineItemSpace_1_1_Thickness; // 0x3D28(0x4)(None)
	class FName                                  GroundConform___GroundConform_Branch_1_BlockToRun; // 0x3D2C(0x8)(None)
	class FName                                  GroundConform___GroundConform_Branch_9_BlockToRun; // 0x3D34(0x8)(None)
	float                                        GroundConform___GroundConform_MathVectorLength_1_Result; // 0x3D3C(0x4)(None)
	struct FVector                               GroundConform___GroundConform_Subtract_3_Result;   // 0x3D40(0x18)(None)
	struct FVector                               GroundConform___GroundConform_ArrayGetAtIndex_13_Element; // 0x3D58(0x18)(None)
	struct FVector                               GroundConform___GroundConform_ArrayGetAtIndex_12_Element; // 0x3D70(0x18)(None)
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_5_Cache; // 0x3D88(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, BlueprintCallable, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_5_Success; // 0x3D98(0x1)(None)
	bool                                         GroundConform___GroundConform_Greater_Result;      // 0x3D99(0x1)(None)
	uint8                                        Pad_DF7[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       GroundConform___GroundConform_Greater_A;           // 0x3DA0(0x8)(None)
	class FName                                  GroundConform___GroundConform_Branch_4_BlockToRun; // 0x3DA8(0x8)(None)
	class FName                                  GroundConform___GroundConform_Branch_5_BlockToRun; // 0x3DB0(0x8)(None)
	float                                        GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_14_Value; // 0x3DB8(0x4)(None)
	uint8                                        Pad_DF8[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_14_Cache; // 0x3DC0(0x10)(AutoWeak, AssetRegistrySearchable, SimpleDisplay, BlueprintCallable, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_14_Found; // 0x3DD0(0x1)(None)
	bool                                         GroundConform___GroundConform_LessEqual_Result;    // 0x3DD1(0x1)(None)
	uint8                                        Pad_DF9[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       GroundConform___GroundConform_LessEqual_A;         // 0x3DD8(0x8)(None)
	bool                                         GroundConform___GroundConform_MathBoolOr_3_Result; // 0x3DE0(0x1)(None)
	bool                                         GroundConform___GroundConform_MathBoolNot_4_Result; // 0x3DE1(0x1)(None)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_1_Value; // 0x3DE2(0x1)(None)
	uint8                                        Pad_DFA[0x5];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_1_Cache; // 0x3DE8(0x10)(ContainsInstancedReference, SimpleDisplay, BlueprintCallable, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_13_1_Found; // 0x3DF8(0x1)(None)
	uint8                                        Pad_DFB[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               GroundConform___GroundConform_From_World_2_Global; // 0x3E00(0x18)(None)
	struct FVector                               GroundConform___GroundConform_From_World_2_Value__IO; // 0x3E18(0x18)(None)
	bool                                         GroundConform___GroundConform_MathBoolAnd_4_Result; // 0x3E30(0x1)(None)
	bool                                         GroundConform___GroundConform_LessEqual_1_Result;  // 0x3E31(0x1)(None)
	uint8                                        Pad_DFC[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        GroundConform___GroundConform_MathVectorDistance_Result; // 0x3E34(0x4)(None)
	struct FVector                               GroundConform___GroundConform_FromWorldCustom_2_Result; // 0x3E38(0x18)(None)
	struct FVector                               GroundConform___GroundConform_ArrayGetAtIndex_1_1_1_Element; // 0x3E50(0x18)(None)
	struct FVector                               FromWorldCustom_2___FromWorldCustom_From_World_Global; // 0x3E68(0x18)(None)
	double                                       GroundConform___GroundConform_LessEqual_1_A;       // 0x3E80(0x8)(None)
	float                                        GroundConform___GroundConform_ArrayGetAtIndex_2_1_1_Element; // 0x3E88(0x4)(None)
	uint8                                        Pad_DFD[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       GroundConform___GroundConform_LessEqual_1_B;       // 0x3E90(0x8)(None)
	bool                                         GroundConform___GroundConform_MathBoolOr_2_Result; // 0x3E98(0x1)(None)
	bool                                         GroundConform___GroundConform_MathBoolNot_Result;  // 0x3E99(0x1)(None)
	bool                                         GroundConform___GroundConform_Greater_2_Result;    // 0x3E9A(0x1)(None)
	uint8                                        Pad_DFE[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_16_Value; // 0x3E9C(0x4)(None)
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_16_Cache; // 0x3EA0(0x10)(SimpleDisplay, BlueprintCallable, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_GetMetadata_16_Found; // 0x3EB0(0x1)(None)
	uint8                                        Pad_DFF[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       GroundConform___GroundConform_Greater_2_A;         // 0x3EB8(0x8)(None)
	class FName                                  GroundConform___GroundConform_If_5_Result;         // 0x3EC0(0x8)(None)
	class FName                                  GroundConform___GroundConform_PrimalHitResultNotifyActor_CustomTag; // 0x3EC8(0x8)(None)
	struct FVector                               GroundConform___GroundConform_Scale_Result;        // 0x3ED0(0x18)(None)
	double                                       GroundConform___GroundConform_Divide_1_Result;     // 0x3EE8(0x8)(None)
	float                                        GroundConform___GroundConform_GetDeltaTime_1_Result; // 0x3EF0(0x4)(None)
	uint8                                        Pad_E00[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       GroundConform___GroundConform_Divide_1_B;          // 0x3EF8(0x8)(None)
	float                                        GroundConform___GroundConform_Scale_Factor;        // 0x3F00(0x4)(None)
	uint8                                        Pad_E01[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FTransform>                    GroundConform___GroundConform_DrawTransforms_Transforms__IO; // 0x3F08(0x10)(AutoWeak, AssetRegistrySearchable, BlueprintCallable, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	double                                       GroundConform___GroundConform_Multiply_12_Result;  // 0x3F18(0x8)(None)
	double                                       GroundConform___GroundConform_Multiply_12_A;       // 0x3F20(0x8)(None)
	float                                        GroundConform___GroundConform_DrawTransforms_Thickness; // 0x3F28(0x4)(None)
	uint8                                        Pad_E02[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       GroundConform___GroundConform_Multiply_4_Result;   // 0x3F30(0x8)(None)
	float                                        GroundConform___GroundConform_DrawTransforms_Scale; // 0x3F38(0x4)(None)
	float                                        GroundConform___GroundConform_If_6_Result;         // 0x3F3C(0x4)(None)
	struct FLinearColor                          GroundConform___GroundConform_DrawTransforms_Color__IO; // 0x3F40(0x10)(None)
	struct FTransform                            DrawTransforms___DrawTransforms_ArrayIterator_1_Element; // 0x3F50(0x60)(None)
	int32                                        DrawTransforms___DrawTransforms_ArrayIterator_1_Index; // 0x3FB0(0x4)(None)
	int32                                        DrawTransforms___DrawTransforms_ArrayIterator_1_Count; // 0x3FB4(0x4)(None)
	float                                        DrawTransforms___DrawTransforms_ArrayIterator_1_Ratio; // 0x3FB8(0x4)(None)
	class FName                                  DrawTransforms___DrawTransforms_ArrayIterator_1_BlockToRun; // 0x3FBC(0x8)(None)
	class FName                                  DrawTransforms___DrawTransforms_Branch_BlockToRun; // 0x3FC4(0x8)(None)
	uint8                                        Pad_E03[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_4_Cache; // 0x3FD0(0x10)(AutoWeak, ContainsInstancedReference, BlueprintCallable, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_4_Success; // 0x3FE0(0x1)(None)
	uint8                                        Pad_E04[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_2_Cache; // 0x3FE8(0x10)(AutoWeak, AssetRegistrySearchable, Protected, BlueprintCallable, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_2_Success; // 0x3FF8(0x1)(None)
	uint8                                        Pad_E05[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  GroundConform___GroundConform_Branch_2_BlockToRun; // 0x3FFC(0x8)(None)
	class FName                                  GroundConform___GroundConform_Branch_7_BlockToRun; // 0x4004(0x8)(None)
	uint8                                        Pad_E06[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_4_1_Cache; // 0x4010(0x10)(AutoWeak, ContainsInstancedReference, Protected, BlueprintCallable, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	double                                       GroundConform___GroundConform_Subtract_7_Result;   // 0x4020(0x8)(None)
	double                                       GroundConform___GroundConform_Subtract_7_A;        // 0x4028(0x8)(None)
	double                                       GroundConform___GroundConform_Multiply_11_Result;  // 0x4030(0x8)(None)
	float                                        GroundConform___GroundConform_GetDeltaTime_Result; // 0x4038(0x4)(None)
	uint8                                        Pad_E07[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       GroundConform___GroundConform_Multiply_11_A;       // 0x4040(0x8)(None)
	float                                        GroundConform___GroundConform_Cast_Result;         // 0x4048(0x4)(None)
	uint8                                        Pad_E08[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       GroundConform___GroundConform_Multiply_11_B;       // 0x4050(0x8)(None)
	float                                        GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_4_1_Value; // 0x4058(0x4)(None)
	bool                                         GroundConform___GroundConform_DISPATCH_RigDispatch_SetMetadata_4_1_Success; // 0x405C(0x1)(None)
	uint8                                        Pad_E09[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  GroundConform___GroundConform_Branch_3_BlockToRun; // 0x4060(0x8)(None)
	class FName                                  GroundConform___GroundConform_Branch_8_BlockToRun; // 0x4068(0x8)(None)
	int32                                        GroundConform___GroundConform_ArrayIterator_1_Count; // 0x4070(0x4)(None)
	float                                        GroundConform___GroundConform_ArrayIterator_1_Ratio; // 0x4074(0x4)(None)
	class FName                                  GroundConform___GroundConform_ArrayIterator_1_BlockToRun; // 0x4078(0x8)(None)
	struct FTransform                            GroundConform___GroundConform_GetTransform_1_1_Transform; // 0x4080(0x60)(None)
	struct FRigElementKey                        GroundConform___GroundConform_DISPATCH_RigVMDispatch_ArrayIterator_Element; // 0x40E0(0xC)(None)
	uint8                                        Pad_E0A[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             GroundConform___GroundConform_GetTransform_1_1_CachedIndex; // 0x40F0(0x10)(Protected, BlueprintCallable, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	double                                       GroundConform___GroundConform_Multiply_3_1_Result; // 0x4100(0x8)(None)
	float                                        GroundConform___GroundConform_DISPATCH_RigVMDispatch_ArrayGetAtIndex_Element; // 0x4108(0x4)(None)
	int32                                        GroundConform___GroundConform_DISPATCH_RigVMDispatch_ArrayIterator_Index; // 0x410C(0x4)(None)
	double                                       GroundConform___GroundConform_Multiply_3_1_A;      // 0x4110(0x8)(None)
	double                                       GroundConform___GroundConform_Divide_3_Result;     // 0x4118(0x8)(None)
	double                                       GroundConform___GroundConform_Divide_3_B;          // 0x4120(0x8)(None)
	float                                        GroundConform___GroundConform_RigVMFunction_DebugArcNoSpace_Radius; // 0x4128(0x4)(None)
	uint8                                        Pad_E0B[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            GroundConform___GroundConform_Multiply_2_1_Result; // 0x4130(0x60)(None)
	struct FQuat                                 GroundConform___GroundConform_RigVMFunction_MathQuaternionFromEuler_Result; // 0x4190(0x20)(None)
	struct FTransform                            GroundConform___GroundConform_Multiply_2_1_A__IO;  // 0x41B0(0x60)(None)
	float                                        GroundConform___GroundConform_RigVMFunction_DebugArcNoSpace_1_Radius; // 0x4210(0x4)(None)
	int32                                        GroundConform___GroundConform_DISPATCH_RigVMDispatch_ArrayIterator_Count; // 0x4214(0x4)(None)
	float                                        GroundConform___GroundConform_DISPATCH_RigVMDispatch_ArrayIterator_Ratio; // 0x4218(0x4)(None)
	class FName                                  GroundConform___GroundConform_DISPATCH_RigVMDispatch_ArrayIterator_BlockToRun; // 0x421C(0x8)(None)
	class FName                                  GroundConform___GroundConform_RigVMFunction_ControlFlowBranch_1_1_BlockToRun; // 0x4224(0x8)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_MathBoolAnd_Result; // 0x422C(0x1)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_Greater_Result; // 0x422D(0x1)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_5_Value; // 0x422E(0x1)(None)
	uint8                                        Pad_E0E[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_5_Cache; // 0x4230(0x10)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, BlueprintCallable, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_5_Found; // 0x4240(0x1)(None)
	uint8                                        Pad_E0F[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_8_Cache; // 0x4248(0x10)(AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, BlueprintCallable, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FVector                               GroundConformForwardsSolve___GroundConformForwardsSolve_SphereTraceByTraceChannel_1_HitNormal; // 0x4258(0x18)(None)
	struct FVector                               GroundConformForwardsSolve___GroundConformForwardsSolve_Add_5_Result; // 0x4270(0x18)(None)
	uint8                                        Pad_E10[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_GetTransform_2_1_Transform; // 0x4290(0x60)(None)
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_GetTransform_2_1_CachedIndex; // 0x42F0(0x10)(AutoWeak, SimpleDisplay, AdvancedDisplay, BlueprintCallable, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FVector                               GroundConformForwardsSolve___GroundConformForwardsSolve_Add_5_A; // 0x4300(0x18)(None)
	struct FVector                               GroundConformForwardsSolve___GroundConformForwardsSolve_Add_2_1_Result; // 0x4318(0x18)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_SphereTraceByTraceChannel_1_bHit; // 0x4330(0x1)(None)
	uint8                                        Pad_E11[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               GroundConformForwardsSolve___GroundConformForwardsSolve_SphereTraceByTraceChannel_1_HitLocation; // 0x4338(0x18)(None)
	struct FHitResult                            GroundConformForwardsSolve___GroundConformForwardsSolve_SphereTraceByTraceChannel_1_WorldSpaceHitResult; // 0x4350(0xF0)(ZeroConstructor)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_8_Success; // 0x4440(0x1)(None)
	uint8                                        Pad_E12[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_ControlFlowBranch_5_BlockToRun; // 0x4444(0x8)(None)
	uint8                                        Pad_E13[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               GroundConformForwardsSolve___GroundConformForwardsSolve_SphereTraceByTraceChannel_HitLocation; // 0x4450(0x18)(None)
	struct FVector                               GroundConformForwardsSolve___GroundConformForwardsSolve_Add_Result; // 0x4468(0x18)(None)
	struct FTransform                            GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_GetTransform_2_Transform; // 0x4480(0x60)(None)
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_GetTransform_2_CachedIndex; // 0x44E0(0x10)(ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, BlueprintCallable, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FVector                               GroundConformForwardsSolve___GroundConformForwardsSolve_Add_A; // 0x44F0(0x18)(None)
	struct FVector                               GroundConformForwardsSolve___GroundConformForwardsSolve_Add_2_Result; // 0x4508(0x18)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_SphereTraceByTraceChannel_bHit; // 0x4520(0x1)(None)
	uint8                                        Pad_E14[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               GroundConformForwardsSolve___GroundConformForwardsSolve_SphereTraceByTraceChannel_HitNormal; // 0x4528(0x18)(None)
	struct FHitResult                            GroundConformForwardsSolve___GroundConformForwardsSolve_SphereTraceByTraceChannel_WorldSpaceHitResult; // 0x4540(0xF0)(None)
	struct FVector                               GroundConformForwardsSolve___GroundConformForwardsSolve_Add_4_Result; // 0x4630(0x18)(None)
	struct FVector                               GroundConformForwardsSolve___GroundConformForwardsSolve_Scale_Result; // 0x4648(0x18)(None)
	struct FQuat                                 GroundConformForwardsSolve___GroundConformForwardsSolve_Multiply_4_Result; // 0x4660(0x20)(None)
	struct FQuat                                 GroundConformForwardsSolve___GroundConformForwardsSolve_Multiply_4_A; // 0x4680(0x20)(None)
	struct FQuat                                 GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_MathQuaternionFromTwoVectors_Result; // 0x46A0(0x20)(None)
	struct FVector                               GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_6_Value; // 0x46C0(0x18)(None)
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_6_Cache; // 0x46D8(0x10)(AssetRegistrySearchable, AdvancedDisplay, BlueprintCallable, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_GetMetadata_6_Found; // 0x46E8(0x1)(None)
	uint8                                        Pad_E16[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_RigUnit_SetRotation_CachedIndex; // 0x46F0(0x10)(AutoWeak, AdvancedDisplay, BlueprintCallable, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_ControlFlowBranch_4_BlockToRun; // 0x4700(0x8)(None)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_RigVMFunction_MathBoolNot_1_Result; // 0x4708(0x1)(None)
	uint8                                        Pad_E17[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigVMDispatch_ArrayGetAtIndex_2_Element; // 0x470C(0xC)(None)
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_9_Cache; // 0x4718(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, BlueprintCallable, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_9_Success; // 0x4728(0x1)(None)
	uint8                                        Pad_E18[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCachedRigElement>             GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_7_Cache; // 0x4730(0x10)(AssetRegistrySearchable, SimpleDisplay, BlueprintCallable, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         GroundConformForwardsSolve___GroundConformForwardsSolve_DISPATCH_RigDispatch_SetMetadata_7_Success; // 0x4740(0x1)(None)
	uint8                                        Pad_E19[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  GroundConformForwardsSolve___GroundConformForwardsSolve_Branch_BlockToRun; // 0x4744(0x8)(None)
	uint8                                        Pad_E1A[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TArray<int32>>                        RigVMModel___PBIK_1_EffectorSolverIndices;         // 0x4750(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, BlueprintCallable, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<TArray<int32>>                        RigVMModel___PBIK_1_BoneSettingToSolverBoneIndex;  // 0x4760(0x10)(ContainsInstancedReference, BlueprintCallable, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<TArray<int32>>                        RigVMModel___PBIK_1_SolverBoneToElementIndex;      // 0x4770(0x10)(AutoWeak, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FPBIKSolver>                   RigVMModel___PBIK_1_Solver;                        // 0x4780(0x10)(AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<bool>                                 RigVMModel___PBIK_1_bNeedsInit;                    // 0x4790(0x10)(SimpleDisplay, AdvancedDisplay, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         RigVMModel___LessEqual_Result;                     // 0x47A0(0x1)(None)
	uint8                                        Pad_E1C[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        RigVMModel___DISPATCH_RigDispatch_GetMetadata_2_Value; // 0x47A4(0x4)(None)
	TArray<struct FCachedRigElement>             RigVMModel___DISPATCH_RigDispatch_GetMetadata_2_Cache; // 0x47A8(0x10)(SimpleDisplay, AdvancedDisplay, Protected, TextExportTransient, NonPIEDuplicateTransient, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	bool                                         RigVMModel___DISPATCH_RigDispatch_GetMetadata_2_Found; // 0x47B8(0x1)(None)
	uint8                                        Pad_E1D[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigPose                              RigVMModel___HierarchyGetPoseItemArray_1_1_Pose;   // 0x47C0(0x70)(ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	class FName                                  RigVMModel___Branch_1_BlockToRun;                  // 0x4830(0x8)(None)
	class FName                                  RigVMModel___RigVMFunction_ControlFlowBranch_BlockToRun; // 0x4838(0x8)(None)
	TArray<struct FRigElementKey>                RigVMModel___RigUnit_ItemArray_Items__IO;          // 0x4840(0x10)(AutoWeak, ContainsInstancedReference, AdvancedDisplay, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FRigElementKey>                RigVMModel___RigUnit_ItemArray_1_Items__IO;        // 0x4850(0x10)(AutoWeak, AdvancedDisplay, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FRigElementKey>                GroundConform_Constructor_1___GroundConform_Constructor_SortRigElements_Out; // 0x4860(0x10)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<int32>                                GroundConform_Constructor_1___GroundConform_Constructor_SortRigElements_IndexArray; // 0x4870(0x10)(AssetRegistrySearchable, SimpleDisplay, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	int32                                        LocalVariable__SortRigElements_MainLoopIndex;      // 0x4880(0x4)(None)
	bool                                         SortRigElements___SortRigElements_DISPATCH_RigDispatch_CoreEquals_Result; // 0x4884(0x1)(None)
	uint8                                        Pad_E1E[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        SortRigElements___SortRigElements_ArrayIterator_Element; // 0x4888(0xC)(None)
	int32                                        SortRigElements___SortRigElements_ArrayIterator_Index; // 0x4894(0x4)(None)
	TArray<struct FRigElementKey>                SortRigElements___SortRigElements_CollectionChildrenArray_Items; // 0x4898(0x10)(AutoWeak, SimpleDisplay, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<struct FRigElementKey>                LocalVariable__SortRigElements_CollectionChildrenArray_Items; // 0x48A8(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	int32                                        LocalVariable__SortRigElements_InsertIndex;        // 0x48B8(0x4)(None)
	int32                                        LocalVariable__SortRigElements_NewElementsNum;     // 0x48BC(0x4)(None)
	bool                                         LocalVariable__SortRigElements_bBreakLoop;         // 0x48C0(0x1)(None)
	bool                                         SortRigElements___SortRigElements_ArrayFind_1_Success; // 0x48C1(0x1)(None)
	uint8                                        Pad_E20[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        SortRigElements___SortRigElements_ArrayGetAtIndex_Element; // 0x48C4(0xC)(None)
	int32                                        SortRigElements___SortRigElements_ForLoopCount_Index; // 0x48D0(0x4)(None)
	int32                                        SortRigElements___SortRigElements_ArrayFind_1_Index; // 0x48D4(0x4)(None)
	class FName                                  SortRigElements___SortRigElements_Branch_BlockToRun; // 0x48D8(0x8)(None)
	class FName                                  SortRigElements___SortRigElements_Branch_1_BlockToRun; // 0x48E0(0x8)(None)
	class FName                                  SortRigElements___SortRigElements_ForLoopCount_BlockToRun; // 0x48E8(0x8)(None)
	float                                        SortRigElements___SortRigElements_ForLoopCount_Ratio; // 0x48F0(0x4)(None)
	int32                                        SortRigElements___SortRigElements_Add_Result;      // 0x48F4(0x4)(None)
	class FName                                  SortRigElements___SortRigElements_Branch_2_BlockToRun; // 0x48F8(0x8)(None)
	int32                                        SortRigElements___SortRigElements_ArrayIterator_Count; // 0x4900(0x4)(None)
	float                                        SortRigElements___SortRigElements_ArrayIterator_Ratio; // 0x4904(0x4)(None)
	class FName                                  SortRigElements___SortRigElements_ArrayIterator_BlockToRun; // 0x4908(0x8)(None)
	TArray<struct FRigElementKey>                GroundConform_Constructor_1___GroundConform_Constructor_SortByIndexArray_1_SortedElements; // 0x4910(0x10)(AssetRegistrySearchable, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         SortByIndexArray_1___SortByIndexArray_GreaterEqual_Result; // 0x4920(0x1)(None)
	uint8                                        Pad_E21[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SortByIndexArray_1___SortByIndexArray_ArrayIterator_1_Element; // 0x4924(0x4)(None)
	struct FRigElementKey                        SortByIndexArray_1___SortByIndexArray_ArrayGetAtIndex_2_Element; // 0x4928(0xC)(None)
	int32                                        SortByIndexArray_1___SortByIndexArray_ArrayAdd_Index; // 0x4934(0x4)(None)
	class FName                                  SortByIndexArray_1___SortByIndexArray_Branch_BlockToRun; // 0x4938(0x8)(None)
	int32                                        SortByIndexArray_1___SortByIndexArray_ArrayIterator_1_Index; // 0x4940(0x4)(None)
	int32                                        SortByIndexArray_1___SortByIndexArray_ArrayIterator_1_Count; // 0x4944(0x4)(None)
	float                                        SortByIndexArray_1___SortByIndexArray_ArrayIterator_1_Ratio; // 0x4948(0x4)(None)
	class FName                                  SortByIndexArray_1___SortByIndexArray_ArrayIterator_1_BlockToRun; // 0x494C(0x8)(None)
	uint8                                        Pad_E25[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<double>                               GroundConform_Constructor_1___GroundConform_Constructor_SortByIndexArrayFloat_SortedElements; // 0x4958(0x10)(ContainsInstancedReference, Protected, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         SortByIndexArrayFloat___SortByIndexArrayFloat_GreaterEqual_Result; // 0x4968(0x1)(None)
	uint8                                        Pad_E26[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SortByIndexArrayFloat___SortByIndexArrayFloat_ArrayIterator_1_Element; // 0x496C(0x4)(None)
	double                                       SortByIndexArrayFloat___SortByIndexArrayFloat_ArrayGetAtIndex_2_Element; // 0x4970(0x8)(None)
	int32                                        SortByIndexArrayFloat___SortByIndexArrayFloat_ArrayAdd_Index; // 0x4978(0x4)(None)
	class FName                                  SortByIndexArrayFloat___SortByIndexArrayFloat_Branch_BlockToRun; // 0x497C(0x8)(None)
	int32                                        SortByIndexArrayFloat___SortByIndexArrayFloat_ArrayIterator_1_Index; // 0x4984(0x4)(None)
	int32                                        SortByIndexArrayFloat___SortByIndexArrayFloat_ArrayIterator_1_Count; // 0x4988(0x4)(None)
	float                                        SortByIndexArrayFloat___SortByIndexArrayFloat_ArrayIterator_1_Ratio; // 0x498C(0x4)(None)
	class FName                                  SortByIndexArrayFloat___SortByIndexArrayFloat_ArrayIterator_1_BlockToRun; // 0x4990(0x8)(None)
	TArray<double>                               GroundConform_Constructor_1___GroundConform_Constructor_SortByIndexArrayFloat_1_SortedElements; // 0x4998(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         SortByIndexArrayFloat_1___SortByIndexArrayFloat_GreaterEqual_Result; // 0x49A8(0x1)(None)
	uint8                                        Pad_E27[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SortByIndexArrayFloat_1___SortByIndexArrayFloat_ArrayIterator_1_Element; // 0x49AC(0x4)(None)
	double                                       SortByIndexArrayFloat_1___SortByIndexArrayFloat_ArrayGetAtIndex_2_Element; // 0x49B0(0x8)(None)
	int32                                        SortByIndexArrayFloat_1___SortByIndexArrayFloat_ArrayAdd_Index; // 0x49B8(0x4)(None)
	class FName                                  SortByIndexArrayFloat_1___SortByIndexArrayFloat_Branch_BlockToRun; // 0x49BC(0x8)(None)
	int32                                        SortByIndexArrayFloat_1___SortByIndexArrayFloat_ArrayIterator_1_Index; // 0x49C4(0x4)(None)
	int32                                        SortByIndexArrayFloat_1___SortByIndexArrayFloat_ArrayIterator_1_Count; // 0x49C8(0x4)(None)
	float                                        SortByIndexArrayFloat_1___SortByIndexArrayFloat_ArrayIterator_1_Ratio; // 0x49CC(0x4)(None)
	class FName                                  SortByIndexArrayFloat_1___SortByIndexArrayFloat_ArrayIterator_1_BlockToRun; // 0x49D0(0x8)(None)
	TArray<bool>                                 GroundConform_Constructor_1___GroundConform_Constructor_SortByIndexArrayBoolean_SortedElements; // 0x49D8(0x10)(AutoWeak, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         SortByIndexArrayBoolean___SortByIndexArrayBoolean_GreaterEqual_Result; // 0x49E8(0x1)(None)
	uint8                                        Pad_E28[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SortByIndexArrayBoolean___SortByIndexArrayBoolean_ArrayIterator_1_Element; // 0x49EC(0x4)(None)
	bool                                         SortByIndexArrayBoolean___SortByIndexArrayBoolean_ArrayGetAtIndex_2_Element; // 0x49F0(0x1)(None)
	uint8                                        Pad_E29[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SortByIndexArrayBoolean___SortByIndexArrayBoolean_ArrayAdd_Index; // 0x49F4(0x4)(None)
	class FName                                  SortByIndexArrayBoolean___SortByIndexArrayBoolean_Branch_BlockToRun; // 0x49F8(0x8)(None)
	int32                                        SortByIndexArrayBoolean___SortByIndexArrayBoolean_ArrayIterator_1_Index; // 0x4A00(0x4)(None)
	int32                                        SortByIndexArrayBoolean___SortByIndexArrayBoolean_ArrayIterator_1_Count; // 0x4A04(0x4)(None)
	float                                        SortByIndexArrayBoolean___SortByIndexArrayBoolean_ArrayIterator_1_Ratio; // 0x4A08(0x4)(None)
	class FName                                  SortByIndexArrayBoolean___SortByIndexArrayBoolean_ArrayIterator_1_BlockToRun; // 0x4A0C(0x8)(None)
	uint8                                        Pad_E2A[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<double>                               GroundConform_Constructor_1___GroundConform_Constructor_SortByIndexArrayFloat_1_1_SortedElements; // 0x4A18(0x10)(ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         SortByIndexArrayFloat_1_1___SortByIndexArrayFloat_GreaterEqual_Result; // 0x4A28(0x1)(None)
	uint8                                        Pad_E2B[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SortByIndexArrayFloat_1_1___SortByIndexArrayFloat_ArrayIterator_1_Element; // 0x4A2C(0x4)(None)
	double                                       SortByIndexArrayFloat_1_1___SortByIndexArrayFloat_ArrayGetAtIndex_2_Element; // 0x4A30(0x8)(None)
	int32                                        SortByIndexArrayFloat_1_1___SortByIndexArrayFloat_ArrayAdd_Index; // 0x4A38(0x4)(None)
	class FName                                  SortByIndexArrayFloat_1_1___SortByIndexArrayFloat_Branch_BlockToRun; // 0x4A3C(0x8)(None)
	int32                                        SortByIndexArrayFloat_1_1___SortByIndexArrayFloat_ArrayIterator_1_Index; // 0x4A44(0x4)(None)
	int32                                        SortByIndexArrayFloat_1_1___SortByIndexArrayFloat_ArrayIterator_1_Count; // 0x4A48(0x4)(None)
	float                                        SortByIndexArrayFloat_1_1___SortByIndexArrayFloat_ArrayIterator_1_Ratio; // 0x4A4C(0x4)(None)
	class FName                                  SortByIndexArrayFloat_1_1___SortByIndexArrayFloat_ArrayIterator_1_BlockToRun; // 0x4A50(0x8)(None)
	TArray<double>                               GroundConform_Constructor_1___GroundConform_Constructor_SortByIndexArrayFloat_1_1_1_SortedElements; // 0x4A58(0x10)(SimpleDisplay, AdvancedDisplay, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         SortByIndexArrayFloat_1_1_1___SortByIndexArrayFloat_GreaterEqual_Result; // 0x4A68(0x1)(None)
	uint8                                        Pad_E2C[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SortByIndexArrayFloat_1_1_1___SortByIndexArrayFloat_ArrayIterator_1_Element; // 0x4A6C(0x4)(None)
	double                                       SortByIndexArrayFloat_1_1_1___SortByIndexArrayFloat_ArrayGetAtIndex_2_Element; // 0x4A70(0x8)(None)
	int32                                        SortByIndexArrayFloat_1_1_1___SortByIndexArrayFloat_ArrayAdd_Index; // 0x4A78(0x4)(None)
	class FName                                  SortByIndexArrayFloat_1_1_1___SortByIndexArrayFloat_Branch_BlockToRun; // 0x4A7C(0x8)(None)
	int32                                        SortByIndexArrayFloat_1_1_1___SortByIndexArrayFloat_ArrayIterator_1_Index; // 0x4A84(0x4)(None)
	int32                                        SortByIndexArrayFloat_1_1_1___SortByIndexArrayFloat_ArrayIterator_1_Count; // 0x4A88(0x4)(None)
	float                                        SortByIndexArrayFloat_1_1_1___SortByIndexArrayFloat_ArrayIterator_1_Ratio; // 0x4A8C(0x4)(None)
	class FName                                  SortByIndexArrayFloat_1_1_1___SortByIndexArrayFloat_ArrayIterator_1_BlockToRun; // 0x4A90(0x8)(None)
	TArray<double>                               GroundConform_Constructor_1___GroundConform_Constructor_SortByIndexArrayFloat_0_SortedElements; // 0x4A98(0x10)(AutoWeak, AssetRegistrySearchable, AdvancedDisplay, BlueprintAuthorityOnly, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	bool                                         SortByIndexArrayFloat_0___SortByIndexArrayFloat_GreaterEqual_Result; // 0x4AA8(0x1)(None)
	uint8                                        Pad_E2D[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SortByIndexArrayFloat_0___SortByIndexArrayFloat_ArrayIterator_1_Element; // 0x4AAC(0x4)(None)
	double                                       SortByIndexArrayFloat_0___SortByIndexArrayFloat_ArrayGetAtIndex_2_Element; // 0x4AB0(0x8)(None)
	int32                                        SortByIndexArrayFloat_0___SortByIndexArrayFloat_ArrayAdd_Index; // 0x4AB8(0x4)(None)
	class FName                                  SortByIndexArrayFloat_0___SortByIndexArrayFloat_Branch_BlockToRun; // 0x4ABC(0x8)(None)
	int32                                        SortByIndexArrayFloat_0___SortByIndexArrayFloat_ArrayIterator_1_Index; // 0x4AC4(0x4)(None)
	int32                                        SortByIndexArrayFloat_0___SortByIndexArrayFloat_ArrayIterator_1_Count; // 0x4AC8(0x4)(None)
	float                                        SortByIndexArrayFloat_0___SortByIndexArrayFloat_ArrayIterator_1_Ratio; // 0x4ACC(0x4)(None)
	class FName                                  SortByIndexArrayFloat_0___SortByIndexArrayFloat_ArrayIterator_1_BlockToRun; // 0x4AD0(0x8)(None)
	int32                                        GroundConform_Constructor_1___GroundConform_Constructor_ArrayIterator_1_Index; // 0x4AD8(0x4)(None)
	uint8                                        Pad_E2E[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       GroundConform_Constructor_1___GroundConform_Constructor_Multiply_Multiply_1_Result; // 0x4AE0(0x8)(None)
	double                                       GroundConform_Constructor_1___GroundConform_Constructor_Multiply_Multiply_Result; // 0x4AE8(0x8)(None)
	double                                       GroundConform_Constructor_1___GroundConform_Constructor_ArrayIterator_1_Element; // 0x4AF0(0x8)(None)
	double                                       GroundConform_Constructor_1___GroundConform_Constructor_Multiply_Multiply_B; // 0x4AF8(0x8)(None)
	int32                                        GroundConform_Constructor_1___GroundConform_Constructor_ArrayIterator_1_Count; // 0x4B00(0x4)(None)
	float                                        GroundConform_Constructor_1___GroundConform_Constructor_ArrayIterator_1_Ratio; // 0x4B04(0x4)(None)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_ArrayIterator_1_BlockToRun; // 0x4B08(0x8)(None)
	int32                                        GroundConform_Constructor_1___GroundConform_Constructor_ArrayIterator_1_1_Index; // 0x4B10(0x4)(None)
	uint8                                        Pad_E2F[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       GroundConform_Constructor_1___GroundConform_Constructor_Multiply_1_Result; // 0x4B18(0x8)(None)
	double                                       GroundConform_Constructor_1___GroundConform_Constructor_ArrayIterator_1_1_Element; // 0x4B20(0x8)(None)
	int32                                        GroundConform_Constructor_1___GroundConform_Constructor_ArrayIterator_1_1_Count; // 0x4B28(0x4)(None)
	float                                        GroundConform_Constructor_1___GroundConform_Constructor_ArrayIterator_1_1_Ratio; // 0x4B2C(0x4)(None)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_ArrayIterator_1_1_BlockToRun; // 0x4B30(0x8)(None)
	struct FRigElementKey                        GroundConform_Constructor_1___GroundConform_Constructor_If_1_Result; // 0x4B38(0xC)(None)
	bool                                         GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_GetMetadata_4_1_Found; // 0x4B44(0x1)(None)
	uint8                                        Pad_E30[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRigElementKey                        GroundConform_Constructor_1___GroundConform_Constructor_ArrayGetAtIndex_1_Element; // 0x4B48(0xC)(None)
	int32                                        GroundConform_Constructor_1___GroundConform_Constructor_ArrayIterator_Index; // 0x4B54(0x4)(None)
	TArray<struct FCachedRigElement>             GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_GetMetadata_4_1_Cache; // 0x4B58(0x10)(SimpleDisplay, AdvancedDisplay, Protected, TextExportTransient, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	struct FRigElementKey                        GroundConform_Constructor_1___GroundConform_Constructor_DISPATCH_RigDispatch_GetMetadata_4_1_Value; // 0x4B68(0xC)(None)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_Concat_1_Result; // 0x4B74(0x8)(None)
	struct FRigElementKey                        GroundConform_Constructor_1___GroundConform_Constructor_ArrayIterator_Element; // 0x4B7C(0xC)(None)
	class FName                                  GroundConform_Constructor_1___GroundConform_Constructor_Concat_1_A; // 0x4B88(0x8)(None)
	struct FRigElementKey                        GroundConform_Constructor_1___GroundConform_Constructor_SpawnControl_Item; // 0x4B90(0xC)(None)
	uint8                                        Pad_E31[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               GroundConform_Constructor_1___GroundConform_Constructor_Multiply_3_Result; // 0x4BA0(0x18)(None)
	uint8                                        Pad_E32[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            GroundConform_Constructor_1___GroundConform_Constructor_GetTransform_Transform; // 0x4BC0(0x60)(None)
	TArray<struct FCachedRigElement>             GroundConform_Constructor_1___GroundConform_Constructor_GetTransform_CachedIndex; // 0x4C20(0x10)(AssetRegistrySearchable, BlueprintAuthorityOnly, ExposeOnSpawn, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	struct FVector                               GroundConform_Constructor_1___GroundConform_Constructor_Multiply_3_A; // 0x4C30(0x18)(None)
	uint8                                        Pad_E33[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
