#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x541 (0xD21 - 0x7E0)
// WidgetBlueprintGeneratedClass OptionsMenu.OptionsMenu_C
class UOptionsMenu_C : public UUI_OptionsMenu
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x7E0(0x8)(None)
	class UWidgetAnimation*                      Close;                                             // 0x7E8(0x8)(Edit, ZeroConstructor)
	class UWidgetAnimation*                      Open;                                              // 0x7F0(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       AccessInventory;                                   // 0x7F8(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             AllowCrosshairCheckbox;                            // 0x800(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             AllowHitMarkersCheckbox;                           // 0x808(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       AltFire;                                           // 0x810(0x8)(Edit, ZeroConstructor)
	class USlider*                               AmbientSoundVolumeSlider;                          // 0x818(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       AntiAliasingComboBox;                              // 0x820(0x8)(Edit, ZeroConstructor)
	class USlider*                               AudioVolumeSlider;                                 // 0x828(0x8)(Edit, ZeroConstructor)
	class UImage*                                BG;                                                // 0x830(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             BloomCheckbox;                                     // 0x838(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       CallAggressive;                                    // 0x840(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       CallAttackTarget;                                  // 0x848(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       CallFollow;                                        // 0x850(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       CallFollowOne;                                     // 0x858(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       CallNeutral;                                       // 0x860(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       CallPassive;                                       // 0x868(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       CallStay;                                          // 0x870(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       CallStayOne;                                       // 0x878(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             CameraBobCheckbox;                                 // 0x880(0x8)(Edit, ZeroConstructor)
	class USlider*                               CameraShakeScaleSlider;                            // 0x888(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   CancelButton;                                      // 0x890(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       CharacterActionWheel;                              // 0x898(0x8)(Edit, ZeroConstructor)
	class USlider*                               CharacterVolumeSlider;                             // 0x8A0(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             ChatBubblesCheckbox;                               // 0x8A8(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             ChatShowSteamNameCheckbox;                         // 0x8B0(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             ChatShowTribeNameCheckbox;                         // 0x8B8(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       ClientNetSpeedComboBox;                            // 0x8C0(0x8)(Edit, ZeroConstructor)
	class UButton*                               CloseGamepadControlsButton;                        // 0x8C8(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             ColorizedItemNamesCheckbox;                        // 0x8D0(0x8)(Edit, ZeroConstructor)
	class UImage*                                ControlsImage;                                     // 0x8D8(0x8)(Edit, ZeroConstructor)
	class UImage*                                CreatureBottomBorder;                              // 0x8E0(0x8)(Edit, ZeroConstructor)
	class UImage*                                CreatureTopBorder;                                 // 0x8E8(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       Crouch;                                            // 0x8F0(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             DisableSubtitlesCheckbox;                          // 0x8F8(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             DistanceFieldShadowingCheckbox;                    // 0x900(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       Drag;                                              // 0x908(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       DropItem;                                          // 0x910(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             DynamicTessCheckbox;                               // 0x918(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       EmoteKey1;                                         // 0x920(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       EmoteKey2;                                         // 0x928(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             EnableBloodEffectsCheckbox;                        // 0x930(0x8)(Edit, ZeroConstructor)
	class UButton*                               EnableHMDButton;                                   // 0x938(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             FilmGrainCheckbox;                                 // 0x940(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       Fire;                                              // 0x948(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             FirstPersonRidingCheckbox;                         // 0x950(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             FloatingNamesCheckbox;                             // 0x958(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       ForceCraftButton;                                  // 0x960(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             ForceTPVCameraOffsetCheckbox;                      // 0x968(0x8)(Edit, ZeroConstructor)
	class USlider*                               FOVSlider;                                         // 0x970(0x8)(Edit, ZeroConstructor)
	class UImage*                                FrontOverlayAdditive;                              // 0x978(0x8)(Edit, ZeroConstructor)
	class UButton*                               GamepadControlsButton;                             // 0x980(0x8)(Edit, ZeroConstructor)
	class UImage*                                GamepadImage;                                      // 0x988(0x8)(Edit, ZeroConstructor)
	class USlider*                               GammaCorrectionSlider;                             // 0x990(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       GiveDefaultWeapon;                                 // 0x998(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       GraphicsQualityComboBox;                           // 0x9A0(0x8)(Edit, ZeroConstructor)
	class UBorder*                               GraphicsQualityHelpTooltip;                        // 0x9A8(0x8)(Edit, ZeroConstructor)
	class USlider*                               GroundClutterDensitySlider;                        // 0x9B0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      HeightTextBox;                                     // 0x9B8(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             HideFloatingPlayerNamesCheckbox;                   // 0x9C0(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             HideGamepadItemSelectionModifierCheckbox;          // 0x9C8(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             HideServerInfoCheckbox;                            // 0x9D0(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             HighQualityMaterialsCheckbox;                      // 0x9D8(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             HighQualitySurfacesCheckbox;                       // 0x9E0(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             HighQualityVFXCheckbox;                            // 0x9E8(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_0;                                           // 0x9F0(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_1;                                           // 0x9F8(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_8;                                           // 0xA00(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_11;                                          // 0xA08(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_43;                                          // 0xA10(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_92;                                          // 0xA18(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_241;                                         // 0xA20(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_242;                                         // 0xA28(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_256;                                         // 0xA30(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_265;                                         // 0xA38(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_269;                                         // 0xA40(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_276;                                         // 0xA48(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_320;                                         // 0xA50(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_487;                                         // 0xA58(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_488;                                         // 0xA60(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_551;                                         // 0xA68(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_609;                                         // 0xA70(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_921;                                         // 0xA78(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_922;                                         // 0xA80(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_1544;                                        // 0xA88(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_1545;                                        // 0xA90(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             InvertMouse;                                       // 0xA98(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             JoinNotificationsCheckbox;                         // 0xAA0(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       Jump;                                              // 0xAA8(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             LightShaftsCheckbox;                               // 0xAB0(0x8)(Edit, ZeroConstructor)
	class USlider*                               LODScalarSlider;                                   // 0xAB8(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       LookDown;                                          // 0xAC0(0x8)(Edit, ZeroConstructor)
	class USlider*                               LookLeftRightSensitivitySlider;                    // 0xAC8(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       LookUp;                                            // 0xAD0(0x8)(Edit, ZeroConstructor)
	class USlider*                               LookUpDownSensitivitySlider;                       // 0xAD8(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       MoveBackward;                                      // 0xAE0(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       MoveForward;                                       // 0xAE8(0x8)(Edit, ZeroConstructor)
	class USlider*                               MusicSlider;                                       // 0xAF0(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             NoTooltipDelayCheckbox;                            // 0xAF8(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       OpenMapMarkers;                                    // 0xB00(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   OpenModShopButton;                                 // 0xB08(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       OrbitCam;                                          // 0xB10(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       OrbitCamToggle;                                    // 0xB18(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             PlayActionWheelClickSoundCheckbox;                 // 0xB20(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       Poop;                                              // 0xB28(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       PostProcessingComboBox;                            // 0xB30(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       Prone;                                             // 0xB38(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       PushToTalk;                                        // 0xB40(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             QuickToggleItemNamesCheckbox;                      // 0xB48(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       Reload;                                            // 0xB50(0x8)(Edit, ZeroConstructor)
	class UButton*                               RepositionHMDViewButton;                           // 0xB58(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   ResetButton;                                       // 0xB60(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   ResetIntroCinematicsButton;                        // 0xB68(0x8)(Edit, ZeroConstructor)
	class UButton*                               ResetTutorials;                                    // 0xB70(0x8)(Edit, ZeroConstructor)
	class USlider*                               ResolutionScaleSlider;                             // 0xB78(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       ResolutionsComboBox;                               // 0xB80(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       Run;                                               // 0xB88(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       RunToggle;                                         // 0xB90(0x8)(Edit, ZeroConstructor)
	class USlider*                               SFXSlider;                                         // 0xB98(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       ShadowsComboBox;                                   // 0xBA0(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             ShowBiomeWallsCheckbox;                            // 0xBA8(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             ShowChatCheckbox;                                  // 0xBB0(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       ShowExtendedInfo;                                  // 0xBB8(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       ShowLocalChat;                                     // 0xBC0(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       ShowMyCraftables;                                  // 0xBC8(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       ShowMyInventory;                                   // 0xBD0(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       ShowTribeChat;                                     // 0xBD8(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       ShowTribeManager;                                  // 0xBE0(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             SSAOCheckbox;                                      // 0xBE8(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             StatusNotificationMessagesCheckbox;                // 0xBF0(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       StrafeLeft;                                        // 0xBF8(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       StrafeRight;                                       // 0xC00(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       Targeting;                                         // 0xC08(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             TemperatureFCheckbox;                              // 0xC10(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       TerrainShadowComboBox;                             // 0xC18(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       TexturesComboBox;                                  // 0xC20(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       ToggleAutoChat;                                    // 0xC28(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       ToggleConsole;                                     // 0xC30(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             ToggleExtendedHUDInfoCheckbox;                     // 0xC38(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       ToggleHUDHidden;                                   // 0xC40(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       ToggleMap;                                         // 0xC48(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             ToggleToTalkCheckBox;                              // 0xC50(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             TorporEffectCheckbox;                              // 0xC58(0x8)(Edit, ZeroConstructor)
	class USlider*                               TrueSkyQualitySlider;                              // 0xC60(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       TurnLeft;                                          // 0xC68(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       TurnRight;                                         // 0xC70(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       Use;                                               // 0xC78(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             UseDFAOCheckbox;                                   // 0xC80(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       UseItem1;                                          // 0xC88(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       UseItem10;                                         // 0xC90(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       UseItem2;                                          // 0xC98(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       UseItem3;                                          // 0xCA0(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       UseItem4;                                          // 0xCA8(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       UseItem5;                                          // 0xCB0(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       UseItem6;                                          // 0xCB8(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       UseItem7;                                          // 0xCC0(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       UseItem8;                                          // 0xCC8(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       UseItem9;                                          // 0xCD0(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             VibrationCheckbox;                                 // 0xCD8(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       ViewDistanceComboBox;                              // 0xCE0(0x8)(Edit, ZeroConstructor)
	class USlider*                               VoiceSlider;                                       // 0xCE8(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       WeaponAccessory;                                   // 0xCF0(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      WidthTextBox;                                      // 0xCF8(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       WindowModeComboBox;                                // 0xD00(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       WorldTileBufferComboBox;                           // 0xD08(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       ZoomIn;                                            // 0xD10(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       ZoomOut;                                           // 0xD18(0x8)(ZeroConstructor)
	bool                                         GraphicsToolTipIsVisible;                          // 0xD20(0x1)(None)

	static class UClass* StaticClass();
	static class UOptionsMenu_C* GetDefaultObj();

	void BndEvt__AntiAliasingComboBox_K2Node_ComponentBoundEvent_13_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, enum class ESelectInfo SelectionType);
	void BndEvt__PostProcessingComboBox_K2Node_ComponentBoundEvent_20_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, enum class ESelectInfo SelectionType);
	void BndEvt__ShadowsComboBox_K2Node_ComponentBoundEvent_28_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, enum class ESelectInfo SelectionType);
	void BndEvt__TerrainShadowComboBox_K2Node_ComponentBoundEvent_37_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, enum class ESelectInfo SelectionType);
	void BndEvt__TexturesComboBox_K2Node_ComponentBoundEvent_47_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, enum class ESelectInfo SelectionType);
	void BndEvt__ViewDistanceComboBox_K2Node_ComponentBoundEvent_7_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, enum class ESelectInfo SelectionType);
	void BndEvt__TrueSkyQualitySlider_K2Node_ComponentBoundEvent_67_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__GroundClutterDensitySlider_K2Node_ComponentBoundEvent_81_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__FilmGrainCheckbox_K2Node_ComponentBoundEvent_193_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void BndEvt__UseDFAOCheckbox_K2Node_ComponentBoundEvent_206_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void BndEvt__SSAOCheckbox_K2Node_ComponentBoundEvent_220_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void BndEvt__GraphicsQualityComboBox_K2Node_ComponentBoundEvent_11_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, enum class ESelectInfo SelectionType);
	void OptionsGraphTick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__OptionsMenu_OpenModShopButton_K2Node_ComponentBoundEvent_0_OnButtonReleasedEvent__DelegateSignature();
	void ExecuteUbergraph_OptionsMenu(int32 EntryPoint, const class FString& K2Node_ComponentBoundEvent_SelectedItem_6, enum class ESelectInfo K2Node_ComponentBoundEvent_SelectionType_6, const class FString& K2Node_ComponentBoundEvent_SelectedItem_5, enum class ESelectInfo K2Node_ComponentBoundEvent_SelectionType_5, const class FString& K2Node_ComponentBoundEvent_SelectedItem_4, enum class ESelectInfo K2Node_ComponentBoundEvent_SelectionType_4, const class FString& K2Node_ComponentBoundEvent_SelectedItem_3, enum class ESelectInfo K2Node_ComponentBoundEvent_SelectionType_3, const class FString& K2Node_ComponentBoundEvent_SelectedItem_2, enum class ESelectInfo K2Node_ComponentBoundEvent_SelectionType_2, const class FString& K2Node_ComponentBoundEvent_SelectedItem_1, enum class ESelectInfo K2Node_ComponentBoundEvent_SelectionType_1, float K2Node_ComponentBoundEvent_Value_1, float K2Node_ComponentBoundEvent_Value, bool K2Node_ComponentBoundEvent_bIsChecked_2, bool K2Node_ComponentBoundEvent_bIsChecked_1, bool K2Node_ComponentBoundEvent_bIsChecked, const class FString& K2Node_ComponentBoundEvent_SelectedItem, enum class ESelectInfo K2Node_ComponentBoundEvent_SelectionType, bool CallFunc_Not_PreBool_ReturnValue, const struct FGeometry& K2Node_Event_MyGeometry, float K2Node_Event_InDeltaTime, bool CallFunc_IsHovered_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1);
};

}


