#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xE38 (0x1D70 - 0xF38)
// WidgetBlueprintGeneratedClass OptionsMenu_PC.OptionsMenu_C
class UOptionsMenu_C : public UUI_PCOptionsMenu
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xF38(0x8)(None)
	class UWidgetAnimation*                      FadeIn;                                            // 0xF40(0x8)(Edit, ZeroConstructor)
	class UWidgetAnimation*                      FadeOut;                                           // 0xF48(0x8)(Edit, ZeroConstructor)
	class UWidgetAnimation*                      Close;                                             // 0xF50(0x8)(Edit, ZeroConstructor)
	class UWidgetAnimation*                      Open;                                              // 0xF58(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       AccessInventory;                                   // 0xF60(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       AdvancedGraphics;                                  // 0xF68(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   AdvancedSettingsMenuButton;                        // 0xF70(0x8)(Edit, ZeroConstructor)
	class UCanvasPanel*                          AdvancedSettingsPanel;                             // 0xF78(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  AimAssistStrengthMultiplier;                       // 0xF80(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          AimAssistText;                                     // 0xF88(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* AllowCrosshairCheckbox;                            // 0xF90(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* AllowEnhancedDistanceDetailModeCheckbox;           // 0xF98(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* AllowHitMarkersCheckbox;                           // 0xFA0(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       AltFire;                                           // 0xFA8(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  AmbientSoundVolumeSlider;                          // 0xFB0(0x8)(Edit, ZeroConstructor)
	class USizeBox*                              AntiAlias;                                         // 0xFB8(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       AntiAliasingComboBox;                              // 0xFC0(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   ApplyButton;                                       // 0xFC8(0x8)(Edit, ZeroConstructor)
	class UBorder*                               AudioBox;                                          // 0xFD0(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  AudioUISlider;                                     // 0xFD8(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  AudioVolumeSlider;                                 // 0xFE0(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   AutoDetectSettings;                                // 0xFE8(0x8)(Edit, ZeroConstructor)
	class USizeBox*                              AutoDetectSettingSizeBox;                          // 0xFF0(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* AutomaticallyCreatePOIOnDeathCheckbox;             // 0xFF8(0x8)(Edit, ZeroConstructor)
	class UASAUIWidget_Button_Style1A_C*         BackButton;                                        // 0x1000(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* bDisableHLOD;                                      // 0x1008(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* bEnableFluidInteraction;                           // 0x1010(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* bEnableFootstepDecals;                             // 0x1018(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* bEnableFootstepParticles;                          // 0x1020(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* bEnableLowLightEnhancement;                        // 0x1028(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       BrakeDino;                                         // 0x1030(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  BubbleParticlesMultiplierSlider;                   // 0x1038(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       CallAggressive;                                    // 0x1040(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       CallAttackTarget;                                  // 0x1048(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       CallFollow;                                        // 0x1050(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       CallFollowDistanceCycleOne;                        // 0x1058(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       CallFollowOne;                                     // 0x1060(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       CallLandOne;                                       // 0x1068(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       CallMoveTo;                                        // 0x1070(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       CallNeutral;                                       // 0x1078(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       CallPassive;                                       // 0x1080(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       CallSetAggressive;                                 // 0x1088(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       CallStay;                                          // 0x1090(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       CallStayOne;                                       // 0x1098(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* CameraBobCheckbox;                                 // 0x10A0(0x8)(Edit, ZeroConstructor)
	class UBorder*                               CameraBox;                                         // 0x10A8(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       CameraModeComboBox;                                // 0x10B0(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          CameraModeComboBox_3;                              // 0x10B8(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  CameraShakeScaleSlider;                            // 0x10C0(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   CancelButton;                                      // 0x10C8(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       CancelOrder;                                       // 0x10D0(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       CenterPlayer;                                      // 0x10D8(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       CenterSelection;                                   // 0x10E0(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       ChangeCameraMode;                                  // 0x10E8(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            ChangesText_1;                                     // 0x10F0(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       CharacterActionWheel;                              // 0x10F8(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  CharacterSlider;                                   // 0x1100(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* ChatBubblesCheckbox;                               // 0x1108(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* ChatShowSteamNameCheckbox;                         // 0x1110(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* ChatShowTribeNameCheckbox;                         // 0x1118(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       ClientNetSpeedComboBox;                            // 0x1120(0x8)(Edit, ZeroConstructor)
	class UButton*                               CloseGamepadControlsButton;                        // 0x1128(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* ColorizedItemNamesCheckbox;                        // 0x1130(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* ConsoleCommandCheckbox;                            // 0x1138(0x8)(Edit, ZeroConstructor)
	class UImage*                                CreatureBottomBorder;                              // 0x1140(0x8)(Edit, ZeroConstructor)
	class UImage*                                CreatureTopBorder;                                 // 0x1148(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_ColorPicker_Widget_ASA_C* CrosshairColorOverAlly;                            // 0x1150(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_ColorPicker_Widget_ASA_C* CrosshairColorSlider;                              // 0x1158(0x8)(Edit, ZeroConstructor)
	class UImage*                                CrosshairIcon;                                     // 0x1160(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  CrosshairOpacitySlider;                            // 0x1168(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_ColorPicker_Widget_ASA_C* CrosshairOverEnemy;                                // 0x1170(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  CrosshairSizeSlider;                               // 0x1178(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       Crouch;                                            // 0x1180(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  CursorSensitivitySlider;                           // 0x1188(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA;                         // 0x1190(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_1;                       // 0x1198(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_2;                       // 0x11A0(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_3;                       // 0x11A8(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_4;                       // 0x11B0(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_5;                       // 0x11B8(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_6;                       // 0x11C0(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_7;                       // 0x11C8(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_8;                       // 0x11D0(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_9;                       // 0x11D8(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_10;                      // 0x11E0(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_11;                      // 0x11E8(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_12;                      // 0x11F0(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_13;                      // 0x11F8(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_14;                      // 0x1200(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_15;                      // 0x1208(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_16;                      // 0x1210(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_17;                      // 0x1218(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_18;                      // 0x1220(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_19;                      // 0x1228(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_20;                      // 0x1230(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_21;                      // 0x1238(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_22;                      // 0x1240(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_23;                      // 0x1248(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_24;                      // 0x1250(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_25;                      // 0x1258(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_26;                      // 0x1260(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_27;                      // 0x1268(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_28;                      // 0x1270(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_29;                      // 0x1278(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_30;                      // 0x1280(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_31;                      // 0x1288(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_32;                      // 0x1290(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_33;                      // 0x1298(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_34;                      // 0x12A0(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_35;                      // 0x12A8(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_36;                      // 0x12B0(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_37;                      // 0x12B8(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_38;                      // 0x12C0(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_39;                      // 0x12C8(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_40;                      // 0x12D0(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_41;                      // 0x12D8(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_42;                      // 0x12E0(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_43;                      // 0x12E8(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_44;                      // 0x12F0(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_45;                      // 0x12F8(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_46;                      // 0x1300(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_47;                      // 0x1308(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_48;                      // 0x1310(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_49;                      // 0x1318(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_50;                      // 0x1320(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_51;                      // 0x1328(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_52;                      // 0x1330(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_53;                      // 0x1338(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_54;                      // 0x1340(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_55;                      // 0x1348(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_56;                      // 0x1350(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_57;                      // 0x1358(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_58;                      // 0x1360(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_59;                      // 0x1368(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_60;                      // 0x1370(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_61;                      // 0x1378(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_62;                      // 0x1380(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_63;                      // 0x1388(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_64;                      // 0x1390(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_65;                      // 0x1398(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_66;                      // 0x13A0(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_67;                      // 0x13A8(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_68;                      // 0x13B0(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_69;                      // 0x13B8(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_70;                      // 0x13C0(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_71;                      // 0x13C8(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_72;                      // 0x13D0(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_73;                      // 0x13D8(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_74;                      // 0x13E0(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_75;                      // 0x13E8(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_76;                      // 0x13F0(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_77;                      // 0x13F8(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_78;                      // 0x1400(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_79;                      // 0x1408(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_80;                      // 0x1410(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_81;                      // 0x1418(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_82;                      // 0x1420(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_83;                      // 0x1428(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_84;                      // 0x1430(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_85;                      // 0x1438(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_86;                      // 0x1440(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_87;                      // 0x1448(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_88;                      // 0x1450(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_89;                      // 0x1458(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_90;                      // 0x1460(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_91;                      // 0x1468(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_92;                      // 0x1470(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_93;                      // 0x1478(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_94;                      // 0x1480(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_95;                      // 0x1488(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_96;                      // 0x1490(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_97;                      // 0x1498(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_98;                      // 0x14A0(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_99;                      // 0x14A8(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_100;                     // 0x14B0(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_101;                     // 0x14B8(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_102;                     // 0x14C0(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_103;                     // 0x14C8(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          DataListButton_Widget_ASA_104;                     // 0x14D0(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* DefaultCharacterItemsCheckbox;                     // 0x14D8(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       DinoCameraModeComboBox;                            // 0x14E0(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       DinoTooltipSetting;                                // 0x14E8(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* DisableBloomCheckbox;                              // 0x14F0(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* DisableBloomCheckboxConsole;                       // 0x14F8(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* DisableLightShaftsCheckbox;                        // 0x1500(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* DisableLightShaftsCheckboxConsole;                 // 0x1508(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* DisableLoadScreenMusicCheckbox;                    // 0x1510(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* DisableMenuMusicCheckbox;                          // 0x1518(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* DisableMenuTransitionsCheckbox;                    // 0x1520(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* DisablePaintingsCheckbox;                          // 0x1528(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* DisableSubtitlesCheckbox;                          // 0x1530(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* DisableTorporEffectCheckbox;                       // 0x1538(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* DisableTPVCameraInterpolationCheckbox;             // 0x1540(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* DisableVirtualCursorCheckbox;                      // 0x1548(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* DistanceFieldShadowingCheckbox;                    // 0x1550(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       Drag;                                              // 0x1558(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       DropItem;                                          // 0x1560(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       DroppedItemTooltipSetting;                         // 0x1568(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* DynamicTessCheckbox;                               // 0x1570(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       EffectsQuality;                                    // 0x1578(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       EmoteKey1;                                         // 0x1580(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       EmoteKey2;                                         // 0x1588(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* EnableBloodEffectsCheckbox;                        // 0x1590(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* EnableColorGradingCheckbox;                        // 0x1598(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* EnableColorGradingCheckboxConsole;                 // 0x15A0(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   EnableHMDButton;                                   // 0x15A8(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* ExtraLevelStreamingDistanceCheckbox;               // 0x15B0(0x8)(Edit, ZeroConstructor)
	class UImage*                                FaceButtonBottom;                                  // 0x15B8(0x8)(Edit, ZeroConstructor)
	class UImage*                                FaceButtonLeft;                                    // 0x15C0(0x8)(Edit, ZeroConstructor)
	class UImage*                                FaceButtonRight;                                   // 0x15C8(0x8)(Edit, ZeroConstructor)
	class UImage*                                FacebuttonTopButton;                               // 0x15D0(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* FilmGrainCheckbox;                                 // 0x15D8(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* FilmGrainCheckboxConsole;                          // 0x15E0(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       Fire;                                              // 0x15E8(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* FirstPersonRidingCheckbox;                         // 0x15F0(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* FloatingNamesCheckbox;                             // 0x15F8(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  FoliageInteractionDistance;                        // 0x1600(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  FoliageInteractionDistanceLimit;                   // 0x1608(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  FoliageInteractionQuantityLimit;                   // 0x1610(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       FoliageQuality;                                    // 0x1618(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       ForceCraftButton;                                  // 0x1620(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* ForceShowRadialWheelTexts;                         // 0x1628(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* ForceTPVCameraOffsetCheckbox;                      // 0x1630(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  FOVSlider;                                         // 0x1638(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             FPSCapCheckbox;                                    // 0x1640(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      FPSCapTextBox;                                     // 0x1648(0x8)(Edit, ZeroConstructor)
	class UImage*                                FrontOverlayAdditive;                              // 0x1650(0x8)(Edit, ZeroConstructor)
	class UImage*                                GamepadControllerImage;                            // 0x1658(0x8)(Edit, ZeroConstructor)
	class UCanvasPanel*                          GamepadControlsPanel;                              // 0x1660(0x8)(Edit, ZeroConstructor)
	class UImage*                                GamepadIcon_NextMenu;                              // 0x1668(0x8)(Edit, ZeroConstructor)
	class UImage*                                GamepadIcon_PrevMenu;                              // 0x1670(0x8)(Edit, ZeroConstructor)
	class UImage*                                GamepadImage;                                      // 0x1678(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   GamepadMenuButton;                                 // 0x1680(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      Gamma1Editbox;                                     // 0x1688(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      Gamma2Editbox;                                     // 0x1690(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  GammaSlider;                                       // 0x1698(0x8)(Edit, ZeroConstructor)
	class UWidgetSwitcher*                       GeneralOptionSwitcher;                             // 0x16A0(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       GiveDefaultWeapon;                                 // 0x16A8(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       GlobalIlluminationQuality;                         // 0x16B0(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       GraphicsQualityComboBox;                           // 0x16B8(0x8)(Edit, ZeroConstructor)
	class UBorder*                               GraphicsQualityHelpTooltip;                        // 0x16C0(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  GroundClutterDensitySlider;                        // 0x16C8(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  GroundClutterDistanceSlider;                       // 0x16D0(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       GroupAddOrRemoveTame;                              // 0x16D8(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  GUI3DWidgetQuality;                                // 0x16E0(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   HDRandOcio;                                        // 0x16E8(0x8)(Edit, ZeroConstructor)
	class USizeBox*                              HDRSizeBoxButton;                                  // 0x16F0(0x8)(Edit, ZeroConstructor)
	class UASAUIWidget_HorizontalListSelector_Main_Style1_C* Header_GridPanel;                                  // 0x16F8(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      HeightTextBox;                                     // 0x1700(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* HideCrosshairWhileBuilding;                        // 0x1708(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* HideFloatingPlayerNamesCheckbox;                   // 0x1710(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* HideGamepadItemSelectionModifierCheckbox;          // 0x1718(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* HideServerInfoCheckbox;                            // 0x1720(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* HighQualityAnisotropicFilteringCheckbox;           // 0x1728(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* HighQualityLODsCheckbox;                           // 0x1730(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* HighQualityMaterialsCheckbox;                      // 0x1738(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* HighQualitySurfacesCheckbox;                       // 0x1740(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* HighQualityVFXCheckbox;                            // 0x1748(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_ColorPicker_Widget_ASA_C* HitMarkerColor;                                    // 0x1750(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image;                                             // 0x1758(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_1;                                           // 0x1760(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_8;                                           // 0x1768(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_11;                                          // 0x1770(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_16;                                          // 0x1778(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_17;                                          // 0x1780(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_18;                                          // 0x1788(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_19;                                          // 0x1790(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_54;                                          // 0x1798(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_55;                                          // 0x17A0(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_58;                                          // 0x17A8(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_65;                                          // 0x17B0(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_66;                                          // 0x17B8(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_92;                                          // 0x17C0(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_151;                                         // 0x17C8(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_241;                                         // 0x17D0(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_242;                                         // 0x17D8(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_256;                                         // 0x17E0(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_265;                                         // 0x17E8(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_269;                                         // 0x17F0(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_536;                                         // 0x17F8(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_537;                                         // 0x1800(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_609;                                         // 0x1808(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_921;                                         // 0x1810(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_922;                                         // 0x1818(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_962;                                         // 0x1820(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_1585;                                        // 0x1828(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_2015;                                        // 0x1830(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* InventoryAccessSoundCheckbox;                      // 0x1838(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* InvertMouse;                                       // 0x1840(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       IssueOrder;                                        // 0x1848(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       ItemNotificationSetting;                           // 0x1850(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* JoinNotificationsCheckbox;                         // 0x1858(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       Jump;                                              // 0x1860(0x8)(Edit, ZeroConstructor)
	class UBorder*                               KbmPanel;                                          // 0x1868(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   KeyBindingsMenuButton;                             // 0x1870(0x8)(Edit, ZeroConstructor)
	class UImage*                                LeftBumperButton;                                  // 0x1878(0x8)(Edit, ZeroConstructor)
	class UImage*                                LeftSpecialButton;                                 // 0x1880(0x8)(Edit, ZeroConstructor)
	class UImage*                                LeftTriggerButton;                                 // 0x1888(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  LODScalarSlider;                                   // 0x1890(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       LookDown;                                          // 0x1898(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  LookLeftRightSensitivitySlider;                    // 0x18A0(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       LookUp;                                            // 0x18A8(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  LookUpDownSensitivitySlider;                       // 0x18B0(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* LowOpacityCheckBox;                                // 0x18B8(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  MaxLastDeathMark;                                  // 0x18C0(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  MaxSpeedStructureTooltip;                          // 0x18C8(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* MeleeCameraSwingAnimsCheckbox;                     // 0x18D0(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* MinimalFloatingNameSetting;                        // 0x18D8(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   ModShopButton;                                     // 0x18E0(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* MotionBlurCheckbox;                                // 0x18E8(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* MotionBlurCheckboxConsole;                         // 0x18F0(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       MoveBackward;                                      // 0x18F8(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       MoveForward;                                       // 0x1900(0x8)(Edit, ZeroConstructor)
	class UImage*                                MovementImage;                                     // 0x1908(0x8)(Edit, ZeroConstructor)
	class UImage*                                MovementImagePS5;                                  // 0x1910(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            MovementText;                                      // 0x1918(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            MovementTextPS5;                                   // 0x1920(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  MusicSlider;                                       // 0x1928(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* NoTooltipDelayCheckbox;                            // 0x1930(0x8)(Edit, ZeroConstructor)
	class UCanvasPanel*                          NvidiaPanel;                                       // 0x1938(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       OpenMapMarkers;                                    // 0x1940(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   OptionsMenuButton;                                 // 0x1948(0x8)(Edit, ZeroConstructor)
	class UCanvasPanel*                          OptionsPanel;                                      // 0x1950(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       OrbitCam;                                          // 0x1958(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       OrbitCamToggle;                                    // 0x1960(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       Ping;                                              // 0x1968(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* PlayActionWheelClickSoundCheckbox;                 // 0x1970(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       PlayerTooltipSetting;                              // 0x1978(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* PlayHUDRolloverSoundCheckbox;                      // 0x1980(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       Poop;                                              // 0x1988(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       PostProcessingComboBox;                            // 0x1990(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       Prone;                                             // 0x1998(0x8)(Edit, ZeroConstructor)
	class UImage*                                PS4GamepadImage;                                   // 0x19A0(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       PushToTalk;                                        // 0x19A8(0x8)(Edit, ZeroConstructor)
	class UImage*                                QuickSlotsImage;                                   // 0x19B0(0x8)(Edit, ZeroConstructor)
	class UImage*                                QuickSlotsImagePs5;                                // 0x19B8(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            QuickSlotsText;                                    // 0x19C0(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            QuickSlotsTextPS5;                                 // 0x19C8(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* QuickToggleItemNamesCheckbox;                      // 0x19D0(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       RayReconstructionCombo;                            // 0x19D8(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       Reload;                                            // 0x19E0(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   RepositionHMDViewButton;                           // 0x19E8(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   ResetAudio;                                        // 0x19F0(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   ResetButton;                                       // 0x19F8(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   ResetCameraLateralOffset;                          // 0x1A00(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   ResetCrosshairSizeButton;                          // 0x1A08(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   ResetGraphics;                                     // 0x1A10(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   ResetIntroCinematicsButton;                        // 0x1A18(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   ResetKeybinding;                                   // 0x1A20(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   ResetOptions;                                      // 0x1A28(0x8)(Edit, ZeroConstructor)
	class UButton*                               ResetTutorials;                                    // 0x1A30(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  ResolutionScaleSlider;                             // 0x1A38(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       ResolutionsComboBox;                               // 0x1A40(0x8)(Edit, ZeroConstructor)
	class UImage*                                RightBumperButton;                                 // 0x1A48(0x8)(Edit, ZeroConstructor)
	class UImage*                                RightSpecialButton;                                // 0x1A50(0x8)(Edit, ZeroConstructor)
	class UImage*                                RightThumbstick;                                   // 0x1A58(0x8)(Edit, ZeroConstructor)
	class UImage*                                RightTriggerButton;                                // 0x1A60(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   RTSMenuButton;                                     // 0x1A68(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            RtxTooltip;                                        // 0x1A70(0x8)(Edit, ZeroConstructor)
	class USizeBox*                              RtxTooltipRoot;                                    // 0x1A78(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       Run;                                               // 0x1A80(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       RunToggle;                                         // 0x1A88(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   SaveButton;                                        // 0x1A90(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       SelectUnit;                                        // 0x1A98(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       SetGamma1;                                         // 0x1AA0(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       SetGamma2;                                         // 0x1AA8(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  SFXSlider;                                         // 0x1AB0(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       ShadowsComboBox;                                   // 0x1AB8(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* ShowChatCheckbox;                                  // 0x1AC0(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       ShowExtendedInfo;                                  // 0x1AC8(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       ShowLocalChat;                                     // 0x1AD0(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       ShowMyCraftables;                                  // 0x1AD8(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       ShowMyInventory;                                   // 0x1AE0(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       ShowTribeChat;                                     // 0x1AE8(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       ShowTribeManager;                                  // 0x1AF0(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* SimpleDistanceMovementCheckbox;                    // 0x1AF8(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       SlowMovement;                                      // 0x1B00(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* SSAOCheckbox;                                      // 0x1B08(0x8)(Edit, ZeroConstructor)
	class UImage*                                StadiaGamepadImage;                                // 0x1B10(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* StatusNotificationMessagesCheckbox;                // 0x1B18(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* StopExplorerNoteAudioOnCloseCheckBox;              // 0x1B20(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       StrafeLeft;                                        // 0x1B28(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       StrafeRight;                                       // 0x1B30(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       StructureTooltipSetting;                           // 0x1B38(0x8)(Edit, ZeroConstructor)
	class UASAUIWidget_HorizontalListSelector_Sub_Style4_C* Submenu_Header;                                    // 0x1B40(0x8)(Edit, ZeroConstructor)
	class UWidgetSwitcher*                       Submenu_Options;                                   // 0x1B48(0x8)(Edit, ZeroConstructor)
	class UWidgetSwitcher*                       SubMenuSwitcher;                                   // 0x1B50(0x8)(Edit, ZeroConstructor)
	class USizeBox*                              SuperResolution;                                   // 0x1B58(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       SuperResolutionNvidiaCombo;                        // 0x1B60(0x8)(Edit, ZeroConstructor)
	class UImage*                                SwitchGamepadImage;                                // 0x1B68(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       Targeting;                                         // 0x1B70(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* TemperatureFCheckbox;                              // 0x1B78(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       TerrainShadowComboBox;                             // 0x1B80(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            TextBlock_27;                                      // 0x1B88(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            TextBlock_501;                                     // 0x1B90(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            TextBlock_669;                                     // 0x1B98(0x8)(Edit, ZeroConstructor)
	class UDataListButton_Widget_ASA_C*          TextChatFilter;                                    // 0x1BA0(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       TextChatFilterComboBox;                            // 0x1BA8(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       TexturesComboBox;                                  // 0x1BB0(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       ToggleAutoChat;                                    // 0x1BB8(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       ToggleConsole;                                     // 0x1BC0(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* ToggleExtendedHUDInfoCheckbox;                     // 0x1BC8(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* ToggleFluidInteractionCheckbox;                    // 0x1BD0(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       ToggleHUDHidden;                                   // 0x1BD8(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       ToggleMap;                                         // 0x1BE0(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       ToggleRTS;                                         // 0x1BE8(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* ToggleToTalkCheckBox;                              // 0x1BF0(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       TopNotificationSetting;                            // 0x1BF8(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  TPVCameraHorizontalOffsetFactorSlider;             // 0x1C00(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  TrueSkyQualitySlider;                              // 0x1C08(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       TurnLeft;                                          // 0x1C10(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       TurnRight;                                         // 0x1C18(0x8)(Edit, ZeroConstructor)
	class UBorder*                               UIBox;                                             // 0x1C20(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  UIQuickbarScalingSlider;                           // 0x1C28(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* UIVibrationCheckbox;                               // 0x1C30(0x8)(Edit, ZeroConstructor)
	class UCustomButtonWidget*                   UnBlockAllModsButton;                              // 0x1C38(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       Use;                                               // 0x1C40(0x8)(Edit, ZeroConstructor)
	class UCheckBox*                             UseAutoDetectSettingsCheckbox;                     // 0x1C48(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* UseDFAOCheckbox;                                   // 0x1C50(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* UseFrameGeneration;                                // 0x1C58(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       UseGamepadAimAssist;                               // 0x1C60(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* UseGamepadSpeakerCheckbox;                         // 0x1C68(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       UseItem1;                                          // 0x1C70(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       UseItem10;                                         // 0x1C78(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       UseItem2;                                          // 0x1C80(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       UseItem3;                                          // 0x1C88(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       UseItem4;                                          // 0x1C90(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       UseItem5;                                          // 0x1C98(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       UseItem6;                                          // 0x1CA0(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       UseItem7;                                          // 0x1CA8(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       UseItem8;                                          // 0x1CB0(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       UseItem9;                                          // 0x1CB8(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* UseLowQualityFarLevelStreamingCheckbox;            // 0x1CC0(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* UseNvidiaDlss;                                     // 0x1CC8(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* UseNvidiaReflexLowLatency;                         // 0x1CD0(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Bool_Widget_ASA_C* VibrationCheckbox;                                 // 0x1CD8(0x8)(Edit, ZeroConstructor)
	class UBorder*                               VideoBox;                                          // 0x1CE0(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       ViewDistanceComboBox;                              // 0x1CE8(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       VoiceChatFilterComboBox;                           // 0x1CF0(0x8)(Edit, ZeroConstructor)
	class UDataListButtonVariable_Widget_ASA_C*  VoiceSlider;                                       // 0x1CF8(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       WeaponAccessory;                                   // 0x1D00(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       Whisper;                                           // 0x1D08(0x8)(Edit, ZeroConstructor)
	class UEditableTextBox*                      WidthTextBox;                                      // 0x1D10(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       WindowModeComboBox;                                // 0x1D18(0x8)(Edit, ZeroConstructor)
	class UComboBoxString*                       WorldTileBufferComboBox;                           // 0x1D20(0x8)(Edit, ZeroConstructor)
	class UImage*                                XBoxGamepadImage;                                  // 0x1D28(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       Yell;                                              // 0x1D30(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       ZoomIn;                                            // 0x1D38(0x8)(Edit, ZeroConstructor)
	class UKeyInputWidget*                       ZoomOut;                                           // 0x1D40(0x8)(Edit, ZeroConstructor)
	bool                                         GraphicsToolTipIsVisible;                          // 0x1D48(0x1)(None)
	uint8                                        Pad_4C17[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            GamepadControlsBGWindows;                          // 0x1D50(0x8)(Edit, ZeroConstructor)
	class UTexture2D*                            GamepadControlsBGXbox;                             // 0x1D58(0x8)(Edit, ZeroConstructor)
	class UTexture2D*                            GamepadControlsBGPlayStation;                      // 0x1D60(0x8)(Edit, ZeroConstructor)
	class UClass*                                VisualSettingsTemplate;                            // 0x1D68(0x8)(ZeroConstructor)

	static class UClass* StaticClass();
	static class UOptionsMenu_C* GetDefaultObj();

	void Get_ChangesText_1_Visibility(enum class ESlateVisibility ReturnValue, int32 CallFunc_GetSelectedIndex_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue);
	void Get_ChangesText_1_bIsEnabled(bool ReturnValue);
	void Get_ResetOptions_Visibility(enum class ESlateVisibility ReturnValue, class UWidget* CallFunc_GetActiveWidget_ReturnValue, int32 CallFunc_GetActiveWidgetIndex_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, int32 CallFunc_GetActiveWidgetIndex_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue_1);
