#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x60 (0x90 - 0x30)
// BlueprintGeneratedClass PDA_FoleyCollection.PDA_FoleyCollection_C
class UPDA_FoleyCollection_C : public UPrimaryDataAsset
{
public:
	class USoundBase*                            Generic_short;                                     // 0x30(0x8)(ZeroConstructor)
	class USoundBase*                            Greneric_quick;                                    // 0x38(0x8)(ZeroConstructor)
	class USoundBase*                            Generic_medium;                                    // 0x40(0x8)(ZeroConstructor)
	class USoundBase*                            Climb;                                             // 0x48(0x8)(ZeroConstructor)
	class USoundBase*                            Jump;                                              // 0x50(0x8)(ZeroConstructor)
	class USoundBase*                            Land;                                              // 0x58(0x8)(ZeroConstructor)
	class USoundBase*                            Pullback;                                          // 0x60(0x8)(ZeroConstructor)
	class USoundBase*                            Sprint;                                            // 0x68(0x8)(ZeroConstructor)
	class USoundBase*                            Stab;                                              // 0x70(0x8)(ZeroConstructor)
	class USoundBase*                            Swing;                                             // 0x78(0x8)(ZeroConstructor)
	class USoundBase*                            Turn;                                              // 0x80(0x8)(ZeroConstructor)
	class USoundBase*                            Walk;                                              // 0x88(0x8)(ZeroConstructor)

	static class UClass* StaticClass();
	static class UPDA_FoleyCollection_C* GetDefaultObj();

};

}


