#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x1B1 (0x2AA1 - 0x28F0)
// BlueprintGeneratedClass PlayerPawnTest.PlayerPawnTest_C
class APlayerPawnTest_C : public AShooterCharacter
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x28F0(0x8)(ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, BlueprintAuthorityOnly, TextExportTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	class USkeletalMeshComponent*                SecondaryImplantTPVSkeletalMesh;                   // 0x28F8(0x8)(Edit, ZeroConstructor)
	class USkeletalMeshComponent*                ImplantTPVSkeletalMesh;                            // 0x2900(0x8)(Edit, ZeroConstructor)
	class UBP_PrimalWindSourceComponent_Base_C*  BP_PrimalWindSourceComponent_Base_RightFoot_FI;    // 0x2908(0x8)(Edit, ZeroConstructor)
	class UBP_PrimalWindSourceComponent_Base_C*  BP_PrimalWindSourceComponent_Base_LeftFoot_FI;     // 0x2910(0x8)(Edit, ZeroConstructor)
	class UBP_PrimalWindSourceComponent_Base_C*  BP_PrimalWindSourceComponent_Base_Torso_FI;        // 0x2918(0x8)(Edit, ZeroConstructor)
	class UBP_PrimalWindSourceComponent_Base_C*  BP_PrimalWindSourceComponent_Base_RightFoot;       // 0x2920(0x8)(Edit, ZeroConstructor)
	class UBP_PrimalWindSourceComponent_Base_C*  BP_PrimalWindSourceComponent_Base_LeftFoot;        // 0x2928(0x8)(Edit, ZeroConstructor)
	class UBP_PrimalWindSourceComponent_Base_C*  BP_PrimalWindSourceComponent_Base_RightArm;        // 0x2930(0x8)(Edit, ZeroConstructor)
	class UBP_PrimalWindSourceComponent_Base_C*  BP_PrimalWindSourceComponent_Base1_Head;           // 0x2938(0x8)(Edit, ZeroConstructor)
	class UBP_PrimalWindSourceComponent_Base_C*  BP_PrimalWindSourceComponent_Base1_LeftArm;        // 0x2940(0x8)(Edit, ZeroConstructor)
	class UBP_PrimalWindSourceComponent_Base_C*  BP_PrimalWindSourceComponent_Base_Torso;           // 0x2948(0x8)(Edit, ZeroConstructor)
	class UNS_DinoFootprint_BP_C*                NS_DinoFootprint_BP;                               // 0x2950(0x8)(Edit, ZeroConstructor)
	class UBP_PrimalWindSourceComponent_Base_C*  BP_PrimalWindSourceComponent_Base_HandR_FPV;       // 0x2958(0x8)(Edit, ZeroConstructor)
	class UBP_PrimalWindSourceComponent_Base_C*  BP_PrimalWindSourceComponent_Base_HandL_FPV;       // 0x2960(0x8)(Edit, ZeroConstructor)
	class UBP_PrimalWindSourceComponent_Base_C*  BP_PrimalWindSourceComponent_Base_TorsoFPV;        // 0x2968(0x8)(Edit, ZeroConstructor)
	class USkeletalMeshComponent*                SecondaryMesh1P;                                   // 0x2970(0x8)(Edit, ZeroConstructor)
	class USphereComponent*                      StasisComponent;                                   // 0x2978(0x8)(Edit, ZeroConstructor)
	class UPrimalInventoryComponent*             PrimalInventory1;                                  // 0x2980(0x8)(ZeroConstructor)
	int32                                        NumAscensions;                                     // 0x2988(0x4)(None)
	uint8                                        Pad_42F0[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TSoftObjectPtr<class USkeletalMesh>>  AscensionMeshesFPV;                                // 0x2990(0x10)(ZeroConstructor, AssetRegistrySearchable, AdvancedDisplay, BlueprintAuthorityOnly, TextExportTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<TSoftObjectPtr<class UStaticMesh>>    AscensionMeshesTPV;                                // 0x29A0(0x10)(ZeroConstructor, AutoWeak, AdvancedDisplay, BlueprintAuthorityOnly, TextExportTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<class UClass*>                        AlphaAscensionEngrams;                             // 0x29B0(0x10)(ZeroConstructor, AssetRegistrySearchable, SimpleDisplay, BlueprintAuthorityOnly, TextExportTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	int32                                        NumAscensionsAb;                                   // 0x29C0(0x4)(None)
	uint8                                        Pad_42F3[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TSoftObjectPtr<class UStaticMesh>>    AscensionMeshesTPV_Ab;                             // 0x29C8(0x10)(ZeroConstructor, ContainsInstancedReference, SimpleDisplay, BlueprintAuthorityOnly, TextExportTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<TSoftObjectPtr<class USkeletalMesh>>  AscensionMeshesFPV_Ab;                             // 0x29D8(0x10)(ZeroConstructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, BlueprintAuthorityOnly, TextExportTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	class FName                                  TestAscensionBossNameTag;                          // 0x29E8(0x8)(None)
	TArray<TSoftObjectPtr<class UStaticMesh>>    AscensionMeshesTPV_Ext;                            // 0x29F0(0x10)(ZeroConstructor, AutoWeak, AssetRegistrySearchable, BlueprintAuthorityOnly, TextExportTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<TSoftObjectPtr<class USkeletalMesh>>  AscensionMeshesFPV_Ext;                            // 0x2A00(0x10)(Edit, ZeroConstructor, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, NonPIEDuplicateTransient, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NumAscensionsExt;                                  // 0x2A10(0x4)(None)
	uint8                                        Pad_42F4[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                CurrentDome;                                       // 0x2A18(0x8)(ZeroConstructor)
	class FString                                Current_Cruise_Missile_Message;                    // 0x2A20(0x10)(ContainsInstancedReference, BlueprintAuthorityOnly, TextExportTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	int32                                        NumChibiLevelUps;                                  // 0x2A30(0x4)(None)
	int32                                        NumAscensionsGenesis;                              // 0x2A34(0x4)(None)
	int32                                        NumAscensionsGen2;                                 // 0x2A38(0x4)(None)
	bool                                         bUnlockedAllExplorerNotes;                         // 0x2A3C(0x1)(None)
	bool                                         bHasSetupMeshes;                                   // 0x2A3D(0x1)(None)
	uint8                                        Pad_42F6[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<int32>                                RestrictedLevelsBasedOnUnobtainedGeneralizedAchievementTags; // 0x2A40(0x10)(BlueprintAuthorityOnly, TextExportTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<class FName>                          GeneralizedUnlockedAchievementTags;                // 0x2A50(0x10)(AutoWeak, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, TextExportTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	int32                                        NumAscensionsScorched;                             // 0x2A60(0x4)(None)
	uint8                                        Pad_42F7[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TSoftObjectPtr<class USkeletalMesh>>  AscensionSkeletalMeshesTPV;                        // 0x2A68(0x10)(ZeroConstructor, AutoWeak, ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, TextExportTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<TSoftObjectPtr<class USkeletalMesh>>  AscensionSkeletalMeshesTPV_Ext;                    // 0x2A78(0x10)(ZeroConstructor, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, TextExportTransient, PersistentInstance, NativeAccessSpecifierPublic, NativeAccessSpecifierPrivate)
	TArray<TSoftObjectPtr<class USkeletalMesh>>  AscensionSkeletalMeshesTPV_AB;                     // 0x2A88(0x10)(ZeroConstructor)
	bool                                         bIsCheatAscending;                                 // 0x2A98(0x1)(None)
	uint8                                        Pad_42F8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        LastAscendIndex;                                   // 0x2A9C(0x4)(None)
	bool                                         bLastAscendWasImmediate;                           // 0x2AA0(0x1)(None)

	static class UClass* StaticClass();
	static class APlayerPawnTest_C* GetDefaultObj();

	void BPOverrideCameraDesiredPivotLocation(const struct FVector& CurrentCameraPivotLocation, const struct FVector& DesiredCameraPivotLocation, bool ReturnValue);
	void GetFXBloodColor(const struct FLinearColor& ReturnValue);
	void DisableFluidInteraction();
	void EnableFluidInteraction();
	void AssignAssetsFromVoiceCollection(class UPDA_VoiceCollection_C* K2Node_DynamicCast_AsPDA_Voice_Collection, bool K2Node_DynamicCast_bSuccess);
	void BPOverrideCameraDesiredPivotRotation(const struct FRotator& CurrentCameraPivotRotation, const struct FRotator& DesiredCameraPivotRotation, bool ReturnValue, float CallFunc_BreakRotator_Roll, float CallFunc_BreakRotator_Pitch, float CallFunc_BreakRotator_Yaw, const struct FRotator& CallFunc_MakeRotator_ReturnValue);
	void BPOverrideCameraDesiredPivotOffset(const struct FPrimalCameraParams& CameraParams, const struct FVector& DesiredCameraOffset, bool ReturnValue);
	void BPOverrideCameraPivotLocationInterpParams(const struct FPrimalCameraParams& CameraParams, const struct FPrimalCameraPivotZInterpOverrides& PivotZInterpOverrides, const struct FPrimalCameraInterpParams& LastInterpParamsX, const struct FPrimalCameraInterpParams& LastInterpParamsY, const struct FPrimalCameraInterpParams& LastInterpParamsZ, const struct FPrimalCameraInterpParams& OutInterpParamsX, const struct FPrimalCameraInterpParams& OutInterpParamsY, const struct FPrimalCameraInterpParams& OutInterpParamsZ, bool ReturnValue);
	void BPOverrideCameraArmLengthInterpParams(const struct FPrimalCameraParams& CameraParams, const struct FPrimalCameraInterpParams& OutInterpParams, bool ReturnValue);
	void BPOverrideCameraArmLength(const struct FPrimalCameraParams& CameraParams, float CurrentCameraArmLength, float DesiredCameraArmLength, bool ReturnValue, double CallFunc_FinalOverrideCameraArmLength_CurrentCameraArmLength_ImplicitCast, double CallFunc_FinalOverrideCameraArmLength_DesiredCameraArmLength_ImplicitCast);
	void DontCreateAnyMoreSpawnUIs(class AShooterHUD* CallFunc_GetShooterHud_ShooterHud, bool CallFunc_IsValid_ReturnValue);
	void GetShooterHud(class AShooterHUD* ShooterHUD, class AController* CallFunc_GetController_ReturnValue, class AShooterPlayerController* K2Node_DynamicCast_AsShooter_Player_Controller, bool K2Node_DynamicCast_bSuccess, class AShooterHUD* CallFunc_GetShooterHUD_ReturnValue);
	void SetGeneralizedUnlockedAchievementTags(const TArray<class FName>& GeneralizedUnlockedAchievementTags);
	void HasEquipToHideImplant(bool ShouldHideImplant, bool Local_HideImplant, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, bool Temp_bool_True_if_break_was_hit_Variable, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UPrimalItem* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_EqualEqual_NameName_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_EqualEqual_NameName_ReturnValue_1);
	void BPSetupFirstPersonHandsMesh();
	void SetupMeshes(bool bForce, int32 CallFunc_GetNumMaterials_ReturnValue, TSoftObjectPtr<class USkeletalMesh> CallFunc_Array_Get_Item, int32 CallFunc_Subtract_IntInt_ReturnValue, class USkeletalMesh* CallFunc_AssetResolve_ReturnValue, bool CallFunc_IsValid_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Variable, bool CallFunc_Greater_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Greater_IntInt_ReturnValue_1, TSoftObjectPtr<class USkeletalMesh> CallFunc_Array_Get_Item_1, class USkeletalMesh* CallFunc_AssetResolve_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_1, class UMaterialInterface* CallFunc_GetMaterial_ReturnValue, int32 CallFunc_GetNumMaterials_ReturnValue_1, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue_1, bool CallFunc_LessEqual_IntInt_ReturnValue, int32 Temp_int_Variable_1, int32 CallFunc_Array_Length_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue_1, bool CallFunc_Greater_IntInt_ReturnValue_2, int32 CallFunc_GetNumMaterials_ReturnValue_2, int32 CallFunc_Subtract_IntInt_ReturnValue_2, int32 Temp_int_Variable_2, class UMaterialInterface* CallFunc_GetMaterial_ReturnValue_1, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_1, bool CallFunc_LessEqual_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 Temp_int_Variable_3, int32 CallFunc_Add_IntInt_ReturnValue_3, int32 Temp_int_Variable_4, TSoftObjectPtr<class USkeletalMesh> CallFunc_Array_Get_Item_2, class USkeletalMesh* CallFunc_AssetResolve_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue_4, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_HasEquipToHideImplant_ShouldHideImplant, class UWorld* CallFunc_K2_GetWorld_ReturnValue, class FName CallFunc_GetObjectName_ReturnValue, TSoftObjectPtr<class USkeletalMesh> CallFunc_Array_Get_Item_3, bool CallFunc_EqualEqual_NameName_ReturnValue, class USkeletalMesh* CallFunc_AssetResolve_ReturnValue_3, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue_3, class UMaterialInterface* CallFunc_GetMaterial_ReturnValue_2, int32 CallFunc_GetNumMaterials_ReturnValue_3, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_2, int32 CallFunc_Subtract_IntInt_ReturnValue_3, bool CallFunc_LessEqual_IntInt_ReturnValue_2, bool CallFunc_Greater_IntInt_ReturnValue_4, int32 CallFunc_Array_Length_ReturnValue_3, bool CallFunc_Greater_IntInt_ReturnValue_5, class UMaterialInterface* CallFunc_GetMaterial_ReturnValue_3, int32 CallFunc_GetNumMaterials_ReturnValue_4, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_3, int32 CallFunc_Subtract_IntInt_ReturnValue_4, bool CallFunc_LessEqual_IntInt_ReturnValue_3, int32 CallFunc_Array_Length_ReturnValue_4, bool CallFunc_Greater_IntInt_ReturnValue_6, TSoftObjectPtr<class USkeletalMesh> CallFunc_Array_Get_Item_4, class USkeletalMesh* CallFunc_AssetResolve_ReturnValue_4, bool CallFunc_IsValid_ReturnValue_3, int32 Temp_int_Variable_5, class UMaterialInterface* CallFunc_GetMaterial_ReturnValue_4, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_4, bool CallFunc_LessEqual_IntInt_ReturnValue_4, int32 CallFunc_Add_IntInt_ReturnValue_5, TSoftObjectPtr<class USkeletalMesh> CallFunc_Array_Get_Item_5, class UMaterialInterface* CallFunc_GetMaterial_ReturnValue_5, class USkeletalMesh* CallFunc_AssetResolve_ReturnValue_5, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_5, bool CallFunc_IsValid_ReturnValue_4, int32 CallFunc_GetNumMaterials_ReturnValue_5, int32 CallFunc_Subtract_IntInt_ReturnValue_5, bool CallFunc_LessEqual_IntInt_ReturnValue_5);
	void BPUnlockedAllExplorerNotes(bool CallFunc_EqualEqual_BoolBool_ReturnValue);
	void GetTheNumChibiLevelUps(int32 OutVal);
	void SetNumChibiLevelUps(int32 NewNum, bool CallFunc_EqualEqual_IntInt_ReturnValue);
	void BPGetPlayerHexagonCount(int32 ReturnValue, int32 Ret_val, const class FString& CallFunc_LinkedPlayerIDString_ReturnValue, class AGameModeBase* CallFunc_GetGameMode_ReturnValue, enum class ENetworkModeResult CallFunc_IsRunningOnServer_OutNetworkMode, class AShooterGameMode* K2Node_DynamicCast_AsShooter_Game_Mode, bool K2Node_DynamicCast_bSuccess, bool K2Node_SwitchEnum_CmpSuccess, class UPrimalPlayerData* CallFunc_GetPlayerData_ReturnValue, class UPrimalPlayerDataBP_Base_C* K2Node_DynamicCast_AsPrimal_Player_Data_BP_Base, bool K2Node_DynamicCast_bSuccess_1);
	void BPSetPlayerHexagonCount(int32 NewHexagonCount, bool ReturnValue, bool Ret_val, class UWorld* CallFunc_K2_GetWorld_ReturnValue, bool CallFunc_IsValid_ReturnValue, const class FString& CallFunc_LinkedPlayerIDString_ReturnValue, class AGameModeBase* CallFunc_GetGameMode_ReturnValue, class AShooterGameMode* K2Node_DynamicCast_AsShooter_Game_Mode, bool K2Node_DynamicCast_bSuccess, class UPrimalPlayerData* CallFunc_GetPlayerData_ReturnValue, enum class ENetworkModeResult CallFunc_IsRunningOnServer_OutNetworkMode, class UPrimalPlayerDataBP_Base_C* K2Node_DynamicCast_AsPrimal_Player_Data_BP_Base, bool K2Node_DynamicCast_bSuccess_1, bool K2Node_SwitchEnum_CmpSuccess);
	void BPGetShowDebugAnimationComponents(const TArray<class USkeletalMeshComponent*>& SkelMeshComponents, const TArray<class USkeletalMeshComponent*>& Comps, bool Temp_bool_Variable, bool CallFunc_IsFirstPerson_ReturnValue, bool CallFunc_IsFirstPerson_ReturnValue_1, int32 CallFunc_Array_Add_ReturnValue, int32 CallFunc_Array_Add_ReturnValue_1, class AShooterWeapon* CallFunc_GetWeapon_ReturnValue, int32 CallFunc_Array_Add_ReturnValue_2, bool CallFunc_IsValid_ReturnValue, class USkeletalMeshComponent* K2Node_Select_Default, int32 CallFunc_Array_Add_ReturnValue_3);
	void BPGetOverrideCameraInterpSpeed(float DefaultTPVCameraSpeedInterpolationMultiplier, float DefaultTPVOffsetInterpSpeed, float TPVCameraSpeedInterpolationMultiplier, float TPVOffsetInterpSpeed, double LocalDefaultTPVOffsetInterpSpeed, bool CallFunc_HasBuff_ReturnValue, double K2Node_VariableSet_LocalDefaultTPVOffsetInterpSpeed_ImplicitCast, float K2Node_FunctionResult_TPVOffsetInterpSpeed_ImplicitCast);
	void ShowHUDNotification(const class FString& Text, const struct FLinearColor& Color, double LifetimeSeconds, double DisplayScale, class USoundCue* SoundToPlay);
	void TrySpawnMound();
	void TrySpawnMoundEx(double Angle, double Range);
	void BPSetFirstPersonMasterPoseComponent(class USkeletalMeshComponent* FirstPersonMasterPosecomponent);
	void DefeatedBoss(class APrimalDinoCharacter* BossCharacter, class FName BossTag, int32 BossDifficulty, class AController* CallFunc_GetController_ReturnValue, class UWorld* CallFunc_K2_GetWorld_ReturnValue, class AShooterPlayerController* K2Node_DynamicCast_AsShooter_Player_Controller, bool K2Node_DynamicCast_bSuccess, const class FString& CallFunc_LinkedPlayerIDString_ReturnValue, class AGameModeBase* CallFunc_GetGameMode_ReturnValue, class AShooterGameMode* K2Node_DynamicCast_AsShooter_Game_Mode, bool K2Node_DynamicCast_bSuccess_1, class UPrimalPlayerData* CallFunc_GetPlayerData_ReturnValue, class UPrimalPlayerDataBP_Base_C* K2Node_DynamicCast_AsPrimal_Player_Data_BP_Base, bool K2Node_DynamicCast_bSuccess_2);
	void ServerAscend(int32 DifficultyIndex, bool bImmediateAscend, bool bSuppressAchievements, bool bIsCheatAscend, int32 Temp_int_Array_Index_Variable, bool CallFunc_GreaterEqual_IntInt_ReturnValue, bool CallFunc_IsListenServer_ReturnValue, const struct FRotator& CallFunc_K2_GetActorRotation_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_K2_TeleportTo_ReturnValue, const class FString& Temp_string_Variable, bool K2Node_SwitchName_CmpSuccess, const class FString& Temp_string_Variable_1, const class FString& Temp_string_Variable_2, int32 Temp_int_Variable, int32 Temp_int_Loop_Counter_Variable, const class FString& K2Node_Select_Default, int32 CallFunc_Add_IntInt_ReturnValue, class AController* CallFunc_GetCharacterController_ReturnValue, class UWorld* CallFunc_GetPrimaryWorld_ReturnValue, class AShooterPlayerController* K2Node_DynamicCast_AsShooter_Player_Controller, bool K2Node_DynamicCast_bSuccess, class AWorldSettings* CallFunc_GetWorldSettings_ReturnValue, class APrimalWorldSettings* K2Node_DynamicCast_AsPrimal_World_Settings, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_IsValid_ReturnValue, bool CallFunc_GreaterEqual_IntInt_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, class UClass* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, class AShooterPlayerState* K2Node_DynamicCast_AsShooter_Player_State, bool K2Node_DynamicCast_bSuccess_2, const struct FRotator& CallFunc_K2_GetActorRotation_ReturnValue_1, class AGameModeBase* CallFunc_GetGameMode_ReturnValue, class AGameModeBase* CallFunc_GetGameMode_ReturnValue_1, class AShooterGameMode* K2Node_DynamicCast_AsShooter_Game_Mode, bool K2Node_DynamicCast_bSuccess_3, class AShooterGameMode* K2Node_DynamicCast_AsShooter_Game_Mode_1, bool K2Node_DynamicCast_bSuccess_4, float CallFunc_GetServerSettingsFloat_OutFloat, bool CallFunc_GetServerSettingsFloat_ReturnValue, float CallFunc_GetServerSettingsFloat_OutFloat_1, bool CallFunc_GetServerSettingsFloat_ReturnValue_1, float CallFunc_GetServerSettingsFloat_OutFloat_2, bool CallFunc_GetServerSettingsFloat_ReturnValue_2, const class FString& CallFunc_LinkedPlayerIDString_ReturnValue, class UPrimalPlayerData* CallFunc_GetPlayerData_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue, class UPrimalPlayerDataBP_Base_C* K2Node_DynamicCast_AsPrimal_Player_Data_BP_Base, bool K2Node_DynamicCast_bSuccess_5, bool CallFunc_K2_TeleportTo_ReturnValue_1, class AController* CallFunc_GetController_ReturnValue, class UWorld* CallFunc_K2_GetWorld_ReturnValue, class AShooterPlayerController* K2Node_DynamicCast_AsShooter_Player_Controller_1, bool K2Node_DynamicCast_bSuccess_6, bool CallFunc_IsLocalController_ReturnValue, double CallFunc_MakeVector_Z_ImplicitCast, double CallFunc_MakeVector_Y_ImplicitCast, double CallFunc_MakeVector_X_ImplicitCast);
	void PlayerCommand(const class FString& TheCommand, const class FString& ReturnValue, const class FString& RetVal, const class FString& CallFunc_PlayerCommand_ReturnValue, bool K2Node_SwitchString_CmpSuccess);
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void NetClientAscend(int32 AscendIndex, bool bImmediateAscend, bool bIsCheatAscend);
	void ClientShowHUDNotification(const class FString& Text, const struct FLinearColor& Color, double LifetimeSeconds, double DisplayScale, class USoundCue* SoundToPlay);
	void NetClientPreLoadAcension();
	void BPSpawnAttackerDamageImpactFX(class FName SocketName, class APrimalCharacter* VictimChar);
	void AscensionCheck();
	void ExecuteUbergraph_PlayerPawnTest(int32 EntryPoint, bool Temp_bool_Variable, bool CallFunc_IsDedicatedServer_ReturnValue, int32 K2Node_CustomEvent_AscendIndex, bool K2Node_CustomEvent_bImmediateAscend, bool K2Node_CustomEvent_bIsCheatAscend, class FName CallFunc_MakeLiteralName_ReturnValue, const class FString& CallFunc_Conv_NameToString_ReturnValue, class UWorld* CallFunc_K2_GetWorld_ReturnValue, class AController* CallFunc_GetController_ReturnValue, class UShooterGameUserSettings* CallFunc_GetUserSettings_ReturnValue, class AShooterPlayerController* K2Node_DynamicCast_AsShooter_Player_Controller, bool K2Node_DynamicCast_bSuccess, class UFinalCreditsUI_C* CallFunc_Create_ReturnValue, const class FString& K2Node_CustomEvent_Text, const struct FLinearColor& K2Node_CustomEvent_Color, double K2Node_CustomEvent_LifetimeSeconds, double K2Node_CustomEvent_DisplayScale, class USoundCue* K2Node_CustomEvent_SoundToPlay, class AController* CallFunc_GetController_ReturnValue_1, const struct FColor& CallFunc_Conv_LinearColorToColor_ReturnValue, class AShooterPlayerController* K2Node_DynamicCast_AsShooter_Player_Controller_1, bool K2Node_DynamicCast_bSuccess_1, class AShooterHUD* CallFunc_GetShooterHUD_ReturnValue, class UWorld* CallFunc_K2_GetWorld_ReturnValue_1, bool CallFunc_TriggerLevelCustomEvents_ReturnValue, bool CallFunc_IsShipping_ReturnValue, const class FString& CallFunc_BPGetPrimaryMapName_ReturnValue, bool CallFunc_EqualEqual_StrStr_ReturnValue, class FName K2Node_Event_SocketName, class APrimalCharacter* K2Node_Event_VictimChar, const struct FLinearColor& CallFunc_GetFXBloodColor_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue, double CallFunc_SelectFloat_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsServer_ReturnValue, bool Temp_bool_Variable_1, const struct FLinearColor& Temp_struct_Variable, const struct FLinearColor& Temp_struct_Variable_1, const struct FLinearColor& Temp_struct_Variable_2, int32 Temp_int_Variable, bool Temp_bool_Variable_2, bool CallFunc_IsLocallyControlled_ReturnValue, bool CallFunc_IsFirstPerson_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class USceneComponent* K2Node_Select_Default, bool CallFunc_Greater_DoubleDouble_ReturnValue_1, class USceneComponent* K2Node_Select_Default_1, double CallFunc_SelectFloat_ReturnValue_1, class USceneComponent* K2Node_Select_Default_2, double CallFunc_FMin_ReturnValue, class UNiagaraComponent* CallFunc_SpawnSystemAttached_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue, const class FString& CallFunc_Conv_IntToString_ReturnValue, int32 CallFunc_Max_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, bool CallFunc_TriggerLevelCustomEvents_ReturnValue_1, const struct FLinearColor& K2Node_Select_Default_3, class AController* CallFunc_GetController_ReturnValue_2, class AShooterPlayerController* K2Node_DynamicCast_AsShooter_Player_Controller_2, bool K2Node_DynamicCast_bSuccess_2, float CallFunc_BPAddHUDNotification_DisplayTime_ImplicitCast, float CallFunc_BPAddHUDNotification_DisplayScale_ImplicitCast, double CallFunc_SelectFloat_B_ImplicitCast, double CallFunc_SelectFloat_A_ImplicitCast, double CallFunc_Greater_DoubleDouble_A_ImplicitCast, double CallFunc_SelectFloat_B_ImplicitCast_1, double CallFunc_SelectFloat_A_ImplicitCast_1, double CallFunc_Greater_DoubleDouble_A_ImplicitCast_1, float CallFunc_SetVariableFloat_InValue_ImplicitCast);
};

}


