#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x50 (0x50 - 0x0)
// Function PrimalItemArmor_BasePants.PrimalItemArmor_BasePants_C.OverrideCrouchingSound
struct UPrimalItemArmor_BasePants_C_OverrideCrouchingSound_Params
{
public:
	class USoundBase*                            InSound;                                           // 0x0(0x8)(Edit, ZeroConstructor)
	bool                                         bIsProne;                                          // 0x8(0x1)(None)
	uint8                                        Pad_24B5[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SoundState;                                        // 0xC(0x4)(None)
	class USoundBase*                            ReturnValue;                                       // 0x10(0x8)(Edit, ZeroConstructor)
	class USoundBase*                            RetSound;                                          // 0x18(0x8)(Edit, ZeroConstructor)
	bool                                         Temp_bool_Variable;                                // 0x20(0x1)(None)
	uint8                                        Pad_24B6[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Temp_int_Variable;                                 // 0x24(0x4)(None)
	int32                                        Temp_int_Variable_1;                               // 0x28(0x4)(None)
	uint8                                        Pad_24B7[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USoundBase*                            K2Node_Select_Default;                             // 0x30(0x8)(Edit, ZeroConstructor)
	class USoundBase*                            K2Node_Select_Default_1;                           // 0x38(0x8)(Edit, ZeroConstructor)
	bool                                         CallFunc_IsValid_ReturnValue;                      // 0x40(0x1)(None)
	uint8                                        Pad_24B8[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USoundBase*                            K2Node_Select_Default_2;                           // 0x48(0x8)(None)
};

}
}


