#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xB0 (0x790 - 0x6E0)
// Class ShooterGame.CustomCanvasWidget
class UCustomCanvasWidget : public UButton
{
public:
	uint8                                        Pad_1157[0x48];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bOverrideScreenCanvasProjection;                   // 0x728(0x1)(None)
	bool                                         bIgnoreParentAlpha;                                // 0x729(0x1)(None)
	uint8                                        Pad_1158[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnDraggedObject;                                   // 0x730(0x10)(ZeroConstructor)
	uint8                                        Pad_1159[0x50];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCustomCanvasWidget* GetDefaultObj();

};

// 0x148 (0x8D8 - 0x790)
// Class ShooterGame.DataListEntryButton
class UDataListEntryButton : public UCustomCanvasWidget
{
public:
	uint8                                        Pad_115B[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                DisplayString;                                     // 0x7A0(0x10)(None)
	class FString                                AdditionalDisplayString;                           // 0x7B0(0x10)(None)
	class FName                                  ContextMenuAnchorName;                             // 0x7C0(0x8)(None)
	class UTexture2D*                            ItemIcon;                                          // 0x7C8(0x8)(ZeroConstructor)
	struct FLinearColor                          ForegroundColor;                                   // 0x7D0(0x10)(None)
	bool                                         bUseSelectedBackgroundColor;                       // 0x7E0(0x1)(None)
	uint8                                        Pad_115C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          SelectedBackgroundColor;                           // 0x7E4(0x10)(None)
	uint8                                        Pad_115D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            AltHighlightBGTexture;                             // 0x7F8(0x8)(ZeroConstructor)
	float                                        NameOffset;                                        // 0x800(0x4)(None)
	bool                                         bClickable;                                        // 0x804(0x1)(None)
	bool                                         bEnabled;                                          // 0x805(0x1)(None)
	bool                                         bUseDisplayString;                                 // 0x806(0x1)(None)
	uint8                                        Pad_115E[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          DisplayStringColor;                                // 0x808(0x10)(None)
	struct FVector2D                             DisplayStringOffset;                               // 0x818(0x10)(None)
	float                                        TextDisplayStringSize;                             // 0x828(0x4)(None)
	uint8                                        Pad_115F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             DisplayStringScale;                                // 0x830(0x10)(None)
	bool                                         bDisplayStringCenterX;                             // 0x840(0x1)(None)
	bool                                         bDisplayStringCenterY;                             // 0x841(0x1)(None)
	bool                                         bSetIndexPlusOneToDisplayString;                   // 0x842(0x1)(None)
	bool                                         bAllowClickingWhenNoEntry;                         // 0x843(0x1)(None)
	uint8                                        Pad_1160[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFont*                                 DisplayStringFont;                                 // 0x848(0x8)(ZeroConstructor)
	class UTexture2D*                            SelectedIcon;                                      // 0x850(0x8)(ZeroConstructor)
	struct FLinearColor                          DisabledColor;                                     // 0x858(0x10)(None)
	struct FLinearColor                          TintColorOverride;                                 // 0x868(0x10)(None)
	uint8                                        bDataListAutomaticallyOverrideText : 1;            // Mask: 0x1, PropSize: 0x10x878(0x1)(None)
	uint8                                        bDataListAutomaticallyOverrideEnabled : 1;         // Mask: 0x2, PropSize: 0x10x878(0x1)(None)
	uint8                                        bWrapText : 1;                                     // Mask: 0x4, PropSize: 0x10x878(0x1)(None)
	uint8                                        bUseDataProviderCustomColor : 1;                   // Mask: 0x8, PropSize: 0x10x878(0x1)(None)
	uint8                                        bOverrideTintColor : 1;                            // Mask: 0x10, PropSize: 0x10x878(0x1)(None)
	uint8                                        bShowDisplayStringWhenHasItem : 1;                 // Mask: 0x20, PropSize: 0x10x878(0x1)(None)
	uint8                                        bUseCustomTextColor : 1;                           // Mask: 0x40, PropSize: 0x10x878(0x1)(None)
	uint8                                        bSelected : 1;                                     // Mask: 0x80, PropSize: 0x10x878(0x1)(None)
	uint8                                        bForceDraggingDisabled : 1;                        // Mask: 0x1, PropSize: 0x10x879(0x1)(None)
	uint8                                        bDraggable : 1;                                    // Mask: 0x2, PropSize: 0x10x879(0x1)(None)
	uint8                                        BitPad_FB : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bAllowExtraIcon : 1;                               // Mask: 0x10, PropSize: 0x10x879(0x1)(None)
	uint8                                        bToggleButton : 1;                                 // Mask: 0x20, PropSize: 0x10x879(0x1)(None)
	uint8                                        BitPad_FC : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1162[0x16];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            OverrideDisabledIcon;                              // 0x890(0x8)(ZeroConstructor)
	struct FVector2D                             WrappedTextSpacingAdjust;                          // 0x898(0x10)(None)
	uint8                                        Pad_1163[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FColor                                OverridenTextColor;                                // 0x8B0(0x4)(None)
	bool                                         bHasEngram;                                        // 0x8B4(0x1)(None)
	bool                                         bKnownEngram;                                      // 0x8B5(0x1)(None)
	bool                                         bOverrideStlye;                                    // 0x8B6(0x1)(None)
	uint8                                        Pad_1164[0x11];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UMaterialInstanceDynamic*              MyIconMat;                                         // 0x8C8(0x8)(ZeroConstructor)
	class UMenuAnchor*                           ContextMenuAnchor;                                 // 0x8D0(0x8)(ZeroConstructor)

	static class UClass* StaticClass();
	static class UDataListEntryButton* GetDefaultObj();

	void OnGetContextMenuContent(class UWidget* ReturnValue);
	void GetStringValue(const class FString& ReturnValue);
	void GetOverridenStringValue(const class FString& ReturnValue);
	void ClickedSecondaryButton(class UWidget* ClickedWidget);
	void ClickedButton(class UWidget* ClickedWidget);
};

// 0x58 (0x930 - 0x8D8)
// Class ShooterGame.AdminPlayerInfoEntryButton
class UAdminPlayerInfoEntryButton : public UDataListEntryButton
{
public:
	uint8                                        bIsCustom : 1;                                     // Mask: 0x1, PropSize: 0x10x8D8(0x1)(None)
	uint8                                        BitPad_FD : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1168[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                PlayerName;                                        // 0x8E0(0x10)(None)
	class FString                                SteamPlayerName;                                   // 0x8F0(0x10)(None)
	class FString                                LinkedPlayerID;                                    // 0x900(0x10)(None)
	bool                                         bCenterDisplayName;                                // 0x910(0x1)(None)
	uint8                                        Pad_1169[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          DisplayStringSelectedColor;                        // 0x914(0x10)(None)
	uint8                                        Pad_116A[0xC];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAdminPlayerInfoEntryButton* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class ShooterGame.AhoCorasickMatch
class UAhoCorasickMatch : public UObject
{
public:

	static class UClass* StaticClass();
	static class UAhoCorasickMatch* GetDefaultObj();

	void SearchWords(const class FString& Text, const struct FAhoCorasickMatcher& Matcher, const TArray<class FString>& OutKeys, const TArray<struct FIntArray>& OutValues, bool bFilterOverlaps, bool bGetShortest);
	void AddWords(const TArray<class FString>& WordList, const struct FAhoCorasickMatcher& Matcher);
};

// 0x20 (0x4D8 - 0x4B8)
// Class ShooterGame.AIAttackCoordinator
class AAIAttackCoordinator : public AActor
{
public:
	int32                                        MaxAttackersPerTarget;                             // 0x4B8(0x4)(None)
	float                                        UpdateInterval;                                    // 0x4BC(0x4)(None)
	TArray<TWeakObjectPtr<class APrimalDinoAIController>> Attackers;                                         // 0x4C0(0x10)(ZeroConstructor)
	uint8                                        Pad_1176[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AAIAttackCoordinator* GetDefaultObj();

	void UpdateAttackGroup(const TArray<class APrimalDinoAIController*>& AttackGroup);
	void RemoveAttacker(class APrimalDinoAIController* Controller);
	void GetNumAttackersWithPriorityForTarget(class AActor* Target, int32 ReturnValue);
	void GetNumAttackersForTarget(class AActor* Target, int32 ReturnValue);
	void ClearAllAttackers();
	void CalculateAttackerPriorityWeight(class APrimalDinoAIController* Attacker, float ReturnValue);
	void AddAttackerCharacter(class APrimalDinoCharacter* Character);
	void AddAttacker(class APrimalDinoAIController* Controller);
};

// 0xC0 (0xE8 - 0x28)
// Class ShooterGame.AllClustersInventory
class UAllClustersInventory : public UObject
{
public:
	uint8                                        Pad_1189[0xC0];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAllClustersInventory* GetDefaultObj();

	void OnFinishedSaveForChangingItems(bool Success, const class FString& UserId);
	void OnFinishedReadLockForCreateLock(bool Success, const class FString& UserId, bool Locked);
	void OnFinishedLoadForChangingItems(bool Success, const class FString& UserId, const TArray<struct FItemNetInfo>& ArkItems);
	void OnFinishedCreateLockForChangingItems(bool Success, const class FString& UserId);
	void OnFinishedClearLockForChangingItems(bool Success, const class FString& UserId);
};

// 0x38 (0x910 - 0x8D8)
// Class ShooterGame.AllPaintingsEntryButton
class UAllPaintingsEntryButton : public UDataListEntryButton
{
public:
	class FString                                Filename;                                          // 0x8D8(0x10)(None)
	class FString                                FilePath;                                          // 0x8E8(0x10)(None)
	struct FLinearColor                          DisplayStringSelectedColor;                        // 0x8F8(0x10)(None)
	uint8                                        Pad_118A[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAllPaintingsEntryButton* GetDefaultObj();

};

// 0x48 (0x920 - 0x8D8)
// Class ShooterGame.AllPlayersEntryButton
class UAllPlayersEntryButton : public UDataListEntryButton
{
public:
	class FString                                PlayerName;                                        // 0x8D8(0x10)(None)
	class FString                                TribeName;                                         // 0x8E8(0x10)(None)
	uint64                                       PlayerID;                                          // 0x8F8(0x8)(None)
	uint64                                       TargetingTeamID;                                   // 0x900(0x8)(None)
	class AShooterCharacter*                     CurrentCharachter;                                 // 0x908(0x8)(ZeroConstructor)
	struct FLinearColor                          DisplayStringSelectedColor;                        // 0x910(0x10)(None)

	static class UClass* StaticClass();
	static class UAllPlayersEntryButton* GetDefaultObj();

};

// 0xC8 (0x410 - 0x348)
// Class ShooterGame.AnimInstance_DinoBlueprintBase
class UAnimInstance_DinoBlueprintBase : public UAnimInstance
{
public:
	bool                                         bAllowNativeAnimations;                            // 0x348(0x1)(None)
	bool                                         bDisableBlueprint;                                 // 0x349(0x1)(None)
	uint8                                        Pad_1192[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRotator                              RootRotationOffset;                                // 0x350(0x18)(None)
	struct FVector                               RootLocationOffset;                                // 0x368(0x18)(None)
	bool                                         bSkipAnimGraph;                                    // 0x380(0x1)(None)
	uint8                                        Pad_1193[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MovementAnimRate;                                  // 0x384(0x4)(None)
	float                                        MovementAnimRatePower;                             // 0x388(0x4)(None)
	float                                        MinMovementAnimRate;                               // 0x38C(0x4)(None)
	float                                        MaxMovementAnimRate;                               // 0x390(0x4)(None)
	float                                        MovingAnimSpeedTreshold;                           // 0x394(0x4)(None)
	bool                                         bIsMoving;                                         // 0x398(0x1)(None)
	bool                                         bUseAimOffset;                                     // 0x399(0x1)(None)
	uint8                                        Pad_1199[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AimPitch;                                          // 0x39C(0x4)(None)
	float                                        AimYaw;                                            // 0x3A0(0x4)(None)
	bool                                         bUseBlinking;                                      // 0x3A4(0x1)(None)
	uint8                                        Pad_119A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BlinkBlend;                                        // 0x3A8(0x4)(None)
	bool                                         bUseTurning;                                       // 0x3AC(0x1)(None)
	bool                                         bUseTurnInPlaceAnimation;                          // 0x3AD(0x1)(None)
	uint8                                        Pad_119B[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TurningEnabledBlendTime;                           // 0x3B0(0x4)(None)
	float                                        TurningDisabledBlendTime;                          // 0x3B4(0x4)(None)
	float                                        TurningDirectionBlendTime;                         // 0x3B8(0x4)(None)
	float                                        MinTurnRateForTurnAnimation;                       // 0x3BC(0x4)(None)
	bool                                         bIsTurning;                                        // 0x3C0(0x1)(None)
	bool                                         bTurningRight;                                     // 0x3C1(0x1)(None)
	bool                                         bUseSwimming;                                      // 0x3C2(0x1)(None)
	uint8                                        Pad_119C[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SwimmingMovingAnimSpeedThreshold;                  // 0x3C4(0x4)(None)
	bool                                         bIsSwimming;                                       // 0x3C8(0x1)(None)
	bool                                         bUseRunning;                                       // 0x3C9(0x1)(None)
	bool                                         bUseRunningMovementAnimRate;                       // 0x3CA(0x1)(None)
	uint8                                        Pad_119D[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RunningMovementAnimRate;                           // 0x3CC(0x4)(None)
	bool                                         bIsRunning;                                        // 0x3D0(0x1)(None)
	bool                                         bUseSleepingAnim;                                  // 0x3D1(0x1)(None)
	uint8                                        Pad_119E[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               SleepingAnimTranslationOffset;                     // 0x3D8(0x18)(None)
	bool                                         bIsSleeping;                                       // 0x3F0(0x1)(None)
	bool                                         bUseFalling;                                       // 0x3F1(0x1)(None)
	uint8                                        Pad_119F[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FallingAnimPlayRate;                               // 0x3F4(0x4)(None)
	float                                        FallingBlendInTime;                                // 0x3F8(0x4)(None)
	float                                        FallingBlendOutTime;                               // 0x3FC(0x4)(None)
	bool                                         bIsFalling;                                        // 0x400(0x1)(None)
	uint8                                        Pad_11A0[0xF];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimInstance_DinoBlueprintBase* GetDefaultObj();

};

// 0xE8 (0x430 - 0x348)
// Class ShooterGame.AnimInstance_DinoRootBoneName
class UAnimInstance_DinoRootBoneName : public UAnimInstance
{
public:
	bool                                         bAllowNativeAnimations;                            // 0x348(0x1)(None)
	bool                                         bDisableBlueprint;                                 // 0x349(0x1)(None)
	uint8                                        Pad_11A3[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRotator                              RootRotationOffset;                                // 0x350(0x18)(None)
	struct FVector                               RootLocationOffset;                                // 0x368(0x18)(None)
	float                                        IKAlpha;                                           // 0x380(0x4)(None)
	bool                                         bDisableIK;                                        // 0x384(0x1)(None)
	bool                                         bDisableIKWhenFalling;                             // 0x385(0x1)(None)
	bool                                         bSleepingEnableIK;                                 // 0x386(0x1)(None)
	bool                                         bSkipAnimGraph;                                    // 0x387(0x1)(None)
	float                                        MovementAnimRate;                                  // 0x388(0x4)(None)
	float                                        MovementAnimRatePower;                             // 0x38C(0x4)(None)
	float                                        MinMovementAnimRate;                               // 0x390(0x4)(None)
	float                                        MaxMovementAnimRate;                               // 0x394(0x4)(None)
	float                                        MovingAnimSpeedTreshold;                           // 0x398(0x4)(None)
	float                                        MovingBlendInTime;                                 // 0x39C(0x4)(None)
	float                                        MovingBlendOutTime;                                // 0x3A0(0x4)(None)
	bool                                         bIsMoving;                                         // 0x3A4(0x1)(None)
	bool                                         bUseAimOffset;                                     // 0x3A5(0x1)(None)
	uint8                                        Pad_1246[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AimPitch;                                          // 0x3A8(0x4)(None)
	float                                        AimYaw;                                            // 0x3AC(0x4)(None)
	float                                        AimOffsetPitchScale;                               // 0x3B0(0x4)(None)
	float                                        AimOffsetYawScale;                                 // 0x3B4(0x4)(None)
	bool                                         bUseAlignGround;                                   // 0x3B8(0x1)(None)
	uint8                                        Pad_1247[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AlignGroundAlpha;                                  // 0x3BC(0x4)(None)
	bool                                         bUseBlinking;                                      // 0x3C0(0x1)(None)
	uint8                                        Pad_1248[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BlinkBlend;                                        // 0x3C4(0x4)(None)
	bool                                         bUseTurning;                                       // 0x3C8(0x1)(None)
	bool                                         bUseTurnInPlaceAnimation;                          // 0x3C9(0x1)(None)
	uint8                                        Pad_1249[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TurningEnabledBlendTime;                           // 0x3CC(0x4)(None)
	float                                        TurningDisabledBlendTime;                          // 0x3D0(0x4)(None)
	float                                        TurningDirectionBlendTime;                         // 0x3D4(0x4)(None)
	float                                        MinTurnRateForTurnAnimation;                       // 0x3D8(0x4)(None)
	bool                                         bIsTurning;                                        // 0x3DC(0x1)(None)
	bool                                         bTurningRight;                                     // 0x3DD(0x1)(None)
	bool                                         bUseSwimming;                                      // 0x3DE(0x1)(None)
	uint8                                        Pad_124C[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SwimmingMovingAnimSpeedThreshold;                  // 0x3E0(0x4)(None)
	bool                                         bIsSwimming;                                       // 0x3E4(0x1)(None)
	bool                                         bUseRunning;                                       // 0x3E5(0x1)(None)
	bool                                         bUseRunningMovementAnimRate;                       // 0x3E6(0x1)(None)
	uint8                                        Pad_124F[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RunningMovementAnimRate;                           // 0x3E8(0x4)(None)
	float                                        RunningBlendInTime;                                // 0x3EC(0x4)(None)
	float                                        RunningBlendOutTime;                               // 0x3F0(0x4)(None)
	bool                                         bIsRunning;                                        // 0x3F4(0x1)(None)
	bool                                         bUseSleepingAnim;                                  // 0x3F5(0x1)(None)
	uint8                                        Pad_1250[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               SleepingAnimTranslationOffset;                     // 0x3F8(0x18)(None)
	bool                                         bIsSleeping;                                       // 0x410(0x1)(None)
	bool                                         bUseFalling;                                       // 0x411(0x1)(None)
	uint8                                        Pad_1251[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FallingAnimPlayRate;                               // 0x414(0x4)(None)
	float                                        FallingBlendInTime;                                // 0x418(0x4)(None)
	float                                        FallingBlendOutTime;                               // 0x41C(0x4)(None)
	bool                                         bIsFalling;                                        // 0x420(0x1)(None)
	uint8                                        Pad_1252[0xF];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimInstance_DinoRootBoneName* GetDefaultObj();

};

// 0x158 (0x4A0 - 0x348)
// Class ShooterGame.AnimInstance_DinoRootTransform
class UAnimInstance_DinoRootTransform : public UAnimInstance
{
public:
	bool                                         bAllowNativeAnimations;                            // 0x348(0x1)(None)
	bool                                         bDisableBlueprint;                                 // 0x349(0x1)(None)
	uint8                                        Pad_125C[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRotator                              RootRotationOffset;                                // 0x350(0x18)(None)
	struct FVector                               RootLocationOffset;                                // 0x368(0x18)(None)
	struct FTransform                            RootOffsetTransform;                               // 0x380(0x60)(None)
	bool                                         bSkipAnimGraph;                                    // 0x3E0(0x1)(None)
	uint8                                        Pad_125D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MovementAnimRate;                                  // 0x3E4(0x4)(None)
	float                                        MovementAnimRatePower;                             // 0x3E8(0x4)(None)
	float                                        MinimumMovementSpeed;                              // 0x3EC(0x4)(None)
	float                                        MovingBlendInTime;                                 // 0x3F0(0x4)(None)
	float                                        MovingBlendOutTime;                                // 0x3F4(0x4)(None)
	bool                                         bIsMoving;                                         // 0x3F8(0x1)(None)
	uint8                                        Pad_125E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinimumMovementSpeedFlying;                        // 0x3FC(0x4)(None)
	float                                        FlyingMoveBlendIn;                                 // 0x400(0x4)(None)
	float                                        FlyingMoveBlendOut;                                // 0x404(0x4)(None)
	bool                                         bIsFlying;                                         // 0x408(0x1)(None)
	bool                                         bUseFlyingOffset;                                  // 0x409(0x1)(None)
	uint8                                        Pad_125F[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               FlyingOffset;                                      // 0x410(0x18)(None)
	struct FVector                               CurrentFlyingOffset;                               // 0x428(0x18)(None)
	struct FVector                               LandedOffset;                                      // 0x440(0x18)(None)
	bool                                         bUseAimOffset;                                     // 0x458(0x1)(None)
	uint8                                        Pad_1260[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AimPitch;                                          // 0x45C(0x4)(None)
	float                                        AimYaw;                                            // 0x460(0x4)(None)
	float                                        AimOffsetPitchScale;                               // 0x464(0x4)(None)
	float                                        AimOffsetYawScale;                                 // 0x468(0x4)(None)
	bool                                         bUseBlinking;                                      // 0x46C(0x1)(None)
	uint8                                        Pad_1261[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BlinkBlend;                                        // 0x470(0x4)(None)
	bool                                         bUseTurning;                                       // 0x474(0x1)(None)
	uint8                                        Pad_1262[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TurningEnabledBlendTime;                           // 0x478(0x4)(None)
	float                                        TurningDisabledBlendTime;                          // 0x47C(0x4)(None)
	float                                        TurningDirectionBlendTime;                         // 0x480(0x4)(None)
	float                                        MinTurnRateForTurnAnimation;                       // 0x484(0x4)(None)
	bool                                         bIsTurning;                                        // 0x488(0x1)(None)
	bool                                         bTurningRight;                                     // 0x489(0x1)(None)
	bool                                         bUseRunning;                                       // 0x48A(0x1)(None)
	bool                                         bIsRunning;                                        // 0x48B(0x1)(None)
	bool                                         bUseSleepingAnim;                                  // 0x48C(0x1)(None)
	bool                                         bIsSleeping;                                       // 0x48D(0x1)(None)
	bool                                         bUseFalling;                                       // 0x48E(0x1)(None)
	uint8                                        Pad_1264[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FallingAnimPlayRate;                               // 0x490(0x4)(None)
	float                                        FallingBlendInTime;                                // 0x494(0x4)(None)
	float                                        FallingBlendOutTime;                               // 0x498(0x4)(None)
	bool                                         bIsFalling;                                        // 0x49C(0x1)(None)
	bool                                         bUseMounted;                                       // 0x49D(0x1)(None)
	bool                                         bIsMounted;                                        // 0x49E(0x1)(None)
	uint8                                        Pad_1265[0x1];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimInstance_DinoRootTransform* GetDefaultObj();

};

// 0x10 (0x40 - 0x30)
// Class ShooterGame.AnimNotifyState_Custom
class UAnimNotifyState_Custom : public UAnimNotifyState
{
public:
	class FName                                  EventName;                                         // 0x30(0x8)(None)
	bool                                         bSendNotifyToWeapon;                               // 0x38(0x1)(None)
	bool                                         bSendNotifyToArmorSlot;                            // 0x39(0x1)(None)
	enum class EPrimalEquipmentType              ArmorSlotToSendNotify;                             // 0x3A(0x1)(None)
	uint8                                        Pad_126E[0x5];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotifyState_Custom* GetDefaultObj();

};

// 0x18 (0x58 - 0x40)
// Class ShooterGame.AnimNotify_CustomEvent
class UAnimNotify_CustomEvent : public UAnimNotify
{
public:
	class FName                                  EventName;                                         // 0x40(0x8)(None)
	bool                                         bSendNotifyToWeapon;                               // 0x48(0x1)(None)
	bool                                         bSendNotifyToArmorSlot;                            // 0x49(0x1)(None)
	enum class EPrimalEquipmentType              ArmorSlotToSendNotify;                             // 0x4A(0x1)(None)
	bool                                         bLockHeadPositionNormalized;                       // 0x4B(0x1)(None)
	float                                        TimeToLockHeadPosition;                            // 0x4C(0x4)(None)
	bool                                         bUnlockHeadPositionNormalized;                     // 0x50(0x1)(None)
	uint8                                        Pad_1275[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_CustomEvent* GetDefaultObj();

};

// 0x38 (0x78 - 0x40)
// Class ShooterGame.AnimNotify_PlayCameraShake
class UAnimNotify_PlayCameraShake : public UAnimNotify
{
public:
	float                                        PercentChanceToPlay;                               // 0x40(0x4)(None)
	uint8                                        Pad_127B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                TheCameraShake;                                    // 0x48(0x8)(None)
	float                                        InnerRadius;                                       // 0x50(0x4)(None)
	float                                        OuterRadius;                                       // 0x54(0x4)(None)
	float                                        Falloff;                                           // 0x58(0x4)(None)
	bool                                         bOrientShakeTowardsEpicenter;                      // 0x5C(0x1)(None)
	uint8                                        Pad_127C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ShakeScale;                                        // 0x60(0x4)(None)
	uint8                                        Pad_127D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                AttachName;                                        // 0x68(0x10)(None)

	static class UClass* StaticClass();
	static class UAnimNotify_PlayCameraShake* GetDefaultObj();

};

// 0x10 (0x120 - 0x110)
// Class ShooterGame.AnimNotify_PlayParticleEffectCustom
class UAnimNotify_PlayParticleEffectCustom : public UAnimNotify_PlayParticleEffect
{
public:
	class FName                                  AttachedComponentTag;                              // 0x110(0x8)(None)
	uint8                                        Pad_1282[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_PlayParticleEffectCustom* GetDefaultObj();

};

// 0x10 (0x50 - 0x40)
// Class ShooterGame.AnimNotify_StopSound
class UAnimNotify_StopSound : public UAnimNotify
{
public:
	class USoundBase*                            SoundToStop;                                       // 0x40(0x8)(None)
	float                                        FadeOutTime;                                       // 0x48(0x4)(None)
	uint8                                        Pad_1284[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_StopSound* GetDefaultObj();

};

// 0x98 (0xC0 - 0x28)
// Class ShooterGame.AntiDupeTransactionLog
class UAntiDupeTransactionLog : public UObject
{
public:
	class UWorld*                                CurrentWorld;                                      // 0x28(0x8)(None)
	uint8                                        Pad_1288[0x90];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAntiDupeTransactionLog* GetDefaultObj();

};

// 0x30 (0x58 - 0x28)
// Class ShooterGame.ArkCloudInventoryData
class UArkCloudInventoryData : public UObject
{
public:
	struct FArkInventoryData                     MyArkData;                                         // 0x28(0x30)(None)

	static class UClass* StaticClass();
	static class UArkCloudInventoryData* GetDefaultObj();

};

// 0x18 (0x4D0 - 0x4B8)
// Class ShooterGame.BaseBoxTrigger
class ABaseBoxTrigger : public AActor
{
public:
	class USceneComponent*                       SceneComp;                                         // 0x4B8(0x8)(ZeroConstructor)
	class UBoxComponent*                         TriggerBox;                                        // 0x4C0(0x8)(ZeroConstructor)
	uint8                                        bUseBPOnTriggerBeginOverlap : 1;                   // Mask: 0x1, PropSize: 0x10x4C8(0x1)(None)
	uint8                                        bUseBPOnTriggerEndOverlap : 1;                     // Mask: 0x2, PropSize: 0x10x4C8(0x1)(None)
	uint8                                        Pad_135C[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABaseBoxTrigger* GetDefaultObj();

	void OnTriggerEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnTriggerBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void IsCharacterTouchingTrigger(class APrimalCharacter* Character, bool ReturnValue);
	void GetAllCharactersTouchingTrigger(const TArray<class APrimalCharacter*>& OutCharacters);
	void BPOnTriggerEndOverlap(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BPOnTriggerBeginOverlap(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
};

// 0x40 (0xB28 - 0xAE8)
// Class ShooterGame.BasePlayerController
class ABasePlayerController : public APrimalPlayerController
{
public:
	uint8                                        Pad_1365[0x28];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UUI_CustomOverlay*                     CustomCursor;                                      // 0xB10(0x8)(ZeroConstructor)
	uint8                                        Pad_1366[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bIsGamepadActive;                                  // 0xB20(0x1)(None)
	uint8                                        Pad_1367[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABasePlayerController* GetDefaultObj();

	void SimulateInputKey(const struct FKey& Key, bool bPressed);
	void ServerCheat(const class FString& Msg);
	void Say(const class FString& Msg);
	void ClientStartOnlineGame();
	void ClientSetSpectatorCamera(const struct FVector& CameraLocation, const struct FRotator& CameraRotation);
	void ClientSendRoundEndEvent(bool bIsWinner, int32 ExpendedTimeInSeconds);
	void ClientGameStarted();
	void ClientEndOnlineGame();
};

// 0x10 (0x330 - 0x320)
// Class ShooterGame.PrimalUserWidget
class UPrimalUserWidget : public UUserWidget
{
public:
	uint8                                        Pad_1382[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ViewportZOrder;                                    // 0x328(0x4)(None)
	float                                        DPIScaler;                                         // 0x32C(0x4)(None)

	static class UClass* StaticClass();
	static class UPrimalUserWidget* GetDefaultObj();

	void WidgetRemovedFromViewport();
	void WidgetAddedToViewport();
	void StopAnimationByString(const class FString& Name);
	void SetZOrderInViewport(int32 ZOrder);
	void PlayAnimationByString(const class FString& Name, bool ReturnValue);
	void OnWidgetGamepadActiveChangedBP(bool bIsGamepadActive);
	void HandleVirtualBack(bool ReturnValue);
	void HandleKeyUp(const struct FKey& TheKey, bool ReturnValue);
	void GetOverrideHighligteableWidgetBP(class UWidget* ReturnValue);
	void ExecuteCommandForPrimalUI(class FName CommandName, const struct FBPNetExecParams& ExecParams);
	void BPExecutedCommandForPrimalUI(class FName CommandName, const struct FBPNetExecParams& ExecParams);
};

// 0x428 (0x758 - 0x330)
// Class ShooterGame.PrimalUI
class UPrimalUI : public UPrimalUserWidget
{
public:
	uint8                                        Pad_142C[0x4C];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bCaptureMouseInput;                                // 0x37C(0x1)(None)
	bool                                         bPreventGamepadDpadNavegation;                     // 0x37D(0x1)(None)
	bool                                         bForceVirtualCursorEnabled;                        // 0x37E(0x1)(None)
	bool                                         bIsClosing;                                        // 0x37F(0x1)(None)
	bool                                         bWantsPrimalItemNotifications;                     // 0x380(0x1)(None)
	uint8                                        Pad_142F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                DefaultToolTipWidget;                              // 0x388(0x8)(ZeroConstructor)
	bool                                         bEscapeClosesMenu;                                 // 0x390(0x1)(None)
	bool                                         bEscapeOpensPauseMenu;                             // 0x391(0x1)(None)
	bool                                         bSpecialRightOpensPauseMenu;                       // 0x392(0x1)(None)
	bool                                         bMenuSupportSlomo;                                 // 0x393(0x1)(None)
	bool                                         bClickClosesMenu;                                  // 0x394(0x1)(None)
	bool                                         bIsGameplayUI;                                     // 0x395(0x1)(None)
	bool                                         bIsTopUI;                                          // 0x396(0x1)(None)
	enum class EHighlightStartingPoint           HighlightStartPointType;                           // 0x397(0x1)(None)
	class UClass*                                ConfirmationDialogUITemplate;                      // 0x398(0x8)(ZeroConstructor)
	class UClass*                                XBoxFooterUITemplate;                              // 0x3A0(0x8)(ZeroConstructor)
	bool                                         bShowCancelIcon;                                   // 0x3A8(0x1)(None)
	bool                                         bShowAcceptIcon;                                   // 0x3A9(0x1)(None)
	bool                                         bShowLStickIcon;                                   // 0x3AA(0x1)(None)
	bool                                         bShowRStickIcon;                                   // 0x3AB(0x1)(None)
	bool                                         bShowBumpersIcon;                                  // 0x3AC(0x1)(None)
	bool                                         bShowStartBtnIcon;                                 // 0x3AD(0x1)(None)
	bool                                         bShowLTBtnIcon;                                    // 0x3AE(0x1)(None)
	bool                                         bShowRTBtnIcon;                                    // 0x3AF(0x1)(None)
	bool                                         bShowFaceBtnLeftIcon;                              // 0x3B0(0x1)(None)
	bool                                         bShowFaceBtnTopIcon;                               // 0x3B1(0x1)(None)
	bool                                         bShowFaceBtnRightIcon;                             // 0x3B2(0x1)(None)
	bool                                         bShowFaceBtnBottomIcon;                            // 0x3B3(0x1)(None)
	bool                                         bShowLeftShoulderBtnIcon;                          // 0x3B4(0x1)(None)
	bool                                         bShowXBoxFooter;                                   // 0x3B5(0x1)(None)
	bool                                         bIgnoreUIScaling;                                  // 0x3B6(0x1)(None)
	bool                                         bCloseOnPlayerDie;                                 // 0x3B7(0x1)(None)
	float                                        SplitscreenDPIScaler;                              // 0x3B8(0x4)(None)
	bool                                         bForceFullscreenVirtualCursor;                     // 0x3BC(0x1)(None)
	bool                                         bConstrainVirtualCursor;                           // 0x3BD(0x1)(None)
	bool                                         bDoExtraDataListButtonPanelFilteringChecks;        // 0x3BE(0x1)(None)
	uint8                                        Pad_143E[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  DefaultHighlightWidgetOverrideName;                // 0x3C0(0x8)(None)
	bool                                         bShouldValidateInputOnRemove;                      // 0x3C8(0x1)(None)
	bool                                         ShouldStretchMainScreenWhenHandheld;               // 0x3C9(0x1)(None)
	bool                                         WasInHandheldMode;                                 // 0x3CA(0x1)(None)
	uint8                                        Pad_1442[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnchors                              OriginalUnStretchedAnchors;                        // 0x3D0(0x20)(None)
	struct FMargin                               OriginalUnstretchedSize;                           // 0x3F0(0x10)(None)
	struct FVector2D                             OriginalSizeBoxUnstretchedSize;                    // 0x400(0x10)(None)
	struct FAnchors                              StretchedHandheldAnchors;                          // 0x410(0x20)(None)
	struct FMargin                               StretchedHandheldSize;                             // 0x430(0x10)(None)
	struct FVector2D                             SizeBoxHandheldSize;                               // 0x440(0x10)(None)
	int32                                        VirtualCursorFrames;                               // 0x450(0x4)(None)
	uint8                                        Pad_1449[0x4C];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AnalogDeltaX;                                      // 0x4A0(0x4)(None)
	float                                        AnalogDeltaY;                                      // 0x4A4(0x4)(None)
	uint8                                        Pad_144D[0x1C0];                                   // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            HTTPGetResponseEvent;                              // 0x668(0x10)(ZeroConstructor)
	TWeakObjectPtr<class APrimalStructureItemContainer> ItemContainer;                                     // 0x678(0x8)(ZeroConstructor)
	bool                                         bCachedIsGamepadActive;                            // 0x680(0x1)(None)
	uint8                                        Pad_144F[0xD3];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         OverrideButtonSounds;                              // 0x754(0x1)(None)
	uint8                                        Pad_1451[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPrimalUI* GetDefaultObj();

	void UsingProController(bool DebugOut, bool ReturnValue);
	void ShowDLCConfirmationDialog(enum class EDLCSelector DLC, class UUI_GenericConfirmationDialog* ReturnValue);
	void ShowConfirmationDialogBP(const class FString& TitleText, const class FString& MessageText, bool IsJustOKBox);
	void SetInputMode();
	void SetHighlightedWidget(class UWidget* Widget, bool bSetLastHighlightedPosition);
	void ResetAllScrollBars();
	void RemovedFromViewport();
	void ProcessSplitscreen(bool ScaleX);
	void PlayHapticEffect(class APlayerController* PC, enum class EHapticEffectType Type, const struct FVector& Location, class UWorld* World);
	void OpenTheStoreDLCPage(const class FString& TheDLCName);
	void OnMouseButtonDownEvent(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent, const struct FEventReply& ReturnValue);
	void OnKeyUpEvent(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyboardEvent, const struct FEventReply& ReturnValue);
	void OnKeyDownEvent(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyboardEvent, const struct FEventReply& ReturnValue);
	void OnGamepadButtonDownEvent(const struct FGeometry& MyGeometry, const struct FControllerEvent& ControllerEvent, const struct FEventReply& ReturnValue);
	void OnGamepadActiveChangedBP(bool bIsGamepadActive);
	void OnGamepadActiveChanged(bool bIsGamepadActive);
	void OnDLCConfirmationDialogClosed(bool bAccept);
	void OnCreateCredits(class UWidget* Widget);
	void OnConfirmationDialogClosedBP(bool bAccept);
	void OnConfirmationDialogClosed(bool bAccept);
	void MainMenuEscapePressed();
	void IsRightTriggerDown(bool ReturnValue);
	void IsLeftTriggerDown(bool ReturnValue);
	void HTTPGetString(const class FString& InURL);
	void HandleDockedModeChanges();
	void GetWidgetToScaleForHandheld(class UWidget* ReturnValue);
	void GetSizeboxForExtraHandheldScaling(class USizeBox* ReturnValue);
	void GetShooterHud(class AShooterHUD* ReturnValue);
	void GetPlayerState(class AShooterPlayerState* ReturnValue);
	void GetPC(class AShooterPlayerController* ReturnValue);
	void GetPawn(class APrimalCharacter* ReturnValue);
	void GetOpenComboBox(class UComboBoxString* ReturnValue);
	void FixHighlights();
	void DoExtraScalingForSplitscreen(const struct FVector2D& PlayerSize);
	void CloseWithAnimation();
	void ClickedSecondaryButton(class UWidget* ClickedWidget);
	void ClickedButton(class UWidget* ClickedWidget);
	void CheckGamepadActiveChanged(bool bIsGamepadActive);
	void ChangeChildrenTextColorBP(class UPanelWidget* Parent, const struct FSlateColor& NewColor, bool Recursive);
	void BPVirtualCursorinit();
	void BPReleasedVirtualAccept();
	void BPProcessSplitscreenAndAddToViewport(bool ScaleX);
	void BPHighlightWidgetOnStart(bool ReturnValue);
	void BPHandleDockedModeChange(bool bIsDocked);
	void BPGamepadReleased(const struct FKey& TheKey, bool ReturnValue);
	void BPEscapeClosed(bool ReturnValue);
	void BPCycleHighlighted(bool ReturnValue);
	void BPControlHighlighted(enum class EControlDirection Dir, const struct FKey& TheKey, float AnalogValue);
	void AddedToViewport();
};

// 0x0 (0x758 - 0x758)
// Class ShooterGame.BaseSelectableButtonWidget
class UBaseSelectableButtonWidget : public UPrimalUI
{
public:

	static class UClass* StaticClass();
	static class UBaseSelectableButtonWidget* GetDefaultObj();

	void BPSetSelected(bool bSelected);
	void BPIsSelected(bool ReturnValue);
	void BPGetButton(class UCustomButtonWidget* ReturnValue);
};

// 0x890 (0xE30 - 0x5A0)
// Class ShooterGame.ShooterGameState
class AShooterGameState : public AGameState
{
public:
	uint8                                        Pad_163E[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NumNPC;                                            // 0x5B0(0x4)(None)
	int32                                        NumHibernatedNPC;                                  // 0x5B4(0x4)(None)
	int32                                        NPCActiveCountTamed;                               // 0x5B8(0x4)(None)
	int32                                        NumActiveNPC;                                      // 0x5BC(0x4)(None)
	int32                                        NumDeadNPC;                                        // 0x5C0(0x4)(None)
	int32                                        NumPlayerActors;                                   // 0x5C4(0x4)(None)
	int32                                        NumPlayerConnected;                                // 0x5C8(0x4)(None)
	bool                                         bServerUseLocalizedChat;                           // 0x5CC(0x1)(None)
	uint8                                        Pad_163F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LocalizedChatRadius;                               // 0x5D0(0x4)(None)
	float                                        LocalizedChatRadiusUnconsiousScale;                // 0x5D4(0x4)(None)
	float                                        ServerFramerate;                                   // 0x5D8(0x4)(None)
	uint8                                        Pad_1640[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                NewStructureDestructionTag;                        // 0x5E0(0x10)(None)
	int32                                        DayNumber;                                         // 0x5F0(0x4)(None)
	float                                        DayTime;                                           // 0x5F4(0x4)(None)
	double                                       NetworkTime;                                       // 0x5F8(0x8)(None)
	uint32                                       TimeUTC;                                           // 0x600(0x4)(None)
	int32                                        NetUTC;                                            // 0x604(0x4)(None)
	bool                                         bIsOfficialServer;                                 // 0x608(0x1)(None)
	bool                                         bIsListenServer;                                   // 0x609(0x1)(None)
	bool                                         bIsDediServer;                                     // 0x60A(0x1)(None)
	bool                                         bIsServerRunningOnConsole;                         // 0x60B(0x1)(None)
	bool                                         bIsArkTributeAvailable;                            // 0x60C(0x1)(None)
	bool                                         bIsArkDownloadsAllowed;                            // 0x60D(0x1)(None)
	bool                                         bAllowThirdPersonPlayer;                           // 0x60E(0x1)(None)
	bool                                         bServerHardcore;                                   // 0x60F(0x1)(None)
	bool                                         bServerPVE;                                        // 0x610(0x1)(None)
	bool                                         bAutoPvE;                                          // 0x611(0x1)(None)
	bool                                         bServerCrosshair;                                  // 0x612(0x1)(None)
	bool                                         bServerForceNoHUD;                                 // 0x613(0x1)(None)
	bool                                         bFlyerPlatformAllowUnalignedDinoBasing;            // 0x614(0x1)(None)
	bool                                         bMapPlayerLocation;                                // 0x615(0x1)(None)
	bool                                         bPvEDisableFriendlyFire;                           // 0x616(0x1)(None)
	bool                                         bPvEAllowTribeWar;                                 // 0x617(0x1)(None)
	bool                                         bPvEAllowTribeWarCancel;                           // 0x618(0x1)(None)
	bool                                         bEnablePvPGamma;                                   // 0x619(0x1)(None)
	bool                                         bPreventDroppedItemPhysics;                        // 0x61A(0x1)(None)
	bool                                         bDisablePvEGamma;                                  // 0x61B(0x1)(None)
	int32                                        NumTamedDinos;                                     // 0x61C(0x4)(None)
	int32                                        MaxStructuresInRange;                              // 0x620(0x4)(None)
	float                                        DayCycleSpeedScale;                                // 0x624(0x4)(None)
	float                                        DayTimeSpeedScale;                                 // 0x628(0x4)(None)
	float                                        NightTimeSpeedScale;                               // 0x62C(0x4)(None)
	int32                                        StartTimeHour;                                     // 0x630(0x4)(None)
	float                                        PvEStructureDecayPeriodMultiplier;                 // 0x634(0x4)(None)
	float                                        PvEDinoDecayPeriodMultiplier;                      // 0x638(0x4)(None)
	float                                        PerPlatformMaxStructuresMultiplier;                // 0x63C(0x4)(None)
	float                                        ImplantSuicideCD;                                  // 0x640(0x4)(None)
	bool                                         bDisableStructureDecayPvE;                         // 0x644(0x1)(None)
	bool                                         bDisableDinoDecayPvE;                              // 0x645(0x1)(None)
	bool                                         bAllowCaveBuildingPvE;                             // 0x646(0x1)(None)
	bool                                         bAllowCaveBuildingPvP;                             // 0x647(0x1)(None)
	bool                                         bPreventDownloadSurvivors;                         // 0x648(0x1)(None)
	bool                                         bReachedPlatformStructureLimit;                    // 0x649(0x1)(None)
	bool                                         bAdminLogging;                                     // 0x64A(0x1)(None)
	bool                                         bPvPStructureDecay;                                // 0x64B(0x1)(None)
	bool                                         bPreventDownloadDinos;                             // 0x64C(0x1)(None)
	bool                                         bPreventDownloadItems;                             // 0x64D(0x1)(None)
	bool                                         bPreventUploadDinos;                               // 0x64E(0x1)(None)
	bool                                         bPreventUploadItems;                               // 0x64F(0x1)(None)
	bool                                         bPreventUploadSurvivors;                           // 0x650(0x1)(None)
	bool                                         bPreventMateBoost;                                 // 0x651(0x1)(None)
	bool                                         bPreventStructurePainting;                         // 0x652(0x1)(None)
	bool                                         bAllowCharacterCreation;                           // 0x653(0x1)(None)
	bool                                         bAllowSpawnPointSelection;                         // 0x654(0x1)(None)
	uint8                                        Pad_1642[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MaxTamedDinos;                                     // 0x658(0x4)(None)
	bool                                         bDisableSpawnAnimations;                           // 0x65C(0x1)(None)
	uint8                                        Pad_1643[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                PlayerListString;                                  // 0x660(0x10)(None)
	FMulticastInlineDelegateProperty_            OnPlayerListPopulated;                             // 0x670(0x10)(ZeroConstructor)
	float                                        GlobalSpoilingTimeMultiplier;                      // 0x680(0x4)(None)
	float                                        GlobalItemDecompositionTimeMultiplier;             // 0x684(0x4)(None)
	int32                                        MaxNumberOfPlayersInTribe;                         // 0x688(0x4)(None)
	float                                        TribeSlotReuseCooldown;                            // 0x68C(0x4)(None)
	float                                        GlobalCorpseDecompositionTimeMultiplier;           // 0x690(0x4)(None)
	float                                        EggHatchSpeedMultiplier;                           // 0x694(0x4)(None)
	class FName                                  ActiveEvent;                                       // 0x698(0x8)(None)
	bool                                         bAllowPaintingWithoutResources;                    // 0x6A0(0x1)(None)
	bool                                         bEnableExtraStructurePreventionVolumes;            // 0x6A1(0x1)(None)
	uint8                                        Pad_1645[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FItemCraftingCostOverride>     OverrideItemCraftingCosts;                         // 0x6A8(0x10)(ZeroConstructor)
	TArray<struct FItemMaxItemQuantityOverride>  OverrideItemMaxQuantity;                           // 0x6B8(0x10)(ZeroConstructor)
	bool                                         DisableRailgunPVP;                                 // 0x6C8(0x1)(None)
	uint8                                        Pad_1646[0xA7];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       PrivateNetworkTime;                                // 0x770(0x8)(None)
	double                                       LastServerSaveTime;                                // 0x778(0x8)(None)
	float                                        ServerSaveInterval;                                // 0x780(0x4)(None)
	float                                        TribeNameChangeCooldown;                           // 0x784(0x4)(None)
	float                                        PlatformSaddleBuildAreaBoundsMultiplier;           // 0x788(0x4)(None)
	bool                                         bAlwaysAllowStructurePickup;                       // 0x78C(0x1)(None)
	uint8                                        Pad_1647[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        StructurePickupTimeAfterPlacement;                 // 0x790(0x4)(None)
	float                                        StructurePickupHoldDuration;                       // 0x794(0x4)(None)
	bool                                         bAllowHideDamageSourceFromLogs;                    // 0x798(0x1)(None)
	uint8                                        Pad_1648[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FClassMultiplier>              DinoClassSpeedMultipliers;                         // 0x7A0(0x10)(None)
	TArray<struct FClassMultiplier>              TamedDinoClassSpeedMultipliers;                    // 0x7B0(0x10)(None)
	bool                                         bRiderDinoCollision;                               // 0x7C0(0x1)(None)
	uint8                                        Pad_1649[0x1F];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UAudioComponent*                       DynamicMusicAudioComponent;                        // 0x7E0(0x8)(ZeroConstructor)
	class UAudioComponent*                       DynamicMusicAudioComponent2;                       // 0x7E8(0x8)(ZeroConstructor)
	uint8                                        Pad_164A[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FLevelExperienceRamp>          LevelExperienceRampOverrides;                      // 0x800(0x10)(None)
	TArray<struct FEngramEntryOverride>          OverrideEngramEntries;                             // 0x810(0x10)(None)
	class UClass*                                CustomGameUITemplate;                              // 0x820(0x8)(ZeroConstructor)
	TArray<class FString>                        PreventDinoTameClassNames;                         // 0x828(0x10)(None)
	float                                        ListenServerTetherDistanceMultiplier;              // 0x838(0x4)(None)
	uint8                                        Pad_164B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                PGMapName;                                         // 0x840(0x10)(None)
	TArray<int32>                                SupportedSpawnRegions;                             // 0x850(0x10)(None)
	class UPaintingCache*                        PaintingCache;                                     // 0x860(0x8)(ZeroConstructor)
	class USoundBase*                            StaticOverrideMusic;                               // 0x868(0x8)(ZeroConstructor)
	bool                                         bEnableDeathTeamSpectator;                         // 0x870(0x1)(None)
	uint8                                        Pad_164D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               PlayerFloatingHUDOffset;                           // 0x878(0x18)(None)
	float                                        PlayerFloatingHUDOffsetScreenY;                    // 0x890(0x4)(None)
	float                                        StructureDamageRepairCooldown;                     // 0x894(0x4)(None)
	bool                                         bForceAllStructureLocking;                         // 0x898(0x1)(None)
	bool                                         bAllowCustomRecipes;                               // 0x899(0x1)(None)
	bool                                         bAllowRaidDinoFeeding;                             // 0x89A(0x1)(None)
	uint8                                        Pad_164E[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CustomRecipeEffectivenessMultiplier;               // 0x89C(0x4)(None)
	float                                        CustomRecipeSkillMultiplier;                       // 0x8A0(0x4)(None)
	uint8                                        Pad_164F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USoundBase*                            OverrideAreaMusic;                                 // 0x8A8(0x8)(ZeroConstructor)
	struct FVector                               OverrideAreaMusicPosition;                         // 0x8B0(0x18)(None)
	float                                        OverrideAreaMusicRange;                            // 0x8C8(0x4)(None)
	bool                                         bAllowUnclaimDinos;                                // 0x8CC(0x1)(None)
	uint8                                        Pad_1650[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FloatingHUDRange;                                  // 0x8D0(0x4)(None)
	float                                        FloatingChatRange;                                 // 0x8D4(0x4)(None)
	int32                                        ExtinctionEventTimeInterval;                       // 0x8D8(0x4)(None)
	float                                        RTSModeNumSelectableDinosScale;                    // 0x8DC(0x4)(None)
	float                                        RTSMaxRangeFromPlayerCharacterScale;               // 0x8E0(0x4)(None)
	float                                        ExtinctionEventPercent;                            // 0x8E4(0x4)(None)
	int32                                        ExtinctionEventSecondsRemaining;                   // 0x8E8(0x4)(None)
	bool                                         bDoExtinctionEvent;                                // 0x8EC(0x1)(None)
	uint8                                        Pad_1651[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        DestroyTamesOverLevelClamp;                        // 0x8F0(0x4)(None)
	uint8                                        Pad_1652[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FInventoryComponentDefaultItemsAppend> InventoryComponentAppends;                         // 0x8F8(0x10)(ZeroConstructor)
	bool                                         bPreventOfflinePvP;                                // 0x908(0x1)(None)
	bool                                         bPvPDinoDecay;                                     // 0x909(0x1)(None)
	bool                                         bAllowUnclaimDinosConfig;                          // 0x90A(0x1)(None)
	bool                                         bForceUseInventoryAppends;                         // 0x90B(0x1)(None)
	bool                                         bOverideStructurePlatformPrevention;               // 0x90C(0x1)(None)
	uint8                                        Pad_1653[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ItemStackSizeMultiplier;                           // 0x910(0x4)(None)
	uint8                                        Pad_1654[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<int32>                                PreventOfflinePvPLiveTeams;                        // 0x918(0x10)(None)
	TArray<int32>                                PreventOfflinePvPExpiringTeams;                    // 0x928(0x10)(None)
	TArray<float>                                PreventOfflinePvPExpiringTimes;                    // 0x938(0x10)(None)
	uint8                                        Pad_1655[0xA0];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bAllowAnyoneBabyImprintCuddle;                     // 0x9E8(0x1)(None)
	bool                                         bDisableImprintDinoBuff;                           // 0x9E9(0x1)(None)
	uint8                                        Pad_1656[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MaxPersonalTamedDinos;                             // 0x9EC(0x4)(None)
	uint8                                        Pad_1657[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                ClusterId;                                         // 0xA08(0x10)(None)
	uint8                                        Pad_1658[0x30];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                ServerSessionName;                                 // 0xA48(0x10)(None)
	bool                                         bPreventTribeAlliances;                            // 0xA58(0x1)(None)
	uint8                                        Pad_1659[0x19];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bServerUseDinoList;                                // 0xA72(0x1)(None)
	bool                                         bPvEAllowStructuresAtSupplyDrops;                  // 0xA73(0x1)(None)
	bool                                         bAllowForceNetUpdate;                              // 0xA74(0x1)(None)
	uint8                                        Pad_165A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinimumDinoReuploadInterval;                       // 0xA78(0x4)(None)
	float                                        HairGrowthSpeedMultiplier;                         // 0xA7C(0x4)(None)
	float                                        DinoHairGrowthSpeedMultiplier;                     // 0xA80(0x4)(None)
	float                                        FastDecayInterval;                                 // 0xA84(0x4)(None)
	class FString                                CachedSessionOwnerId;                              // 0xA88(0x10)(None)
	float                                        OxygenSwimSpeedStatMultiplier;                     // 0xA98(0x4)(None)
	uint8                                        Pad_165B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnHTTPGetResponse;                                 // 0xAA0(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnHTTPPostResponse;                                // 0xAB0(0x10)(ZeroConstructor)
	bool                                         bAllowMultipleAttachedC4;                          // 0xAC0(0x1)(None)
	bool                                         bCrossARKAllowForeignDinoDownloads;                // 0xAC1(0x1)(None)
	uint8                                        Pad_165C[0x16];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bUseCorpseLocator;                                 // 0xAD8(0x1)(None)
	bool                                         bEnablePlayerMoveThroughSleeping;                  // 0xAD9(0x1)(None)
	bool                                         bEnablePlayerMoveThroughAlly;                      // 0xADA(0x1)(None)
	bool                                         bDisableStructurePlacementCollision;               // 0xADB(0x1)(None)
	bool                                         bUseSingleplayerSettings;                          // 0xADC(0x1)(None)
	bool                                         bAllowPlatformSaddleMultiFloors;                   // 0xADD(0x1)(None)
	bool                                         bPreventSpawnAnimations;                           // 0xADE(0x1)(None)
	uint8                                        Pad_165D[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MaxAlliancesPerTribe;                              // 0xAE0(0x4)(None)
	int32                                        MaxTribesPerAlliance;                              // 0xAE4(0x4)(None)
	bool                                         bIsLegacyServer;                                   // 0xAE8(0x1)(None)
	bool                                         bDisableDinoDecayClaiming;                         // 0xAE9(0x1)(None)
	uint8                                        Pad_165E[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  UseStructurePreventionVolumeTag;                   // 0xAEC(0x8)(None)
	int32                                        MaxStructuresInSmallRadius;                        // 0xAF4(0x4)(None)
	float                                        RadiusStructuresInSmallRadius;                     // 0xAF8(0x4)(None)
	bool                                         bUseTameLimitForStructuresOnly;                    // 0xAFC(0x1)(None)
	bool                                         bDisableWirelessCrafting;                          // 0xAFD(0x1)(None)
	bool                                         bDisableWirelessCraftingForDinos;                  // 0xAFE(0x1)(None)
	bool                                         bDisableWirelessCraftingForPlayers;                // 0xAFF(0x1)(None)
	bool                                         bDisableWirelessCraftingForStructures;             // 0xB00(0x1)(None)
	uint8                                        Pad_165F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        WirelessCraftingRangeOverride;                     // 0xB04(0x4)(None)
	uint8                                        Pad_1660[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bLimitTurretsInRange;                              // 0xB14(0x1)(None)
	uint8                                        Pad_1661[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LimitTurretsRange;                                 // 0xB18(0x4)(None)
	int32                                        LimitTurretsNum;                                   // 0xB1C(0x4)(None)
	int32                                        LimitGeneratorsNum;                                // 0xB20(0x4)(None)
	float                                        LimitGeneratorsRange;                              // 0xB24(0x4)(None)
	int32                                        CropPlotStackLimit;                                // 0xB28(0x4)(None)
	bool                                         bDisablePhotoMode;                                 // 0xB2C(0x1)(None)
	uint8                                        Pad_1662[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        PhotoModeRangeLimit;                               // 0xB30(0x4)(None)
	bool                                         bForceAllowAllStructures;                          // 0xB34(0x1)(None)
	bool                                         bShowCreativeMode;                                 // 0xB35(0x1)(None)
	uint8                                        Pad_1663[0x22];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        PassiveTameIntervalMultiplier;                     // 0xB58(0x4)(None)
	uint8                                        Pad_1664[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UClass*>                        UniqueDinos;                                       // 0xB60(0x10)(ZeroConstructor)
	TArray<class FName>                          ActiveMissionTags;                                 // 0xB70(0x10)(None)
	uint32                                       MinimumUniqueDownloadInterval;                     // 0xB80(0x4)(None)
	uint32                                       MaximumUniqueDownloadInterval;                     // 0xB84(0x4)(None)
	bool                                         bIgnoreStructuresPreventionVolumes;                // 0xB88(0x1)(None)
	bool                                         bPreventOutOfTribePinCodeUse;                      // 0xB89(0x1)(None)
	uint8                                        Pad_1667[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FDinoDownloadData>             UniqueDownloads;                                   // 0xB90(0x10)(ZeroConstructor)
	TArray<struct FDataSet>                      GameDataSets;                                      // 0xBA0(0x10)(ZeroConstructor)
	class UPrimalWorldSettingsEventOverrides*    ActiveEventOverrides;                              // 0xBB0(0x8)(ZeroConstructor)
	bool                                         bIgnoreLimitMaxStructuresInRangeTypeFlag;          // 0xBB8(0x1)(None)
	uint8                                        Pad_1668[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FMassTeleportData>             MassTeleportQueue;                                 // 0xBC0(0x10)(ZeroConstructor)
	uint8                                        Pad_1669[0x70];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class FName, class UDataLayerInstance*> DataLayerMap;                                      // 0xC40(0x50)(ZeroConstructor)
	bool                                         bAllowLowGravitySpin;                              // 0xC90(0x1)(None)
	uint8                                        Pad_166A[0x17];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnDinoDownloaded;                                  // 0xCA8(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnDinoUploaded;                                    // 0xCB8(0x10)(ZeroConstructor)
	TArray<struct FWorldBuffPersistantData>      WorldBuffPersistantDatas;                          // 0xCC8(0x10)(None)
	float                                        TurretCopySettingsCooldown;                        // 0xCD8(0x4)(None)
	float                                        BaseHexagonRewardMultiplier;                       // 0xCDC(0x4)(None)
	float                                        HexagonRewardMultiplier;                           // 0xCE0(0x4)(None)
	float                                        HexagonCostMultiplier;                             // 0xCE4(0x4)(None)
	bool                                         bDisableHexagonStore;                              // 0xCE8(0x1)(None)
	bool                                         bHexStoreAllowOnlyEngramTradeOption;               // 0xCE9(0x1)(None)
	bool                                         bAllowSpeedLeveling;                               // 0xCEA(0x1)(None)
	bool                                         bAllowFlyerSpeedLeveling;                          // 0xCEB(0x1)(None)
	uint8                                        Pad_166B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FString>                        PreventBreedingForClassNames;                      // 0xCF0(0x10)(None)
	int32                                        LiveTuningReplicatedChunkSize;                     // 0xD00(0x4)(None)
	uint8                                        Pad_166C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FString>                        LiveTuningOverloadChunks;                          // 0xD08(0x10)(None)
	uint8                                        Pad_166D[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FString>                        PreventTransferForClassNames;                      // 0xD20(0x10)(None)
	int32                                        EnvironmentIndex;                                  // 0xD30(0x4)(None)
	int32                                        NextEnvironmentIndex;                              // 0xD34(0x4)(None)
	struct FColor                                FloatingPlatformProfileNameColor;                  // 0xD38(0x4)(None)
	struct FColor                                FloatingNameColor;                                 // 0xD3C(0x4)(None)
	double                                       NextMutagenTime;                                   // 0xD40(0x8)(None)
	int32                                        OverrideMaxExperiencePointsPlayer;                 // 0xD48(0x4)(None)
	int32                                        OverrideMaxExperiencePointsDino;                   // 0xD4C(0x4)(None)
	TArray<int32>                                DeferredExplorerNoteUnlockQueue;                   // 0xD50(0x10)(None)
	bool                                         bDisableCustomFoldersInTributeInventories;         // 0xD60(0x1)(None)
	uint8                                        Pad_166E[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TWeakObjectPtr<class AActor>>         ForcedRelevantPOIActors;                           // 0xD68(0x10)(ZeroConstructor)
	bool                                         bDisableRailgunPVP;                                // 0xD78(0x1)(None)
	uint8                                        Pad_166F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinimumTimebetweeninventoryRetrieval;              // 0xD7C(0x4)(None)
	float                                        WildFollowerSpawnChanceMultiplier;                 // 0xD80(0x4)(None)
	float                                        WildFollowerSpawnCountMultiplier;                  // 0xD84(0x4)(None)
	bool                                         bDisableDinoItemBlacklist;                         // 0xD88(0x1)(None)
	uint8                                        Pad_1670[0x57];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       RealtimeThrottledTickTimeAmount;                   // 0xDE0(0x8)(None)
	uint8                                        Pad_1671[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FNetChangeDefaultPropertyValue> CurrentDefaultPropertyValueUpdates;                // 0xDF0(0x10)(ZeroConstructor)
	uint8                                        Pad_1672[0x30];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AShooterGameState* GetDefaultObj();

	void StartMassTeleport(const struct FMassTeleportData& MassTeleportData, const struct FTeleportDestination& TeleportDestination, class AActor* InitiatingActor, const TArray<class AActor*>& TeleportActors, class UClass* BuffToApply, float TeleportDuration, float TeleportRadius, bool bTeleportingSnapsToGround, bool bMaintainRotation, bool ReturnValue);
	void ShouldMassTeleportMoveActor(class AActor* ForActor, const struct FMassTeleportData& WithMassTeleportData, bool ReturnValue);
	void SetNextEnvironmentIndex(int32 NewNextEnvironmentIndex);
	void SetEnvironmentIndex(int32 NewEnvironmentIndex);
	void RemoveRelevantPOIActor(class AActor* POI);
	void QueueExplorerNoteForDeferredUnlock(int32 ExplorerNoteIndex);
	void PrintCDODebugForChar(class APrimalCharacter* ReferenceChar);
	void PrintCDODebug(class APrimalCharacter* ReferenceChar, const struct FCDODebugData& CDODebugData);
	void PrepareActorForMassTeleport(class AActor* PrepareActor, const struct FMassTeleportData& WithMassTeleportData);
	void OnRep_SupportedSpawnRegions();
	void OnRep_ReplicateLocalizedChatRadius();
	void OnRep_ReplicateLiveTuningOverloadChunks();
	void OnRep_CurrentDefaultPropertyValueUpdates();
	void OnNewClassInitialized(class UClass* ForClass);
	void OnHUDNotification(const struct FHUDNotification& Notification, bool ReturnValue);
	void NetUpdateOfflinePvPLiveTeams(const TArray<int32>& NewPreventOfflinePvPLiveTeams);
	void NetUpdateOfflinePvPExpiringTeams(const TArray<int32>& NewPreventOfflinePvPExpiringTeams, const TArray<float>& NewPreventOfflinePvPExpiringTimes);
	void NetSpawnFoliageVFXActorAtLocationAndDoFoliageInteraction(class UClass* AnActorClass, const struct FVector_NetQuantize& AtLocation, const struct FRotator_NetQuantize& AtRotation, class AActor* EffectOwnerToIgnore, float MaxRangeToReplicate, class USceneComponent* AttachToComponent, int32 DataIndex, class FName AttachSocketName, bool bOnlySendToEffectOwner, bool IsSimpleFoliageInteraction, const struct FVector& FoliageOrigin_ImpactPoint, const struct FVector& TraceEndpoint);
	void NetAddFloatingText(const struct FVector& AtLocation, const class FString& FloatingTextString, const struct FColor& FloatingTextColor, float ScaleX, float ScaleY, float TextLifeSpan, const struct FVector& TextVelocity, float MinScale, float FadeInTime, float FadeOutTime, int32 OnlySendToTeamID);
	void NetAddFloatingDamageText(const struct FVector& AtLocation, int32 DamageAmount, int32 FromTeamID, int32 OnlySendToTeamID);
	void Multi_SpawnCosmeticActor(class UClass* SpawnActorOfClass, const struct FVector& SpawnAtLocation, const struct FRotator& SpawnWithRotation);
	void LoadedWorld();
	void IsValidMassTeleportData(const struct FMassTeleportData& CheckData, bool ReturnValue);
	void IsUniqueDinoAlreadySpawned(TSoftClassPtr<class APrimalDinoCharacter> UniqueDino, bool ReturnValue);
	void IsTeamIDInvincible(int32 TargetingTeamID, bool bInvincibleOnlyWhenOffline, bool ReturnValue);
	void IsMassTeleportInProgress(class AActor* InitiatingActor, bool ReturnValue);
	void IsEngramClassHidden(class UClass* ForItemClass, bool ReturnValue);
	void HTTPPostRequest(const class FString& InURL, const class FString& Content);
	void HTTPGetRequest(const class FString& InURL);
	void HandleInitializedGameState();
	void GetStartTimeHour(int32 ReturnValue);
	void GetOfflineDamagePreventionTime(int32 TargetingTeamID, float ReturnValue);
	void GetNetworkTimeDelta(class AShooterGameState* GameState, double NetTime, bool bTimeUntil, double ReturnValue);
	void GetItemMaxQuantityOverride(class UClass* ForClass, const struct FMaxItemQuantityOverride& OutMaxQuantity, bool ReturnValue);
	void GetIniArray(const class FString& SectionName, const TArray<struct FGameIniData>& ReturnValue);
	void GetGamePhase(enum class EGamePhase ReturnValue);
	void GetDayTimeString(const class FString& ReturnValue);
	void GetDayCycleSpeed(float ReturnValue);
	void GetCleanServerSessionName(const class FString& ReturnValue);
	void ForceStartMatch(bool PreventFinishTheMatch, bool UseQuetzalBus);
	void DisplayWelcomeUI();
	void CDOGetPrintStringForObjectProperty(class UObject* TheObject, class FName PropertyName, const class FString& OutString, bool ReturnValue);
	void CDOGetPrintStringForObjectProperties(class UObject* TheObject, const TArray<class FName>& PropertyNames, const class FString& OutString, bool ReturnValue);
	void CancelMassTeleport(class AActor* WithInitiatingActor, bool ReturnValue);
	void BPPreGameplaySetup();
	void BPNetSpawnActorAtLocation(class UClass* AnActorClass, const struct FVector& AtLocation, const struct FRotator& AtRotation, class AActor* EffectOwnerToIgnore, float MaxRangeToReplicate, class USceneComponent* AttachToComponent, int32 DataIndex, class FName AttachSocketName, bool bOnlySendToEffectOwner);
	void BPDrawGameStateHUD(class AShooterHUD* HUD);
	void BaseSpawnBuffAndAttachToCharacter(class UClass* Buff, class APrimalCharacter* PrimalCharacter, float ExperiencePoints, class APrimalBuff* ReturnValue);
	void BaseProjectWorldToScreenPosition(const struct FVector& WorldLocation, class APlayerController* ThePC, const struct FVector2D& ReturnValue);
	void BaseIsTribeID(int32 TeamID, bool ReturnValue);
	void BaseGetCustomActors(class FName SearchCustomTag, class ACustomActorList* ReturnValue);
	void BaseGetAllShooterControllers(const TArray<class AShooterPlayerController*>& ReturnValue);
	void BaseGetAllShooterCharactersOfTeam(int32 KillerTeam, const TArray<class AShooterCharacter*>& ReturnValue);
	void BaseGetAllShooterCharacters(const TArray<class AShooterCharacter*>& ReturnValue);
	void BaseGetAllDinoCharactersOfTeam(int32 KillerTeam, const TArray<class APrimalDinoCharacter*>& ReturnValue);
	void BaseDrawTileOnCanvas(class AShooterHUD* HUD, class UTexture* Tex, float X, float Y, float XL, float YL, float U, float V, float UL, float VL, const struct FColor& DrawColor);
	void AllowDownloadDino(TSoftClassPtr<class APrimalDinoCharacter> TheDinoClass, bool ReturnValue);
	void AllowDinoTame(class APrimalDinoCharacter* DinoChar, class AShooterPlayerController* ForPC, bool ReturnValue);
	void AllowDinoClassTame(class UClass* DinoCharClass, class AShooterPlayerController* ForPC, bool ReturnValue);
	void AddTokens(int32 Quantity, int32 byTribe);
	void AddRelevantPOIActor(class AActor* POI);
	void AddFloatingText(const struct FVector& AtLocation, const class FString& FloatingTextString, const struct FColor& FloatingTextColor, float ScaleX, float ScaleY, float TextLifeSpan, const struct FVector& TextVelocity, float MinScale, float FadeInTime, float FadeOutTime);
};

// 0x0 (0xE30 - 0xE30)
// Class ShooterGame.BattleGameState
class ABattleGameState : public AShooterGameState
{
public:

	static class UClass* StaticClass();
	static class ABattleGameState* GetDefaultObj();

};

// 0xE0 (0x760 - 0x680)
// Class ShooterGame.BeamWeaponComponent
class UBeamWeaponComponent : public UPrimitiveComponent
{
public:
	class UParticleSystem*                       ParticleSystemTemplate;                            // 0x680(0x8)(ZeroConstructor)
	class UParticleSystem*                       ChargeupParticleSystemTemplate;                    // 0x688(0x8)(ZeroConstructor)
	class UParticleSystem*                       BurstWhenFiredSystemTemplate;                      // 0x690(0x8)(ZeroConstructor)
	class UParticleSystem*                       ImpactSystemTemplate;                              // 0x698(0x8)(ZeroConstructor)
	float                                        Duration;                                          // 0x6A0(0x4)(None)
	float                                        DamageRadius;                                      // 0x6A4(0x4)(None)
	class UClass*                                DamageType;                                        // 0x6A8(0x8)(ZeroConstructor)
	float                                        DamageDelay;                                       // 0x6B0(0x4)(None)
	float                                        BaseDamage;                                        // 0x6B4(0x4)(None)
	float                                        Length;                                            // 0x6B8(0x4)(None)
	bool                                         IsPenetrating;                                     // 0x6BC(0x1)(None)
	uint8                                        Pad_1689[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TargetTrackingSpeed;                               // 0x6C0(0x4)(None)
	bool                                         UseOwnerForward;                                   // 0x6C4(0x1)(None)
	uint8                                        Pad_168A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Offset;                                            // 0x6C8(0x4)(None)
	float                                        ChargeupTime;                                      // 0x6CC(0x4)(None)
	bool                                         WhenChargingWaitForCallToFire;                     // 0x6D0(0x1)(None)
	bool                                         DeactivateChargeupOnFiring;                        // 0x6D1(0x1)(None)
	uint8                                        Pad_168C[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            BeamStoppedFiringEvent;                            // 0x6D8(0x10)(ZeroConstructor)
	TWeakObjectPtr<class AActor>                 BeamTarget;                                        // 0x6E8(0x8)(ZeroConstructor)
	class UParticleSystemComponent*              ParticleComp;                                      // 0x6F0(0x8)(ZeroConstructor)
	class UParticleSystemComponent*              ChargeUpComp;                                      // 0x6F8(0x8)(ZeroConstructor)
	class UParticleSystemComponent*              ImpactComp;                                        // 0x700(0x8)(ZeroConstructor)
	uint8                                        Pad_168F[0x58];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBeamWeaponComponent* GetDefaultObj();

	void UpdateBeamVisuals();
	void StopFiring();
	void StartFiring();
	void StartCharging();
	void SetTarget(class AActor* Target);
	void GetTarget(class AActor* ReturnValue);
	void GetParticleSystem(class UParticleSystemComponent* ReturnValue);
	void GetLastStoppedFiringTime(double ReturnValue);
	void GetIsFiring(bool ReturnValue);
	void GetIsCharging(bool ReturnValue);
	void GetImpactParticleSystem(class UParticleSystemComponent* ReturnValue);
	void GetChargeupParticleSystem(class UParticleSystemComponent* ReturnValue);
	void GetBeamEndLocation(const struct FVector& ReturnValue);
};

// 0x30 (0xE8 - 0xB8)
// Class ShooterGame.BeamWeaponController
class UBeamWeaponController : public UActorComponent
{
public:
	TArray<struct FComponentReference>           BeamWeapons;                                       // 0xB8(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            BeamStoppedFiringEvent;                            // 0xC8(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            BeamsStoppedFiringEvent;                           // 0xD8(0x10)(ZeroConstructor)

	static class UClass* StaticClass();
	static class UBeamWeaponController* GetDefaultObj();

	void StopFiringBeams();
	void StartChargingBeams(bool ReturnValue);
	void StartChargingBeam(bool ReturnValue);
	void OnBeamStoppedFiringHandler(class UBeamWeaponComponent* BeamWeaponComp);
	void GetBeamWeaponComponents(const TArray<class UBeamWeaponComponent*>& ReturnValue);
	void FireBeams(bool ReturnValue);
	void FireBeam(bool ReturnValue);
};

// 0x10 (0x768 - 0x758)
// Class ShooterGame.BinocularsWidgetUI
class UBinocularsWidgetUI : public UPrimalUI
{
public:
	class FName                                  GamepadUnlockButtonName;                           // 0x758(0x8)(None)
	uint8                                        Pad_16C6[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBinocularsWidgetUI* GetDefaultObj();

	void GetDinoParentClass(class APrimalCharacter* Char, class UClass* ReturnValue);
	void GetCharUsesStat(class APrimalCharacter* Char, enum class EPrimalCharacterStatusValue ValueType, bool ReturnValue);
	void GetCharTorpidMaxStatus(class APrimalCharacter* Char, float ReturnValue);
	void GetCharTorpidCurrentStatus(class APrimalCharacter* Char, float ReturnValue);
	void GetCharNumStatPointsString(class APrimalCharacter* Char, enum class EPrimalCharacterStatusValue ValueType, const class FString& ReturnValue);
	void GetCharHealthMaxStatus(class APrimalCharacter* Char, float ReturnValue);
	void GetCharHealthCurrentStatus(class APrimalCharacter* Char, float ReturnValue);
};

// 0x90 (0x548 - 0x4B8)
// Class ShooterGame.BiomeZoneSettings
class ABiomeZoneSettings : public AActor
{
public:
	class FString                                BiomeZoneName;                                     // 0x4B8(0x10)(None)
	float                                        FinalTemperatureMultiplier;                        // 0x4C8(0x4)(None)
	float                                        FinalTemperatureExponent;                          // 0x4CC(0x4)(None)
	float                                        FinalTemperatureAddition;                          // 0x4D0(0x4)(None)
	float                                        PreOffsetTemperatureMultiplier;                    // 0x4D4(0x4)(None)
	float                                        PreOffsetTemperatureExponent;                      // 0x4D8(0x4)(None)
	float                                        PreOffsetTemperatureAddition;                      // 0x4DC(0x4)(None)
	float                                        AboveTemperatureOffsetThreshold;                   // 0x4E0(0x4)(None)
	float                                        AboveTemperatureOffsetMultiplier;                  // 0x4E4(0x4)(None)
	float                                        AboveTemperatureOffsetExponent;                    // 0x4E8(0x4)(None)
	float                                        BelowTemperatureOffsetThreshold;                   // 0x4EC(0x4)(None)
	float                                        BelowTemperatureOffsetMultiplier;                  // 0x4F0(0x4)(None)
	float                                        BelowTemperatureOffsetExponent;                    // 0x4F4(0x4)(None)
	float                                        AbsoluteTemperatureOverride;                       // 0x4F8(0x4)(None)
	uint8                                        bPreventCrops : 1;                                 // Mask: 0x1, PropSize: 0x10x4FC(0x1)(None)
	uint8                                        BitPad_117 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_16CB[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        EggRangeMaximumNumberOverride;                     // 0x500(0x4)(None)
	int32                                        EggMaximumNumberOverride;                          // 0x504(0x4)(None)
	float                                        EggChanceToSpawnOverride;                          // 0x508(0x4)(None)
	float                                        EggIntervalUnstasisChanceToSpawnOverride;          // 0x50C(0x4)(None)
	TArray<class UClass*>                        OverrideEggLimitsDinoClasses;                      // 0x510(0x10)(ZeroConstructor)
	int32                                        BiomeZonePriority;                                 // 0x520(0x4)(None)
	float                                        MaxMultiplier;                                     // 0x524(0x4)(None)
	class USoundBase*                            OverrideCombatMusicDay;                            // 0x528(0x8)(ZeroConstructor)
	class USoundBase*                            OverrideCombatMusicNight;                          // 0x530(0x8)(ZeroConstructor)
	class USoundBase*                            OverrideCombatMusicDay_Heavy;                      // 0x538(0x8)(ZeroConstructor)
	class USoundBase*                            OverrideCombatMusicNight_Heavy;                    // 0x540(0x8)(ZeroConstructor)

	static class UClass* StaticClass();
	static class ABiomeZoneSettings* GetDefaultObj();

};

// 0x1B8 (0x6C0 - 0x508)
// Class ShooterGame.BiomeZoneVolume
class ABiomeZoneVolume : public AVolume
{
public:
	class FString                                BiomeZoneName;                                     // 0x508(0x10)(None)
	enum class EBiomeZone                        BiomeZone;                                         // 0x518(0x1)(None)
	uint8                                        Pad_16EA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FinalTemperatureMultiplier;                        // 0x51C(0x4)(None)
	float                                        FinalTemperatureExponent;                          // 0x520(0x4)(None)
	float                                        FinalTemperatureAddition;                          // 0x524(0x4)(None)
	float                                        PreOffsetTemperatureMultiplier;                    // 0x528(0x4)(None)
	float                                        PreOffsetTemperatureExponent;                      // 0x52C(0x4)(None)
	float                                        PreOffsetTemperatureAddition;                      // 0x530(0x4)(None)
	float                                        AboveTemperatureOffsetThreshold;                   // 0x534(0x4)(None)
	float                                        AboveTemperatureOffsetMultiplier;                  // 0x538(0x4)(None)
	float                                        AboveTemperatureOffsetExponent;                    // 0x53C(0x4)(None)
	float                                        BelowTemperatureOffsetThreshold;                   // 0x540(0x4)(None)
	float                                        BelowTemperatureOffsetMultiplier;                  // 0x544(0x4)(None)
	float                                        BelowTemperatureOffsetExponent;                    // 0x548(0x4)(None)
	float                                        AbsoluteTemperatureOverride;                       // 0x54C(0x4)(None)
	float                                        AbsoluteMaxTemperature;                            // 0x550(0x4)(None)
	float                                        AbsoluteMinTemperature;                            // 0x554(0x4)(None)
	uint8                                        bPreventCrops : 1;                                 // Mask: 0x1, PropSize: 0x10x558(0x1)(None)
	uint8                                        bIsOutside : 1;                                    // Mask: 0x2, PropSize: 0x10x558(0x1)(None)
	uint8                                        bRemoveBuffWhenLeavingVolume : 1;                  // Mask: 0x4, PropSize: 0x10x558(0x1)(None)
	uint8                                        BitPad_118 : 5;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_16EC[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        EggRangeMaximumNumberOverride;                     // 0x55C(0x4)(None)
	int32                                        EggMaximumNumberOverride;                          // 0x560(0x4)(None)
	float                                        EggChanceToSpawnOverride;                          // 0x564(0x4)(None)
	float                                        EggIntervalUnstasisChanceToSpawnOverride;          // 0x568(0x4)(None)
	uint8                                        Pad_16ED[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UClass*>                        OverrideEggLimitsDinoClasses;                      // 0x570(0x10)(ZeroConstructor)
	int32                                        BiomeZonePriority;                                 // 0x580(0x4)(None)
	float                                        MaxMultiplier;                                     // 0x584(0x4)(None)
	float                                        AbsoluteWindOverride;                              // 0x588(0x4)(None)
	float                                        PreOffsetWindMultiplier;                           // 0x58C(0x4)(None)
	float                                        PreOffsetWindExponent;                             // 0x590(0x4)(None)
	float                                        PreOffsetWindAddition;                             // 0x594(0x4)(None)
	float                                        AboveWindOffsetThreshold;                          // 0x598(0x4)(None)
	float                                        AboveWindOffsetMultiplier;                         // 0x59C(0x4)(None)
	float                                        AboveWindOffsetExponent;                           // 0x5A0(0x4)(None)
	float                                        BelowWindOffsetThreshold;                          // 0x5A4(0x4)(None)
	float                                        BelowWindOffsetMultiplier;                         // 0x5A8(0x4)(None)
	float                                        BelowWindOffsetExponent;                           // 0x5AC(0x4)(None)
	float                                        FinalWindMultiplier;                               // 0x5B0(0x4)(None)
	float                                        FinalWindExponent;                                 // 0x5B4(0x4)(None)
	float                                        FinalWindAddition;                                 // 0x5B8(0x4)(None)
	uint8                                        Pad_16F0[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                BiomeCustomDatas;                                  // 0x5C0(0x10)(None)
	float                                        StatusAdjustmentRateMultipliersPositive[0xC];      // 0x5D0(0x30)(None)
	float                                        StatusAdjustmentRateMultipliersNegative[0xC];      // 0x600(0x30)(None)
	bool                                         bOnlyApplyAdjustmentRateValuesOutdoors;            // 0x630(0x1)(None)
	bool                                         bStatusAdjustRateValues;                           // 0x631(0x1)(None)
	bool                                         bDisableDayTransitionSounds;                       // 0x632(0x1)(None)
	uint8                                        Pad_16F1[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class APrimalBuff>             BuffToGive;                                        // 0x638(0x30)(ZeroConstructor)
	TSoftClassPtr<class APrimalBuff>             BuffToPreventActiveUse;                            // 0x668(0x30)(ZeroConstructor)
	class USoundBase*                            OverrideCombatMusicDay;                            // 0x698(0x8)(ZeroConstructor)
	class USoundBase*                            OverrideCombatMusicDay_Heavy;                      // 0x6A0(0x8)(ZeroConstructor)
	class USoundBase*                            OverrideCombatMusicNight;                          // 0x6A8(0x8)(ZeroConstructor)
	class USoundBase*                            OverrideCombatMusicNight_Heavy;                    // 0x6B0(0x8)(ZeroConstructor)
	class USoundBase*                            ForceMusicInBiome;                                 // 0x6B8(0x8)(ZeroConstructor)

	static class UClass* StaticClass();
	static class ABiomeZoneVolume* GetDefaultObj();

	void OnEndOverlap(class AActor* OverlappedActor, class AActor* Actor);
	void OnBeginOverlap(class AActor* OverlappedActor, class AActor* Actor);
	void IsPointUnderwater(class UWorld* ForWorld, const struct FVector& AtPoint, bool bFastPath, float MinimumWaterHeight, bool bIgnoreVacuumStructures, bool bIgnorePainCausingVolumes, bool ReturnValue);
	void IsPointInVacuumBase(class UWorld* ForWorld, const struct FVector& AtPoint, bool ReturnValue);
	void GetWaterVolumeAtPoint(class UWorld* ForWorld, const struct FVector& AtPoint, bool bFastPath, float MinimumWaterHeight, bool bIgnoreVacuumStructures, bool bIgnorePainCausingVolumes, class APhysicsVolume* ReturnValue);
	void GetPhysicsVolumeAtLocation(class UWorld* ForWorld, const struct FVector& AtPoint, bool bFastPath, class APhysicsVolume* ReturnValue);
	void GetBiomeZoneVolume(class UWorld* World, const struct FVector& Location, class ABiomeZoneVolume* ReturnValue);
	void GetAllBiomeZones(class UWorld* World, const TArray<class ABiomeZoneVolume*>& BiomeZones);
};

// 0x0 (0x28 - 0x28)
// Class ShooterGame.BiomeZoneVolumeEffectUtility
class UBiomeZoneVolumeEffectUtility : public UObject
{
public:

	static class UClass* StaticClass();
	static class UBiomeZoneVolumeEffectUtility* GetDefaultObj();

	void SpawnRelevantEffect(const TArray<struct FBiomeZoneVolumeEffect>& Effects, class AActor* AttachTo, const struct FVector& Location, bool bIsImpactActor);
	void SpawnImpactEffect(class UWorld* World, const struct FHitResult& HitResult, const struct FBiomeZoneImpactEffect& ImpactEffect, class AActor* Owner, class AActor* ReturnValue);
	void GetRelevantEffect(const TArray<struct FBiomeZoneVolumeEffect>& Effects, class AActor* SourceActor, const struct FVector& ForLocation, bool bIsImpactActor, const struct FBiomeZoneVolumeEffect& ReturnValue);
};

// 0x8 (0xA0 - 0x98)
// Class ShooterGame.BTService_FindTarget
class UBTService_FindTarget : public UBTService_BlackboardBase
{
public:
	bool                                         bDontSet;                                          // 0x98(0x1)(None)
	uint8                                        Pad_1719[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTService_FindTarget* GetDefaultObj();

};

// 0x0 (0x70 - 0x70)
// Class ShooterGame.BTService_UpdateAggro
class UBTService_UpdateAggro : public UBTService
{
public:

	static class UClass* StaticClass();
	static class UBTService_UpdateAggro* GetDefaultObj();

};

// 0x0 (0x70 - 0x70)
// Class ShooterGame.BTTask_AttackTarget
class UBTTask_AttackTarget : public UBTTaskNode
{
public:

	static class UClass* StaticClass();
	static class UBTTask_AttackTarget* GetDefaultObj();

};

// 0x38 (0xD0 - 0x98)
// Class ShooterGame.BTTask_GetRandomWanderDestination
class UBTTask_GetRandomWanderDestination : public UBTTask_BlackboardBase
{
public:
	struct FVector                               LocOverride;                                       // 0x98(0x18)(None)
	float                                        RandomOffsetMultiplier;                            // 0xB0(0x4)(None)
	bool                                         bUseRandomNegativeXDir;                            // 0xB4(0x1)(None)
	bool                                         bOrientRandOffsetByRotation;                       // 0xB5(0x1)(None)
	uint8                                        Pad_1726[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRotator                              OrientRandOffsetByRotation;                        // 0xB8(0x18)(None)

	static class UClass* StaticClass();
	static class UBTTask_GetRandomWanderDestination* GetDefaultObj();

};

// 0x0 (0xD0 - 0xD0)
// Class ShooterGame.BTTask_RotateToFaceBBEntryWithGrab
class UBTTask_RotateToFaceBBEntryWithGrab : public UBTTask_RotateToFaceBBEntry
{
public:

	static class UClass* StaticClass();
	static class UBTTask_RotateToFaceBBEntryWithGrab* GetDefaultObj();

};

// 0x0 (0x758 - 0x758)
// Class ShooterGame.BuildingUI
class UBuildingUI : public UPrimalUI
{
public:

	static class UClass* StaticClass();
	static class UBuildingUI* GetDefaultObj();

	void GetStructurePlacer(class APrimalStructurePlacer* ReturnValue);
	void GetStructureIcon(class APrimalStructure* Structure, class UTexture2D* ReturnValue);
};

// 0x8 (0x38 - 0x30)
// Class ShooterGame.CachedDB
class UCachedDB : public UDataAsset
{
public:
	bool                                         bForceRepopulateAll;                               // 0x30(0x1)(None)
	uint8                                        Pad_1739[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCachedDB* GetDefaultObj();

	void PopulateDBFromEditor();
	void PopulateDB(const TArray<struct FAssetData>& CustomAssetList);
};

// 0x50 (0x88 - 0x38)
// Class ShooterGame.ShooterWeaponDB
class UShooterWeaponDB : public UCachedDB
{
public:
	TMap<TSoftClassPtr<class AShooterWeapon>, struct FShooterWeaponDBEntry> CachedWeaponData;                                  // 0x38(0x50)(ZeroConstructor)

	static class UClass* StaticClass();
	static class UShooterWeaponDB* GetDefaultObj();

};

// 0x50 (0x88 - 0x38)
// Class ShooterGame.PrimalDinoDB
class UPrimalDinoDB : public UCachedDB
{
public:
	TMap<TSoftClassPtr<class APrimalDinoCharacter>, struct FPrimalDinoDBEntry> CachedDinoData;                                    // 0x38(0x50)(ZeroConstructor)

	static class UClass* StaticClass();
	static class UPrimalDinoDB* GetDefaultObj();

};

// 0x50 (0x88 - 0x38)
// Class ShooterGame.PrimalStructureDB
class UPrimalStructureDB : public UCachedDB
{
public:
	TMap<TSoftClassPtr<class APrimalStructure>, struct FPrimalStructureDBEntry> CachedStructureData;                               // 0x38(0x50)(ZeroConstructor)

	static class UClass* StaticClass();
	static class UPrimalStructureDB* GetDefaultObj();

};

// 0x50 (0x88 - 0x38)
// Class ShooterGame.PrimalInventoryDB
class UPrimalInventoryDB : public UCachedDB
{
public:
	TMap<TSoftClassPtr<class UPrimalInventoryComponent>, struct FPrimalInventoryDBEntry> CachedInventoryData;                               // 0x38(0x50)(ZeroConstructor)

	static class UClass* StaticClass();
	static class UPrimalInventoryDB* GetDefaultObj();

};

// 0x50 (0x88 - 0x38)
// Class ShooterGame.PrimalMissionDB
class UPrimalMissionDB : public UCachedDB
{
public:
	TMap<TSoftClassPtr<class AMissionType>, struct FPrimalMissionDBEntry> CachedMissionData;                                 // 0x38(0x50)(ZeroConstructor)

	static class UClass* StaticClass();
	static class UPrimalMissionDB* GetDefaultObj();

};

// 0x0 (0x80 - 0x80)
// Class ShooterGame.GenerateCacheDBForModsCommandlet
class UGenerateCacheDBForModsCommandlet : public UCommandlet
{
public:

	static class UClass* StaticClass();
	static class UGenerateCacheDBForModsCommandlet* GetDefaultObj();

};

// 0x8 (0x50 - 0x48)
// Class ShooterGame.CameraModifier_Climbing
class UCameraModifier_Climbing : public UCameraModifier
{
public:
	class AShooterWeapon_Climb*                  OwningWeapon;                                      // 0x48(0x8)(ZeroConstructor)

	static class UClass* StaticClass();
	static class UCameraModifier_Climbing* GetDefaultObj();

};

// 0x28 (0x50 - 0x28)
// Class ShooterGame.CDOLiveUpdateData
class UCDOLiveUpdateData : public UObject
{
public:
	TArray<struct FNetChangeDefaultPropertyValue> CDOLiveUpdates;                                    // 0x28(0x10)(ZeroConstructor)
	struct FCDODebugData                         CDODebugData;                                      // 0x38(0x18)(None)

	static class UClass* StaticClass();
	static class UCDOLiveUpdateData* GetDefaultObj();

};

// 0x30 (0x360 - 0x330)
// Class ShooterGame.CharacterViewPanelWidget
class UCharacterViewPanelWidget : public UPrimalUserWidget
{
public:
	class FString                                PreviewWidgetName;                                 // 0x330(0x10)(None)
	uint8                                        Pad_1744[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCharacterViewPanelWidget* GetDefaultObj();

	void RefreshPreviewWidget();
};

// 0x38 (0x910 - 0x8D8)
// Class ShooterGame.CheatFunctionInfoEntryButton
class UCheatFunctionInfoEntryButton : public UDataListEntryButton
{
public:
	uint8                                        bIsCustom : 1;                                     // Mask: 0x1, PropSize: 0x10x8D8(0x1)(None)
	uint8                                        BitPad_11A : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1747[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                FunctionName;                                      // 0x8E0(0x10)(None)
	bool                                         bCenterDisplayName;                                // 0x8F0(0x1)(None)
	uint8                                        Pad_1748[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          DisplayStringSelectedColor;                        // 0x8F4(0x10)(None)
	float                                        FolderNameTextClipOffset;                          // 0x904(0x4)(None)
	uint8                                        Pad_1749[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCheatFunctionInfoEntryButton* GetDefaultObj();

};

// 0x548 (0xA00 - 0x4B8)
// Class ShooterGame.PointOfInterestActor
class APointOfInterestActor : public AActor
{
public:
	uint8                                        Pad_175A[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class USceneComponent*                       PointRootComp;                                     // 0x4C8(0x8)(ZeroConstructor)
	class USphereComponent*                      PointUseSphereComp;                                // 0x4D0(0x8)(ZeroConstructor)
	class UTextRenderComponent*                  PointTextComp;                                     // 0x4D8(0x8)(ZeroConstructor)
	class UTextRenderComponent*                  PointTitleTextComp;                                // 0x4E0(0x8)(ZeroConstructor)
	uint8                                        Pad_175C[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPointOfInterestData                  MyPointOfInterestData;                             // 0x4F0(0x1E0)(ZeroConstructor)
	struct FPointOfInterestCompanionBehavior     MyPointOfInterestCompanionBehavior;                // 0x6D0(0x300)(ZeroConstructor)
	struct FVector                               UseSphereLocOffset;                                // 0x9D0(0x18)(None)
	float                                        UseSphereRadius;                                   // 0x9E8(0x4)(None)
	float                                        TitleTextZOffset;                                  // 0x9EC(0x4)(None)
	uint8                                        bHasBeenViewed : 1;                                // Mask: 0x1, PropSize: 0x10x9F0(0x1)(None)
	uint8                                        bSyncWithPointManager : 1;                         // Mask: 0x2, PropSize: 0x10x9F0(0x1)(None)
	uint8                                        bPreventViewMultiUseEntry : 1;                     // Mask: 0x4, PropSize: 0x10x9F0(0x1)(None)
	uint8                                        bDebugPointActor_Persistent : 1;                   // Mask: 0x8, PropSize: 0x10x9F0(0x1)(None)
	uint8                                        bDebugPointActor_Single : 1;                       // Mask: 0x10, PropSize: 0x10x9F0(0x1)(None)
	uint8                                        bDebugPointActor_ClearDebugLines : 1;              // Mask: 0x20, PropSize: 0x10x9F0(0x1)(None)
	uint8                                        BitPad_11B : 2;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1762[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class APointOfInterestManagerList*           MyPointManager;                                    // 0x9F8(0x8)(ZeroConstructor)

	static class UClass* StaticClass();
	static class APointOfInterestActor* GetDefaultObj();

	void RefreshPointData();
	void IsPointOfInterestValid(bool ReturnValue);
	void GetMyPointOfInterestData(const struct FPointOfInterestData& ReturnValue);
	void GetMyPointOfInterestCompanionBehavior(const struct FPointOfInterestCompanionBehavior& ReturnValue);
};

// 0x60 (0xA60 - 0xA00)
// Class ShooterGame.CompanionEventTrigger
class ACompanionEventTrigger : public APointOfInterestActor
{
public:
	class UBoxComponent*                         BoxTriggerComp;                                    // 0xA00(0x8)(ZeroConstructor)
	class UTextRenderComponent*                  EventTitleTextComp;                                // 0xA08(0x8)(ZeroConstructor)
	struct FCompanionEventData                   MyEventData;                                       // 0xA10(0x50)(ZeroConstructor)

	static class UClass* StaticClass();
	static class ACompanionEventTrigger* GetDefaultObj();

	void OnEndOverlap(class AActor* OverlappedActor, class AActor* Actor);
	void OnBeginOverlap(class AActor* OverlappedActor, class AActor* Actor);
};

// 0x18 (0x770 - 0x758)
// Class ShooterGame.ConsoleCommandButtonWidget
class UConsoleCommandButtonWidget : public UBaseSelectableButtonWidget
{
public:
	uint8                                        Pad_17D5[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UConsoleCommandButtonWidget* GetDefaultObj();

};

// 0x58 (0x388 - 0x330)
// Class ShooterGame.ContextMenu
class UContextMenu : public UPrimalUserWidget
{
public:
	FDelegateProperty_                           OnPopulateMenu;                                    // 0x330(0x10)(ZeroConstructor)
	FDelegateProperty_                           OnPopulateMenuCustom;                              // 0x340(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnActiveItemChanged;                               // 0x350(0x10)(ZeroConstructor)
	class FName                                  CustomName;                                        // 0x360(0x8)(None)
	uint8                                        Pad_1808[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UContextMenu* GetDefaultObj();

	void SetActiveItem(class UContextMenuItem* Item);
	void PopulateContextMenuCustom__DelegateSignature(class UContextMenu* ContextMenu, class FName MenuName);
	void PopulateContextMenu__DelegateSignature(class UContextMenu* ContextMenu);
	void GetActiveItem(class UContextMenuItem* ReturnValue);
	void CloseMenu(bool CloseParents);
	void ActiveMenuItemChanged__DelegateSignature(class UContextMenu* Menu, class UContextMenuItem* NewItem, class UContextMenuItem* OldItem);
};

// 0xF0 (0x420 - 0x330)
// Class ShooterGame.ContextMenuItem
class UContextMenuItem : public UPrimalUserWidget
{
public:
	FDelegateProperty_                           OnGetMenuContentEvent;                             // 0x330(0x10)(ZeroConstructor)
	FDelegateProperty_                           OnGetMenuContentEventCustom;                       // 0x340(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnExecuteMainAction;                               // 0x350(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnExecuteMainActionCustom;                         // 0x360(0x10)(ZeroConstructor)
	class FName                                  SubmenuMenuAnchorName;                             // 0x370(0x8)(None)
	class FName                                  SubmenuIndicatorName;                              // 0x378(0x8)(None)
	class FName                                  ShortcutKeyWidgetName;                             // 0x380(0x8)(None)
	class FName                                  SwitchName;                                        // 0x388(0x8)(None)
	class FName                                  SwitchContainerName;                               // 0x390(0x8)(None)
	enum class EUContextMenuItemSwitchMode       SwitchType;                                        // 0x398(0x1)(None)
	bool                                         IsSwitchedOn;                                      // 0x399(0x1)(None)
	uint8                                        Pad_183B[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  CustomName;                                        // 0x39C(0x8)(None)
	uint8                                        Pad_183C[0x7C];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UContextMenuItem* GetDefaultObj();

	void SetSubmenuEnabled(bool bEnabled);
	void SetShortcutKey(int32 ComboKeyIdx, const struct FKey& Key);
	void SetJustification(enum class ETextJustify Value);
	void SetCaption(class FText Caption);
	void OnGetContextMenuContent(class UWidget* ReturnValue);
	void OnButtonClickedEventObjectCustom__DelegateSignature(class UContextMenuItem* ContextMenuItem, class FName SelectedOption);
	void OnButtonClickedEventObject__DelegateSignature(class UContextMenuItem* ContextMenuItem);
	void OnButtonClicked();
	void OnActiveMenuItemChanged(class UContextMenu* ContextMenu, class UContextMenuItem* NewActiveItem, class UContextMenuItem* OldActiveItem);
	void GetSubmenuEnabled(bool ReturnValue);
	void GetSubmenuContentCustom__DelegateSignature(class UContextMenuItem* ContextMenuItem, class FName SelectedOption, class UContextMenu* ReturnValue);
	void GetSubmenuContent__DelegateSignature(class UContextMenuItem* ContextMenuItem, class UContextMenu* ReturnValue);
	void GetJustification(enum class ETextJustify ReturnValue);
	void GetCaption(class FText ReturnValue);
};

// 0x18 (0x438 - 0x420)
// Class ShooterGame.ContextMenuItem_Sort
class UContextMenuItem_Sort : public UContextMenuItem
{
public:
	class FName                                  SorDirSwitcherName;                                // 0x420(0x8)(None)
	uint8                                        Pad_1840[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UContextMenuItem_Sort* GetDefaultObj();

};

// 0x38 (0x458 - 0x420)
// Class ShooterGame.ContextMenuItem_Spinner
class UContextMenuItem_Spinner : public UContextMenuItem
{
public:
	FMulticastInlineDelegateProperty_            OnValueCommitted;                                  // 0x420(0x10)(ZeroConstructor)
	uint8                                        Pad_185B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MinValue;                                          // 0x434(0x4)(None)
	int32                                        MaxValue;                                          // 0x438(0x4)(None)
	uint8                                        Pad_185E[0x1C];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UContextMenuItem_Spinner* GetDefaultObj();

	void SetValue(int32 NewValue);
	void SetMinValue(int32 NewValue);
	void SetMaxValue(int32 NewValue);
	void OnSpinnerValueCommitedEvent__DelegateSignature(class UContextMenuItem_Spinner* Item, int32 InValue, enum class ETextCommit CommitMethod);
	void HandleOnTextCommited(class FText Text, enum class ETextCommit CommitMethod);
	void HandleOnTextChanged(class FText Text);
	void HandleOnButtonIncreaseClicked();
	void HandleOnButtonDecreaseClicked();
	void GetValue(int32 ReturnValue);
	void GetMinValue(int32 ReturnValue);
	void GetMaxValue(int32 ReturnValue);
};

// 0x20 (0x3A8 - 0x388)
// Class ShooterGame.ContextMenu_DinoGroupEntry
class UContextMenu_DinoGroupEntry : public UContextMenu
{
public:
	class UClass*                                ItemClass_SimpleButton;                            // 0x388(0x8)(ZeroConstructor)
	class UClass*                                ItemClass_SimpleCaption;                           // 0x390(0x8)(ZeroConstructor)
	class UClass*                                ItemClass_Spinner;                                 // 0x398(0x8)(ZeroConstructor)
	class UClass*                                SubmenuClass;                                      // 0x3A0(0x8)(ZeroConstructor)

	static class UClass* StaticClass();
	static class UContextMenu_DinoGroupEntry* GetDefaultObj();

	void PopulateRootMenu(class UContextMenu* ContextMenu);
	void HandleActionSetGroup(class UContextMenuItem* Item);
	void HandleActionRemoveDino(class UContextMenuItem* Item);
	void HandleActionRemoveClass(class UContextMenuItem* Item);
};

// 0x8 (0x390 - 0x388)
// Class ShooterGame.ContextMenu_InventorySort
class UContextMenu_InventorySort : public UContextMenu
{
public:
	class UClass*                                ItemClass_SortButton;                              // 0x388(0x8)(ZeroConstructor)

	static class UClass* StaticClass();
	static class UContextMenu_InventorySort* GetDefaultObj();

	void PopulateRootMenu(class UContextMenu* ContextMenu);
	void HandleActionWeight(class UContextMenuItem* Item);
	void HandleActionUnsort(class UContextMenuItem* Item);
	void HandleActionType(class UContextMenuItem* Item);
	void HandleActionSpoilTimer(class UContextMenuItem* Item);
	void HandleActionAlphabetical(class UContextMenuItem* Item);
};

// 0x50 (0x3D8 - 0x388)
// Class ShooterGame.ContextMenu_PrimalItem
class UContextMenu_PrimalItem : public UContextMenu
{
public:
	class UClass*                                ItemClass_SimpleButton;                            // 0x388(0x8)(ZeroConstructor)
	class UClass*                                ItemClass_SimpleCaption;                           // 0x390(0x8)(ZeroConstructor)
	class UClass*                                ItemClass_Spinner;                                 // 0x398(0x8)(ZeroConstructor)
	class UClass*                                SubmenuClass;                                      // 0x3A0(0x8)(ZeroConstructor)
	uint8                                        Pad_191C[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SplitAmountValue;                                  // 0x3B8(0x4)(None)
	int32                                        SplitAmountMax;                                    // 0x3BC(0x4)(None)
	int32                                        CraftAmountValue;                                  // 0x3C0(0x4)(None)
	int32                                        CraftAmountMax;                                    // 0x3C4(0x4)(None)
	int32                                        CraftQuantityValue;                                // 0x3C8(0x4)(None)
	int32                                        CraftQuantityMax;                                  // 0x3CC(0x4)(None)
	uint8                                        bIsFreeCraftingMode : 1;                           // Mask: 0x1, PropSize: 0x10x3D0(0x1)(None)
	uint8                                        Pad_191F[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UContextMenu_PrimalItem* GetDefaultObj();

	void PopulateSubmenuSplitStack(class UContextMenu* ContextMenu);
	void PopulateSubmenuSplitAmount(class UContextMenu* ContextMenu);
	void PopulateSubmenuRemove(class UContextMenu* ContextMenu);
	void PopulateSubmenuCustom(class UContextMenu* ContextMenu, class FName ContextItemName);
	void PopulateSubmenuCraftAmount(class UContextMenu* ContextMenu);
	void PopulateRootMenu(class UContextMenu* ContextMenu);
	void PopulateFolderMenu(class UContextMenu* ContextMenu);
	void PopulateCraftMenu(class UContextMenu* ContextMenu);
	void HandleSplitAmountValueCommit(class UContextMenuItem_Spinner* Item, int32 InValue, enum class ETextCommit CommitMethod);
	void HandleOnGetSubmenuSplitStackContent(class UContextMenuItem* MenuItem, class UContextMenu* ReturnValue);
	void HandleOnGetSubmenuSplitAmountContent(class UContextMenuItem* MenuItem, class UContextMenu* ReturnValue);
	void HandleOnGetSubmenuRemoveContent(class UContextMenuItem* MenuItem, class UContextMenu* ReturnValue);
	void HandleOnGetSubmenuCustomContent(class UContextMenuItem* MenuItem, class FName ContextItemName, class UContextMenu* ReturnValue);
	void HandleOnGetSubmenuCraftContent(class UContextMenuItem* MenuItem, class UContextMenu* ReturnValue);
	void HandleOnGetSubmenuCraftAmountContent(class UContextMenuItem* MenuItem, class UContextMenu* ReturnValue);
	void HandleCraftAmountValueCommit(class UContextMenuItem_Spinner* Item, int32 InValue, enum class ETextCommit CommitMethod);
	void HandleActionUse(class UContextMenuItem* Item);
	void HandleActionUnequip(class UContextMenuItem* Item);
	void HandleActionTransfer(class UContextMenuItem* Item);
	void HandleActionTrack(class UContextMenuItem* Item);
	void HandleActionSplitOne(class UContextMenuItem* Item);
	void HandleActionSplitHalf(class UContextMenuItem* Item);
	void HandleActionSplitAmount(class UContextMenuItem* Item);
	void HandleActionSplitAll(class UContextMenuItem* Item);
	void HandleActionSetCraftQuantity(class UContextMenuItem* Item);
	void HandleActionRepair(class UContextMenuItem* Item);
	void HandleActionRenameFolder(class UContextMenuItem* Item);
	void HandleActionRemoveSkin(class UContextMenuItem* Item);
	void HandleActionRemoveAmmo(class UContextMenuItem* Item);
	void HandleActionRemoveAccessory(class UContextMenuItem* Item);
	void HandleActionFavorite(class UContextMenuItem* Item);
	void HandleActionFastInventoryInFolder(class UContextMenuItem* Item);
	void HandleActionEquipAllInFolder(class UContextMenuItem* Item);
	void HandleActionEquip(class UContextMenuItem* Item);
	void HandleActionDiscard(class UContextMenuItem* Item);
	void HandleActionDeleteFolder(class UContextMenuItem* Item);
	void HandleActionCustom(class UContextMenuItem* Item, class FName ContextItemName);
	void HandleActionCraftOne(class UContextMenuItem* Item);
	void HandleActionCraftAmount(class UContextMenuItem* Item);
	void HandleActionCraftAll(class UContextMenuItem* Item);
	void BPUpdateCanUse();
};

// 0x8 (0x4E0 - 0x4D8)
// Class ShooterGame.CorruptedAvatarAttackCoordinator
class ACorruptedAvatarAttackCoordinator : public AAIAttackCoordinator
{
public:
	uint8                                        Pad_195C[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ACorruptedAvatarAttackCoordinator* GetDefaultObj();

};

// 0xB0 (0xE8 - 0x38)
// Class ShooterGame.CursorSettings
class UCursorSettings : public UDeveloperSettings
{
public:
	struct FRuntimeFloatCurve                    AnalogCursorAccelerationCurve;                     // 0x38(0x88)(None)
	float                                        MaxAnalogCursorSpeed;                              // 0xC0(0x4)(None)
	float                                        MaxAnalogCursorSpeedWhenHovered;                   // 0xC4(0x4)(None)
	float                                        AnalogCursorDragCoefficient;                       // 0xC8(0x4)(None)
	float                                        AnalogCursorDragCoefficientWhenHovered;            // 0xCC(0x4)(None)
	float                                        MinAnalogCursorSpeed;                              // 0xD0(0x4)(None)
	float                                        AnalogCursorDeadZone;                              // 0xD4(0x4)(None)
	float                                        AnalogCursorAccelerationMultiplier;                // 0xD8(0x4)(None)
	float                                        AnalogCursorSize;                                  // 0xDC(0x4)(None)
	bool                                         bUseEngineAnalogCursor;                            // 0xE0(0x1)(None)
	bool                                         bAnalogCursorNoAcceleration;                       // 0xE1(0x1)(None)
	uint8                                        Pad_1963[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCursorSettings* GetDefaultObj();

};

// 0x18 (0x4D0 - 0x4B8)
// Class ShooterGame.CustomActorList
class ACustomActorList : public AInfo
{
public:
	TArray<class AActor*>                        ActorList;                                         // 0x4B8(0x10)(ZeroConstructor)
	uint8                                        Pad_1968[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ACustomActorList* GetDefaultObj();

	void DestroyActors();
};

// 0x60 (0x740 - 0x6E0)
// Class ShooterGame.CustomButtonWidget
class UCustomButtonWidget : public UButton
{
public:
	struct FCustomButtonWidgetStyle              ExtendedWidgetStyle;                               // 0x6E0(0x48)(None)
	bool                                         IsToggleButton;                                    // 0x728(0x1)(None)
	bool                                         IsToggledOn;                                       // 0x729(0x1)(None)
	uint8                                        Pad_1977[0x16];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCustomButtonWidget* GetDefaultObj();

	void SetToggledState(bool IsToggled);
	void SetIsToggleButton(bool IsToggle);
	void GetToggledState(bool ReturnValue);
	void GetIsToggleButton(bool ReturnValue);
	void BPSetToggledState(bool IsToggled);
};

// 0x3960 (0x3F20 - 0x5C0)
// Class ShooterGame.ShooterGameMode
class AShooterGameMode : public APrimalGameMode
{
public:
	uint8                                        Pad_1B1E[0x108];                                   // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                BanFileName;                                       // 0x6C8(0x10)(None)
	uint8                                        Pad_1B1F[0x188];                                   // Fixing Size After Last Property  [ Dumper-7 ]
	class UShooterCheatManager*                  ServerCheatManager;                                // 0x860(0x8)(ZeroConstructor)
	float                                        ForceLoadWorldSeconds;                             // 0x868(0x4)(None)
	uint8                                        Pad_1B20[0x1C];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class URCONServer*                           RCONSocket;                                        // 0x888(0x8)(ZeroConstructor)
	class FString                                PlayersJoinNoCheckFilename;                        // 0x890(0x10)(None)
	class FString                                PlayersExclusiveCheckFilename;                     // 0x8A0(0x10)(None)
	class UShooterCheatManager*                  GlobalCommandsCheatManager;                        // 0x8B0(0x8)(ZeroConstructor)
	uint8                                        Pad_1B21[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                CheckGlobalEnablesURL;                             // 0x8C8(0x10)(None)
	class UDatabase_LoginData*                   Database_LoginDataRef;                             // 0x8D8(0x8)(ZeroConstructor)
	class UDatabase_PubSub_GeneralNotifications* PubSub_GeneralNotificationsRef;                    // 0x8E0(0x8)(ZeroConstructor)
	uint8                                        Pad_1B23[0x178];                                   // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bGlobalDisableLoginLockCheck;                      // 0xA60(0x1)(None)
	bool                                         bTempDisableLoginLockCheck;                        // 0xA61(0x1)(None)
	uint8                                        Pad_1B24[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                MyServerId;                                        // 0xA68(0x10)(None)
	uint8                                        Pad_1B25[0x70];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FTribeData>                    TribesData;                                        // 0xAE8(0x10)(ZeroConstructor)
	TArray<class APrimalDinoCharacter*>          ActivelyTamingDinos;                               // 0xAF8(0x10)(ZeroConstructor)
	bool                                         bAutoCreateNewPlayerData;                          // 0xB08(0x1)(None)
	uint8                                        Pad_1B26[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DifficultyValue;                                   // 0xB10(0x4)(None)
	float                                        DifficultyValueMin;                                // 0xB14(0x4)(None)
	float                                        DifficultyValueMax;                                // 0xB18(0x4)(None)
	float                                        ProximityRadius;                                   // 0xB1C(0x4)(None)
	float                                        ProximityRadiusUnconsiousScale;                    // 0xB20(0x4)(None)
	uint8                                        Pad_1B27[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                CheatClass;                                        // 0xB28(0x8)(ZeroConstructor)
	bool                                         bIsOfficialServer;                                 // 0xB30(0x1)(None)
	bool                                         bIsCurrentlySavingWorld;                           // 0xB31(0x1)(None)
	bool                                         bIsConsoleUnOfficialPCServer;                      // 0xB32(0x1)(None)
	bool                                         bServerAllowArkDownload;                           // 0xB33(0x1)(None)
	uint8                                        Pad_1B28[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bAlwaysNotifyPlayerLeft;                           // 0xB36(0x1)(None)
	bool                                         bAlwaysNotifyPlayerJoined;                         // 0xB37(0x1)(None)
	bool                                         bServerHardcore;                                   // 0xB38(0x1)(None)
	uint8                                        Pad_1B29[0x34];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bEnableCryoSicknessPVE;                            // 0xB6D(0x1)(None)
	uint8                                        Pad_1B2A[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CryopodNerfDamageMult;                             // 0xB70(0x4)(None)
	float                                        CryopodNerfDuration;                               // 0xB74(0x4)(None)
	bool                                         bEnableMeshBitingProtection;                       // 0xB78(0x1)(None)
	uint8                                        Pad_1B2B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CryopodNerfIncomingDamageMultPercent;              // 0xB7C(0x4)(None)
	uint8                                        Pad_1B2D[0x48];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ResourcesRespawnPeriodMultiplier;                  // 0xBC8(0x4)(None)
	float                                        KickIdlePlayersPeriod;                             // 0xBCC(0x4)(None)
	float                                        MateBoostEffectMultiplier;                         // 0xBD0(0x4)(None)
	float                                        AutoSavePeriodMinutes;                             // 0xBD4(0x4)(None)
	float                                        XPMultiplier;                                      // 0xBD8(0x4)(None)
	class FName                                  ActiveEvent;                                       // 0xBDC(0x8)(None)
	float                                        TribeNameChangeCooldown;                           // 0xBE4(0x4)(None)
	float                                        PlatformSaddleBuildAreaBoundsMultiplier;           // 0xBE8(0x4)(None)
	bool                                         bAlwaysAllowStructurePickup;                       // 0xBEC(0x1)(None)
	uint8                                        Pad_1B2F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        StructurePickupTimeAfterPlacement;                 // 0xBF0(0x4)(None)
	float                                        StructurePickupHoldDuration;                       // 0xBF4(0x4)(None)
	bool                                         bAllowHideDamageSourceFromLogs;                    // 0xBF8(0x1)(None)
	uint8                                        Pad_1B30[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        KillXPMultiplier;                                  // 0xBFC(0x4)(None)
	float                                        HarvestXPMultiplier;                               // 0xC00(0x4)(None)
	float                                        CraftXPMultiplier;                                 // 0xC04(0x4)(None)
	float                                        GenericXPMultiplier;                               // 0xC08(0x4)(None)
	float                                        SpecialXPMultiplier;                               // 0xC0C(0x4)(None)
	float                                        AlphaKillXPMultiplier;                             // 0xC10(0x4)(None)
	float                                        CaveKillXPMultiplier;                              // 0xC14(0x4)(None)
	float                                        WildKillXPMultiplier;                              // 0xC18(0x4)(None)
	float                                        BossKillXPMultiplier;                              // 0xC1C(0x4)(None)
	float                                        TamedKillXPMultiplier;                             // 0xC20(0x4)(None)
	float                                        UnclaimedKillXPMultiplier;                         // 0xC24(0x4)(None)
	float                                        ExplorerNoteXPMultiplier;                          // 0xC28(0x4)(None)
	uint8                                        Pad_1B32[0x84];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UPrimalPlayerData*>             PlayerDatas;                                       // 0xCB0(0x10)(ZeroConstructor)
	uint8                                        Pad_1B33[0xE];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bForceRespawnDinos;                                // 0xCCE(0x1)(None)
	uint8                                        Pad_1B35[0x29];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnCharacterPossessedByPlayer;                      // 0xCF8(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnCharacterUnpossessedByPlayer;                    // 0xD08(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnShooterCharacterSpawned;                         // 0xD18(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnShooterCharacterDied;                            // 0xD28(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnMissionTriggerBeginOverlap;                      // 0xD38(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnMissionTriggerEndOverlap;                        // 0xD48(0x10)(ZeroConstructor)
	float                                        TamedDinoDamageMultiplier;                         // 0xD58(0x4)(None)
	float                                        DinoDamageMultiplier;                              // 0xD5C(0x4)(None)
	float                                        PlayerDamageMultiplier;                            // 0xD60(0x4)(None)
	float                                        StructureDamageMultiplier;                         // 0xD64(0x4)(None)
	float                                        PlayerResistanceMultiplier;                        // 0xD68(0x4)(None)
	float                                        DinoResistanceMultiplier;                          // 0xD6C(0x4)(None)
	float                                        TamedDinoResistanceMultiplier;                     // 0xD70(0x4)(None)
	float                                        StructureResistanceMultiplier;                     // 0xD74(0x4)(None)
	bool                                         bJoinInProgressGamesAsSpectator;                   // 0xD78(0x1)(None)
	uint8                                        Pad_1B37[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TamingSpeedMultiplier;                             // 0xD7C(0x4)(None)
	float                                        HarvestAmountMultiplier;                           // 0xD80(0x4)(None)
	float                                        HarvestHealthMultiplier;                           // 0xD84(0x4)(None)
	float                                        PlayerCharacterWaterDrainMultiplier;               // 0xD88(0x4)(None)
	float                                        PlayerCharacterFoodDrainMultiplier;                // 0xD8C(0x4)(None)
	float                                        DinoCharacterFoodDrainMultiplier;                  // 0xD90(0x4)(None)
	float                                        RaidDinoCharacterFoodDrainMultiplier;              // 0xD94(0x4)(None)
	float                                        PlayerCharacterStaminaDrainMultiplier;             // 0xD98(0x4)(None)
	float                                        DinoCharacterStaminaDrainMultiplier;               // 0xD9C(0x4)(None)
	float                                        PlayerCharacterHealthRecoveryMultiplier;           // 0xDA0(0x4)(None)
	float                                        DinoCharacterHealthRecoveryMultiplier;             // 0xDA4(0x4)(None)
	float                                        CarnivoreNaturalTargetingRangeMultiplier;          // 0xDA8(0x4)(None)
	float                                        CarnivorePlayerAggroMultiplier;                    // 0xDAC(0x4)(None)
	float                                        HerbivoreNaturalTargetingRangeMultiplier;          // 0xDB0(0x4)(None)
	float                                        HerbivorePlayerAggroMultiplier;                    // 0xDB4(0x4)(None)
	bool                                         AIForceTargetPlayers;                              // 0xDB8(0x1)(None)
	bool                                         AIForceOverlapCheck;                               // 0xDB9(0x1)(None)
	uint8                                        Pad_1B3E[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bDisableSaveLoad;                                  // 0xDC0(0x1)(None)
	bool                                         bDisableXP;                                        // 0xDC1(0x1)(None)
	bool                                         bDisableDynamicMusic;                              // 0xDC2(0x1)(None)
	uint8                                        Pad_1B47[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FLevelExperienceRamp>          LevelExperienceRampOverrides;                      // 0xDC8(0x10)(None)
	TArray<int32>                                OverridePlayerLevelEngramPoints;                   // 0xDD8(0x10)(None)
	TArray<int32>                                ExcludeItemIndices;                                // 0xDE8(0x10)(None)
	TArray<struct FEngramEntryOverride>          OverrideEngramEntries;                             // 0xDF8(0x10)(None)
	TArray<struct FEngramEntryOverride>          OverrideNamedEngramEntries;                        // 0xE08(0x10)(None)
	TArray<struct FEngramEntryAutoUnlock>        EngramEntryAutoUnlocks;                            // 0xE18(0x10)(None)
	TArray<class FString>                        PreventDinoTameClassNames;                         // 0xE28(0x10)(None)
	TArray<struct FClassMultiplier>              DinoClassStaminaMultipliers;                       // 0xE38(0x10)(None)
	TArray<struct FClassMultiplier>              TamedDinoClassStaminaMultipliers;                  // 0xE48(0x10)(None)
	TArray<struct FClassMultiplier>              DinoClassSpeedMultipliers;                         // 0xE58(0x10)(None)
	TArray<struct FClassMultiplier>              TamedDinoClassSpeedMultipliers;                    // 0xE68(0x10)(None)
	TArray<struct FDinoSpawnWeightMultiplier>    DinoSpawnWeightMultipliers;                        // 0xE78(0x10)(None)
	TArray<struct FClassMultiplier>              DinoClassResistanceMultipliers;                    // 0xE88(0x10)(None)
	TArray<struct FClassMultiplier>              TamedDinoClassResistanceMultipliers;               // 0xE98(0x10)(None)
	TArray<struct FClassMultiplier>              DinoClassDamageMultipliers;                        // 0xEA8(0x10)(None)
	TArray<struct FClassMultiplier>              TamedDinoClassDamageMultipliers;                   // 0xEB8(0x10)(None)
	TArray<struct FClassMultiplier>              HarvestResourceItemAmountClassMultipliers;         // 0xEC8(0x10)(None)
	TArray<struct FClassNameReplacement>         NPCReplacements;                                   // 0xED8(0x10)(None)
	float                                        PvPZoneStructureDamageMultiplier;                  // 0xEE8(0x4)(None)
	bool                                         bOnlyAllowSpecifiedEngrams;                        // 0xEEC(0x1)(None)
	uint8                                        Pad_1B4A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        OverrideMaxExperiencePointsPlayer;                 // 0xEF0(0x4)(None)
	int32                                        OverrideMaxExperiencePointsDino;                   // 0xEF4(0x4)(None)
	float                                        GlobalSpoilingTimeMultiplier;                      // 0xEF8(0x4)(None)
	float                                        GlobalItemDecompositionTimeMultiplier;             // 0xEFC(0x4)(None)
	float                                        GlobalCorpseDecompositionTimeMultiplier;           // 0xF00(0x4)(None)
	float                                        MaxFallSpeedMultiplier;                            // 0xF04(0x4)(None)
	bool                                         bAutoPvETimer;                                     // 0xF08(0x1)(None)
	bool                                         bAutoPvEUseSystemTime;                             // 0xF09(0x1)(None)
	uint8                                        Pad_1B4B[0xA];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AutoPvEStartTimeSeconds;                           // 0xF14(0x4)(None)
	float                                        AutoPvEStopTimeSeconds;                            // 0xF18(0x4)(None)
	uint8                                        Pad_1B4C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AHibernationManager*                   HibernationManager;                                // 0xF20(0x8)(ZeroConstructor)
	int32                                        TributeItemExpirationSeconds;                      // 0xF28(0x4)(None)
	int32                                        TributeDinoExpirationSeconds;                      // 0xF2C(0x4)(None)
	int32                                        TributeCharacterExpirationSeconds;                 // 0xF30(0x4)(None)
	uint8                                        Pad_1B4D[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MaxTributeItems;                                   // 0xF3C(0x4)(None)
	int32                                        MaxTributeDinos;                                   // 0xF40(0x4)(None)
	int32                                        MaxTributeCharacters;                              // 0xF44(0x4)(None)
	bool                                         bIncreasePvPRespawnInterval;                       // 0xF48(0x1)(None)
	uint8                                        Pad_1B4E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        IncreasePvPRespawnIntervalCheckPeriod;             // 0xF4C(0x4)(None)
	float                                        IncreasePvPRespawnIntervalMultiplier;              // 0xF50(0x4)(None)
	float                                        IncreasePvPRespawnIntervalBaseAmount;              // 0xF54(0x4)(None)
	float                                        ResourceNoReplenishRadiusStructures;               // 0xF58(0x4)(None)
	float                                        ResourceNoReplenishRadiusPlayers;                  // 0xF5C(0x4)(None)
	float                                        CropGrowthSpeedMultiplier;                         // 0xF60(0x4)(None)
	float                                        LayEggIntervalMultiplier;                          // 0xF64(0x4)(None)
	float                                        PoopIntervalMultiplier;                            // 0xF68(0x4)(None)
	float                                        CropDecaySpeedMultiplier;                          // 0xF6C(0x4)(None)
	bool                                         bAllowChatFromDeadNonAdmins;                       // 0xF70(0x1)(None)
	bool                                         bAllowDisablingSpectator;                          // 0xF71(0x1)(None)
	bool                                         bPvEDisableFriendlyFire;                           // 0xF72(0x1)(None)
	bool                                         bFlyerPlatformAllowUnalignedDinoBasing;            // 0xF73(0x1)(None)
	bool                                         bAllowUnclaimDinos;                                // 0xF74(0x1)(None)
	uint8                                        Pad_1B53[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MaxPerTribePlatformSaddleStructureLimit;           // 0xF78(0x4)(None)
	int32                                        MaxPlatformSaddleStructureLimit;                   // 0xF7C(0x4)(None)
	int32                                        MaxDinoBaseLevel;                                  // 0xF80(0x4)(None)
	int32                                        MaxNumberOfPlayersInTribe;                         // 0xF84(0x4)(None)
	float                                        TribeSlotReuseCooldown;                            // 0xF88(0x4)(None)
	float                                        MatingIntervalMultiplier;                          // 0xF8C(0x4)(None)
	float                                        EggHatchSpeedMultiplier;                           // 0xF90(0x4)(None)
	float                                        BabyMatureSpeedMultiplier;                         // 0xF94(0x4)(None)
	float                                        BabyFoodConsumptionSpeedMultiplier;                // 0xF98(0x4)(None)
	uint8                                        Pad_1B58[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        PerLevelStatsMultiplier_Player[0xC];               // 0xFA0(0x30)(None)
	float                                        PerLevelStatsMultiplier_DinoTamed[0xC];            // 0xFD0(0x30)(None)
	float                                        PerLevelStatsMultiplier_DinoTamed_Add[0xC];        // 0x1000(0x30)(None)
	float                                        PerLevelStatsMultiplier_DinoTamed_Affinity[0xC];   // 0x1030(0x30)(None)
	float                                        PerLevelStatsMultiplier_DinoWild[0xC];             // 0x1060(0x30)(None)
	int32                                        MutagenLevelBoost[0xC];                            // 0x1090(0x30)(None)
	int32                                        MutagenLevelBoost_Bred[0xC];                       // 0x10C0(0x30)(None)
	int32                                        ItemStatClamps[0x8];                               // 0x10F0(0x20)(None)
	int32                                        MaxGateFrameOnSaddles;                             // 0x1110(0x4)(None)
	int32                                        MaxHexagonsPerCharacter;                           // 0x1114(0x4)(None)
	bool                                         bCustomGameModeAllowSpectatorJoinAfterMatchStart;  // 0x1118(0x1)(None)
	uint8                                        Pad_1B5B[0x1107];                                  // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bGameplayLogEnabled;                               // 0x2220(0x1)(None)
	bool                                         bServerGameLogEnabled;                             // 0x2221(0x1)(None)
	uint8                                        Pad_1B5C[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                BonusSupplyCrateItemClass;                         // 0x2228(0x8)(ZeroConstructor)
	float                                        BonusSupplyCrateItemGiveInterval;                  // 0x2230(0x4)(None)
	float                                        StructureDamageRepairCooldown;                     // 0x2234(0x4)(None)
	float                                        CustomRecipeEffectivenessMultiplier;               // 0x2238(0x4)(None)
	float                                        CustomRecipeSkillMultiplier;                       // 0x223C(0x4)(None)
	class FString                                BonusSupplyCrateItemString;                        // 0x2240(0x10)(None)
	bool                                         MaxDifficulty;                                     // 0x2250(0x1)(None)
	bool                                         bPvEAllowTribeWar;                                 // 0x2251(0x1)(None)
	bool                                         bPvEAllowTribeWarCancel;                           // 0x2252(0x1)(None)
	bool                                         bAllowCustomRecipes;                               // 0x2253(0x1)(None)
	bool                                         bPassiveDefensesDamageRiderlessDinos;              // 0x2254(0x1)(None)
	uint8                                        Pad_1B5D[0xB];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bEnableDeathTeamSpectator;                         // 0x2260(0x1)(None)
	bool                                         bTribeStoreCharacterConfiguration;                 // 0x2261(0x1)(None)
	uint8                                        Pad_1B5E[0xF6];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MaxTribeLogs;                                      // 0x2358(0x4)(None)
	uint8                                        Pad_1B5F[0x1C];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bDisableFriendlyFire;                              // 0x2378(0x1)(None)
	bool                                         bAllowInactiveTribes;                              // 0x2379(0x1)(None)
	bool                                         bForceMapPlayerLocation;                           // 0x237A(0x1)(None)
	uint8                                        Pad_1B60[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DinoHarvestingDamageMultiplier;                    // 0x237C(0x4)(None)
	float                                        PlayerHarvestingDamageMultiplier;                  // 0x2380(0x4)(None)
	float                                        DinoTurretDamageMultiplier;                        // 0x2384(0x4)(None)
	bool                                         bDisableLootCrates;                                // 0x2388(0x1)(None)
	uint8                                        Pad_1B61[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ExtinctionEventTimeInterval;                       // 0x238C(0x4)(None)
	uint8                                        Pad_1B62[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint32                                       NextExtinctionEventUTC;                            // 0x2394(0x4)(None)
	uint8                                        Pad_1B63[0x1C];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bUseCharacterTracker;                              // 0x23B4(0x1)(None)
	bool                                         bShowFloatingDamageText;                           // 0x23B5(0x1)(None)
	uint8                                        Pad_1B64[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SavedGameModeVersion;                              // 0x23B8(0x4)(None)
	uint8                                        Pad_1B66[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bAllowTekSuitPowersInGenesis;                      // 0x23C0(0x1)(None)
	uint8                                        Pad_1B69[0x47];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FItemCraftingCostOverride>     OverrideItemCraftingCosts;                         // 0x2408(0x10)(ZeroConstructor)
	TArray<struct FConfigItemCraftingCostOverride> ConfigOverrideItemCraftingCosts;                   // 0x2418(0x10)(None)
	TArray<struct FConfigMaxItemQuantityOverride> ConfigOverrideItemMaxQuantity;                     // 0x2428(0x10)(None)
	uint8                                        Pad_1B6B[0x50];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FConfigSupplyCrateItemsOverride> ConfigOverrideSupplyCrateItems;                    // 0x2488(0x10)(ZeroConstructor)
	TArray<struct FConfigNPCSpawnEntriesContainer> ConfigOverrideNPCSpawnEntriesContainer;            // 0x2498(0x10)(ZeroConstructor)
	TArray<struct FConfigNPCSpawnEntriesContainer> ConfigAddNPCSpawnEntriesContainer;                 // 0x24A8(0x10)(ZeroConstructor)
	TArray<struct FConfigNPCSpawnEntriesContainer> ConfigSubtractNPCSpawnEntriesContainer;            // 0x24B8(0x10)(ZeroConstructor)
	float                                        BabyImprintingStatScaleMultiplier;                 // 0x24C8(0x4)(None)
	float                                        BabyCuddleIntervalMultiplier;                      // 0x24CC(0x4)(None)
	float                                        BabyImprintAmountMultiplier;                       // 0x24D0(0x4)(None)
	float                                        BabyCuddleGracePeriodMultiplier;                   // 0x24D4(0x4)(None)
	float                                        BabyCuddleLoseImprintQualitySpeedMultiplier;       // 0x24D8(0x4)(None)
	float                                        HairGrowthSpeedMultiplier;                         // 0x24DC(0x4)(None)
	float                                        DinoHairGrowthSpeedMultiplier;                     // 0x24E0(0x4)(None)
	bool                                         bPreventDiseases;                                  // 0x24E4(0x1)(None)
	bool                                         bNonPermanentDiseases;                             // 0x24E5(0x1)(None)
	uint8                                        Pad_1B6F[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAllClustersInventory*                 AllClustersInventory;                              // 0x24E8(0x8)(ZeroConstructor)
	int32                                        SaveForceRespawnDinosVersion;                      // 0x24F0(0x4)(None)
	uint8                                        Pad_1B70[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint64                                       ServerID;                                          // 0x24F8(0x8)(None)
	uint8                                        Pad_1B71[0x58];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<int32>                                SupportedSpawnRegions;                             // 0x2558(0x10)(None)
	bool                                         bServerUseDinoList;                                // 0x2568(0x1)(None)
	uint8                                        Pad_1B72[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MaxAllowedRespawnInterval;                         // 0x256C(0x4)(None)
	bool                                         bUseDinoLevelUpAnimations;                         // 0x2570(0x1)(None)
	bool                                         bDisableDinoTaming;                                // 0x2571(0x1)(None)
	bool                                         bDisableDinoRiding;                                // 0x2572(0x1)(None)
	uint8                                        Pad_1B74[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SaveGameCustomVersion;                             // 0x2578(0x4)(None)
	uint8                                        Pad_1B76[0x884];                                   // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bFailedWaterDinoSpawnLogEnabled;                   // 0x2E00(0x1)(None)
	uint8                                        Pad_1B77[0x88F];                                   // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        PlayerBaseStatMultipliers[0xC];                    // 0x3690(0x30)(None)
	int32                                        NPCActiveCountTamed;                               // 0x36C0(0x4)(None)
	int32                                        NPCActiveCount;                                    // 0x36C4(0x4)(None)
	int32                                        NPCCount;                                          // 0x36C8(0x4)(None)
	float                                        RTSModeNumSelectableDinosScale;                    // 0x36CC(0x4)(None)
	float                                        RTSMaxRangeFromPlayerCharacterScale;               // 0x36D0(0x4)(None)
	float                                        RTSProximityToEnemyStructureScale;                 // 0x36D4(0x4)(None)
	float                                        MatingSpeedMultiplier;                             // 0x36D8(0x4)(None)
	float                                        FastDecayInterval;                                 // 0x36DC(0x4)(None)
	bool                                         bUseSingleplayerSettings;                          // 0x36E0(0x1)(None)
	bool                                         bDisableGenesisMissions;                           // 0x36E1(0x1)(None)
	bool                                         bDisableStructurePlacementCollision;               // 0x36E2(0x1)(None)
	bool                                         bForceUseInventoryAppends;                         // 0x36E3(0x1)(None)
	bool                                         bDisableWirelessCrafting;                          // 0x36E4(0x1)(None)
	bool                                         bDisableWirelessCraftingForDinos;                  // 0x36E5(0x1)(None)
	bool                                         bDisableWirelessCraftingForPlayers;                // 0x36E6(0x1)(None)
	bool                                         bDisableWirelessCraftingForStructures;             // 0x36E7(0x1)(None)
	float                                        WirelessCraftingRangeOverride;                     // 0x36E8(0x4)(None)
	float                                        SupplyCrateLootQualityMultiplier;                  // 0x36EC(0x4)(None)
	float                                        FishingLootQualityMultiplier;                      // 0x36F0(0x4)(None)
	float                                        ItemStackSizeMultiplier;                           // 0x36F4(0x4)(None)
	float                                        CraftingSkillBonusMultiplier;                      // 0x36F8(0x4)(None)
	bool                                         bAllowPlatformSaddleMultiFloors;                   // 0x36FC(0x1)(None)
	bool                                         bAllowUnlimitedRespecs;                            // 0x36FD(0x1)(None)
	uint8                                        Pad_1B7C[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FuelConsumptionIntervalMultiplier;                 // 0x3700(0x4)(None)
	int32                                        DestroyTamesOverLevelClamp;                        // 0x3704(0x4)(None)
	int32                                        MaxAlliancesPerTribe;                              // 0x3708(0x4)(None)
	int32                                        MaxTribesPerAlliance;                              // 0x370C(0x4)(None)
	bool                                         bDisableDinoDecayClaiming;                         // 0x3710(0x1)(None)
	bool                                         bDisableNonTribePinAccess;                         // 0x3711(0x1)(None)
	bool                                         bUseTameLimitForStructuresOnly;                    // 0x3712(0x1)(None)
	bool                                         bLimitTurretsInRange;                              // 0x3713(0x1)(None)
	float                                        LimitTurretsRange;                                 // 0x3714(0x4)(None)
	int32                                        LimitTurretsNum;                                   // 0x3718(0x4)(None)
	bool                                         bHardLimitTurretsInRange;                          // 0x371C(0x1)(None)
	uint8                                        Pad_1B7D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        LimitGeneratorsNum;                                // 0x3720(0x4)(None)
	float                                        LimitGeneratorsRange;                              // 0x3724(0x4)(None)
	int32                                        CropPlotStackLimit;                                // 0x3728(0x4)(None)
	bool                                         bDisablePhotoMode;                                 // 0x372C(0x1)(None)
	uint8                                        Pad_1B7E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        PhotoModeRangeLimit;                               // 0x3730(0x4)(None)
	bool                                         bAutoUnlockAllEngrams;                             // 0x3734(0x1)(None)
	uint8                                        Pad_1B7F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       ServerLastForceRespawnWildDinosTime;               // 0x3738(0x8)(None)
	class FString                                UseStructurePreventionVolumeTagString;             // 0x3740(0x10)(None)
	float                                        BaseTemperatureMultiplier;                         // 0x3750(0x4)(None)
	bool                                         bForceAllowAllStructures;                          // 0x3754(0x1)(None)
	bool                                         bForceAllowAscensionItemDownloads;                 // 0x3755(0x1)(None)
	bool                                         bShowCreativeMode;                                 // 0x3756(0x1)(None)
	uint8                                        Pad_1B80[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LimitNonPlayerDroppedItemsRange;                   // 0x3758(0x4)(None)
	int32                                        LimitNonPlayerDroppedItemsCount;                   // 0x375C(0x4)(None)
	float                                        GlobalPoweredBatteryDurabilityDecreasePerSecond;   // 0x3760(0x4)(None)
	float                                        SingleplayerSettingsCorpseLifespanMultiplier;      // 0x3764(0x4)(None)
	float                                        UseCorpseLifeSpanMultiplier;                       // 0x3768(0x4)(None)
	float                                        TimePeriodToHideDisconnectedPlayers;               // 0x376C(0x4)(None)
	bool                                         bUseBPPreSpawnedDino;                              // 0x3770(0x1)(None)
	uint8                                        Pad_1B81[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        PreventOfflinePvPConnectionInvincibleInterval;     // 0x3774(0x4)(None)
	float                                        TamedDinoCharacterFoodDrainMultiplier;             // 0x3778(0x4)(None)
	float                                        WildDinoCharacterFoodDrainMultiplier;              // 0x377C(0x4)(None)
	float                                        WildDinoTorporDrainMultiplier;                     // 0x3780(0x4)(None)
	float                                        PassiveTameIntervalMultiplier;                     // 0x3784(0x4)(None)
	float                                        TamedDinoTorporDrainMultiplier;                    // 0x3788(0x4)(None)
	bool                                         bDisableWeatherFog;                                // 0x378C(0x1)(None)
	uint8                                        Pad_1B82[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MeshCheckingRayDistance;                           // 0x3790(0x4)(None)
	float                                        MeshCheckingSubdivisons;                           // 0x3794(0x4)(None)
	float                                        MeshCheckingPercentageToFail;                      // 0x3798(0x4)(None)
	bool                                         bIgnoreStructuresPreventionVolumes;                // 0x379C(0x1)(None)
	bool                                         bGenesisUseStructuresPreventionVolumes;            // 0x379D(0x1)(None)
	uint8                                        Pad_1B83[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                LiveTuningFileName;                                // 0x37A0(0x10)(None)
	uint8                                        Pad_1B84[0x31];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bLogChatMessages;                                  // 0x37E1(0x1)(None)
	uint8                                        Pad_1B85[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ChatLogFlushIntervalSeconds;                       // 0x37E4(0x4)(None)
	int32                                        ChatLogFileSplitIntervalSeconds;                   // 0x37E8(0x4)(None)
	int32                                        ChatLogMaxAgeInDays;                               // 0x37EC(0x4)(None)
	uint8                                        Pad_1B86[0x60];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLeaderboardsContainer                LeaderboardContainer;                              // 0x3850(0x10)(None)
	uint8                                        Pad_1B87[0x58];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bHasCovertedToStore;                               // 0x38B8(0x1)(None)
	bool                                         bAllowStoredDatas;                                 // 0x38B9(0x1)(None)
	uint8                                        Pad_1B88[0x17E];                                   // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FBuffAddition>                 AdditionalDefaultBuffs;                            // 0x3A38(0x10)(ZeroConstructor)
	bool                                         bParseServerToJson;                                // 0x3A48(0x1)(None)
	uint8                                        Pad_1B89[0x7F];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnPreSpawnedDino;                                  // 0x3AC8(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnKilled;                                          // 0x3AD8(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnPostLogin;                                       // 0x3AE8(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnStartNewPlayer;                                  // 0x3AF8(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnAddNewTribe;                                     // 0x3B08(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnRemoveTribe;                                     // 0x3B18(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnRemovePlayerFromTribe;                           // 0x3B28(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnServerChatMessage;                               // 0x3B38(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnServerDirectMessage;                             // 0x3B48(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnServerNotification;                              // 0x3B58(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnNotifyDamage;                                    // 0x3B68(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnSerializeForSaveFile;                            // 0x3B78(0x10)(ZeroConstructor)
	uint8                                        Pad_1B8D[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BaseHexagonRewardMultiplier;                       // 0x3BA8(0x4)(None)
	float                                        HexagonRewardMultiplier;                           // 0x3BAC(0x4)(None)
	float                                        HexagonCostMultiplier;                             // 0x3BB0(0x4)(None)
	bool                                         bDisableHexagonStore;                              // 0x3BB4(0x1)(None)
	bool                                         bHexStoreAllowOnlyEngramTradeOption;               // 0x3BB5(0x1)(None)
	uint8                                        Pad_1B90[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FClassNameReplacement>         DynamicNPCReplacements;                            // 0x3BB8(0x10)(None)
	TArray<struct FClassNameReplacement>         CollectiveNPCReplacements;                         // 0x3BC8(0x10)(None)
	TArray<class FString>                        PreventTransferForClassNames;                      // 0x3BD8(0x10)(None)
	bool                                         bAllowSpeedLeveling;                               // 0x3BE8(0x1)(None)
	bool                                         bAllowFlyerSpeedLeveling;                          // 0x3BE9(0x1)(None)
	bool                                         bEnableWorldBuffScaling;                           // 0x3BEA(0x1)(None)
	bool                                         bDisableWorldBuffs;                                // 0x3BEB(0x1)(None)
	bool                                         bEnablePlayerMoveThroughSleeping;                  // 0x3BEC(0x1)(None)
	bool                                         bEnablePlayerMoveThroughAlly;                      // 0x3BED(0x1)(None)
	bool                                         bAutoCreateTribes;                                 // 0x3BEE(0x1)(None)
	bool                                         bRiderDinoCollision;                               // 0x3BEF(0x1)(None)
	bool                                         bFreezeTribes;                                     // 0x3BF0(0x1)(None)
	uint8                                        Pad_1B93[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        WorldBuffScalingEfficacy;                          // 0x3BF4(0x4)(None)
	bool                                         bUseOverrideTimeToRecoverValuesOnPlayerStatusComp; // 0x3BF8(0x1)(None)
	uint8                                        Pad_1B94[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        OverrideTimeToRecoverAfterDepletionStatusValue[0xC]; // 0x3BFC(0x30)(None)
	float                                        OverrideTimeToRecoverAfterDecreaseStatusValue[0xC]; // 0x3C2C(0x30)(None)
	bool                                         bUseOverrideTimeToRecoverValuesOnDinoStatusComp;   // 0x3C5C(0x1)(None)
	uint8                                        Pad_1B95[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        OverrideDinoTimeToRecoverAfterDepletionStatusValue[0xC]; // 0x3C60(0x30)(None)
	float                                        OverrideDinoTimeToRecoverAfterDecreaseStatusValue[0xC]; // 0x3C90(0x30)(None)
	bool                                         bUseDisabledStatusStates;                          // 0x3CC0(0x1)(None)
	uint8                                        DisabledStatusStates[0xE];                         // 0x3CC1(0xE)(None)
	uint8                                        Pad_1B97[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCrateTemporaryQualityModifierSet> TemporaryCrateModifiers;                           // 0x3CD0(0x10)(None)
	TArray<struct FResourceTemporaryAmountModifierSet> TemporaryResourceModifiers;                        // 0x3CE0(0x10)(None)
	float                                        AdjustableMutagenSpawnDelayMultiplier;             // 0x3CF0(0x4)(None)
	bool                                         bDisableDefaultMapItemSets;                        // 0x3CF4(0x1)(None)
	bool                                         DisableRailgunPVP;                                 // 0x3CF5(0x1)(None)
	uint8                                        Pad_1B9A[0xA];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FName>                          DynamicDisabledWorldBuffs;                         // 0x3D00(0x10)(None)
	uint8                                        Pad_1B9B[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RedisTimeoutInMinutes;                             // 0x3D20(0x4)(None)
	bool                                         RestartedDueToRedisTimeout;                        // 0x3D24(0x1)(None)
	uint8                                        Pad_1B9C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ImprintLimit;                                      // 0x3D28(0x4)(None)
	int32                                        MaxStructuresToAllowForPickupOverride;             // 0x3D2C(0x4)(None)
	bool                                         bDisableCustomFoldersInTributeInventories;         // 0x3D30(0x1)(None)
	bool                                         bDisableRailgunPVP;                                // 0x3D31(0x1)(None)
	uint8                                        Pad_1B9D[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinimumTimebetweeninventoryRetrieval;              // 0x3D34(0x4)(None)
	float                                        WildFollowerSpawnChanceMultiplier;                 // 0x3D38(0x4)(None)
	float                                        WildFollowerSpawnCountMultiplier;                  // 0x3D3C(0x4)(None)
	bool                                         bDisableDinoItemBlacklist;                         // 0x3D40(0x1)(None)
	bool                                         bPreventHibernationManager;                        // 0x3D41(0x1)(None)
	uint8                                        Pad_1B9E[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DinoArmorDurabilityScale;                          // 0x3D44(0x4)(None)
	TArray<TSoftClassPtr<class APrimalStructure>> XmasEventStructuresToRemove;                       // 0x3D48(0x10)(ZeroConstructor)
	TArray<TSoftClassPtr<class UPrimalItem>>     XmasEventItemsToRemove;                            // 0x3D58(0x10)(ZeroConstructor)
	TArray<TSoftClassPtr<class APrimalStructure>> EventInventoryContainersToRefresh;                 // 0x3D68(0x10)(ZeroConstructor)
	TArray<TSoftClassPtr<class APrimalDinoCharacter>> VDayDinosToRemove;                                 // 0x3D78(0x10)(ZeroConstructor)
	TArray<TSoftClassPtr<class UPrimalItem>>     VDayItemsToRemove;                                 // 0x3D88(0x10)(ZeroConstructor)
	TArray<TSoftClassPtr<class APrimalStructure>> EasterEventStructuresToRemove;                     // 0x3D98(0x10)(ZeroConstructor)
	TArray<TSoftClassPtr<class UPrimalItem>>     EasterItemsToRemove;                               // 0x3DA8(0x10)(ZeroConstructor)
	uint8                                        Pad_1BA1[0xB0];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UAntiDupeTransactionLog*               AntiDupeTransactionLog;                            // 0x3E68(0x8)(ZeroConstructor)
	uint8                                        Pad_1BA2[0xB0];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AShooterGameMode* GetDefaultObj();

	void UpdateTribeData(const struct FTribeData& NewTribeData);
	void TryGetIntOptionIni(const class FString& Section, const class FString& OptionName, int32 Value, bool ReturnValue);
	void TryGetIntOption(const class FString& Section, const class FString& Options, const class FString& OptionName, int32 Value, bool ReturnValue);
	void TryGetBoolOptionIni(const class FString& Section, const class FString& OptionName, bool Value, bool ReturnValue);
	void TryGetBoolOption(const class FString& Section, const class FString& Options, const class FString& OptionName, bool Value, bool ReturnValue);
	void TriggerLevelCustomEvents(class UWorld* InWorld, const class FString& EventName, int32 IDtoOnlyAllowExecutionOncePerFrame, bool ReturnValue);
	void TimeSinceMissionDeactivated(class UClass* MissionType, float ReturnValue);
	void StartIntervalUpdatingCachedTeamTameLists(class AShooterPlayerController* RequestingPlayer);
	void SortCurrentlyEvaluatedTameIntoAppropriateCachedTeamTameListForThisCurrentBatch();
	void ShiftAwaitingNEXTBatchOfTeamsToUpdateCachedTeamTameListsToCurrentBatch();
	void SetTimeOfDay(const class FString& TimeString);
	void SetLastMissionDeactivatedUtcTime(class UClass* MissionType, double UtcTime);
	void SetCreatedCachedTeamTameListsOnTribeDataOrPlayerData();
	void SendServerNotification(const class FString& MessageText, const struct FLinearColor& MessageColor, float DisplayScale, float DisplayTime, class UTexture2D* MessageIcon, class USoundBase* SoundToPlay, int32 ReceiverTeamId, int32 ReceiverPlayerID, bool bDoBillboard);
	void SendServerDirectMessage(const class FString& PlayerSteamIDconst, const class FString& MessageText, const struct FLinearColor& MessageColor, bool bIsBold, int32 ReceiverTeamId, int32 ReceiverPlayerID, const class FString& PlayerName);
	void SendServerChatMessage(const class FString& MessageText, const struct FLinearColor& MessageColor, bool bIsBold, int32 ReceiverTeamId, int32 ReceiverPlayerID, const class FString& SenderId);
	void SendChatMessageToTeam(int32 Team, const struct FPrimalChatMessage& Message);
	void SendChatMessageToPlayer(class AShooterPlayerController* ToPlayer, const struct FPrimalChatMessage& Message);
	void SendChatMessage(const struct FPrimalChatMessage& Message);
	void RestartServer();
	void RequestUpdateCachedTeamTameList(class AShooterPlayerController* RequestingPlayer);
	void RequestPlayerRecieveKnownCachedTeamTameList(class AShooterPlayerController* RequestingPlayer);
	void RemovePlayerData(class AShooterPlayerState* PlayerState);
	void RemoveInactivePlayersAndTribes();
	void ReassertColorization();
	void QueueUpTeamForItsCachedTeamTameListToBeUpdated(class AShooterPlayerController* RequestingPlayer);
	void PrintToServerGameLog(const class FString& InString, bool bSendChatToAllAdmins);
	void PrintToGameplayLog(const class FString& InString);
	void PostAlarmNotificationTribe(int32 TribeID, const class FString& Title, const class FString& Message);
	void PostAlarmNotificationPlayerID(int32 PlayerID, const class FString& Title, const class FString& Message);
	void PostAlarmNotification(const class FString& SteamID, const class FString& Title, const class FString& Message);
	void OnLogout(class AController* Exiting);
	void OnLandscapeLevelUnloaded();
	void OnLandscapeLevelLoaded();
	void OnFinishedUpdatingCurrentBatchOfCachedTeamTameLists();
	void MovePlayersAwaitingUpdatedCachedTeamTameListToArrayOfPlayersToGetNotifiedAndRecieveUpdatedList();
	void LoadTribeData(int32 TribeID, const struct FTribeData& LoadedTribeData, bool bIsLoadingBackup, bool bDontCheckDirtyTribeWar, bool ReturnValue);
	void LoadedWorld();
	void ListAllPlayers(const class FString& Message);
	void KickPlayerController(class APlayerController* ThePC, const class FString& KickMessage);
	void KickAllPlayersAndReload();
	void IsTimeSinceMissionDeactivated(class UClass* MissionType, float CheckTimeSince, bool bForceTrueAtZeroTime, bool ReturnValue);
	void IsTeamIncludedInNextBatchToProcessTameList(int32 Team, int32 FoundIndex, bool ReturnValue);
	void IsTeamCurrentlyUpdatingItsCachedTeamTameList(int32 Team, int32 FoundIndex, bool ReturnValue);
	void IsPlayerInNextTeamBatchPlayersAwaitingUpdatedCachedTeamTameList(class AShooterPlayerController* RequestingPlayer, int32 FoundIndex, bool ReturnValue);
	void IsPlayerControllerAllowedToJoinNoCheck(class AShooterPlayerController* ForPlayer, bool ReturnValue);
	void IsPlayerControllerAllowedToExclusiveJoin(class AShooterPlayerController* ForPlayer, bool ReturnValue);
	void IsPlayerAwaitingToRecieveCachedTeamTameListASAP(class AShooterPlayerController* RequestingPlayer, int32 FoundIndex, bool ReturnValue);
	void IsPlayerAwaitingNotificationOnceTheirCachedTeamTameListFinishesUpdating(class AShooterPlayerController* RequestingPlayer, int32 FoundIndex, bool ReturnValue);
	void IsPlayerArrayOfInAllPlayersAwaitingUpdatedCachedTeamTameLists(class AShooterPlayerController* RequestingPlayer, int32 FoundIndex, bool ReturnValue);
	void IsPlayerAllowedToCheat(class AShooterPlayerController* ForPlayer, bool ReturnValue);
	void IsCachedTeamTameListOutOfDate(class AShooterPlayerController* RequestingPlayer, bool ReturnValue);
	void InitOptionString(const class FString& Commandline, const class FString& Section, const class FString& Option);
	void InitOptionInteger(const class FString& Commandline, const class FString& Section, const class FString& Option, int32 CurrentValue);
	void InitOptionFloat(const class FString& Commandline, const class FString& Section, const class FString& Option, float CurrentValue);
	void InitOptionBool(const class FString& Commandline, const class FString& Section, const class FString& Option, bool bDefaultValue);
	void InitGameStateDataSets();
	void IncrementNumDeaths(const class FString& PlayerDataID);
	void HitchDetected(const struct FSoftObjectPath& ForAsset, float HitchTime);
	void HandleNewPlayer(class AShooterPlayerController* NewPlayer, class UPrimalPlayerData* PlayerData, class AShooterCharacter* PlayerCharacter, bool bIsFromLogin, bool ReturnValue);
	void GetTribeDataBlueprint(int32 TribeID, const struct FTribeData& ReturnValue);
	void GetStringOption(const class FString& Section, const class FString& OptionName, const class FString& ReturnValue);
	void GetSessionTimeString(const class FString& ReturnValue);
	void GetServerSettingsFloat(const class FString& KeyValue, float OutFloat, bool ReturnValue);
	void GetServerName(bool bNumbersAndLettersOnly, const class FString& ReturnValue);
	void GetPlayerData(const class FString& PlayerDataID, class UPrimalPlayerData* ReturnValue);
	void GetOverlappingDinoCharactersOfTeamAndClass(const struct FVector& AtLocation, float OverlapRange, class UClass* DinoClass, int32 DinoTeam, bool bExactClassMatch, bool bIgnoreClass, const TArray<class APrimalDinoCharacter*>& ReturnValue);
	void GetOrLoadTribeData(int32 TribeID, const struct FTribeData& LoadedTribeData, bool ReturnValue);
	void GetNumDeaths(const class FString& PlayerDataID, int32 ReturnValue);
	void GetNumberOfLivePlayersOnTribe(const class FString& TribeName, int32 ReturnValue);
	void GetLaunchOptionFloat(const class FString& LaunchOptionKey, float ReturnVal, bool ReturnValue);
	void GetLastMissionDeactivatedUtcTime(class UClass* MissionType, double ReturnValue);
	void GetIntOptionIni(const class FString& Section, const class FString& OptionName, int32 ReturnValue);
	void GetFloatOptionIni(const class FString& Section, const class FString& OptionName, float ReturnValue);
	void GetBoolOptionIni(const class FString& Section, const class FString& OptionName, bool bDefaultValue, bool ReturnValue);
	void ForceRepopulateFoliageAtPoint(const struct FVector& AtPoint, float MaxRangeFromPoint, int32 MaxNumFoliages, class UClass* RepopulatedEmitter, const struct FVector& StructureDownTraceVector, const struct FVector& StructureUpTraceVector, bool bDontCheckForOverlaps, int32 TriggeredByTeamID, bool bCheckAreaAroundEachIndividualFoliage, float RadiusAroundEachIndivitualFoliageToCheck, bool bReallyForceIt);
	void ForceRepopulateAllHarvestElements(const struct FVector& AtPoint, float MaxRangeFromPoint);
	void ForceCreateTribe(const class FString& TribeName, int32 TeamOverride, int32 ReturnValue);
	void ForceAddPlayerToTribe(class AShooterPlayerState* ForPlayerState, const class FString& TribeName, int32 ReturnValue);
	void DoMaintenanceRestartWarning();
	void DoMaintenanceRestart();
	void CountOverlappingDinoCharactersOfTeamAndClass(const struct FVector& AtLocation, float OverlapRange, class UClass* DinoClass, int32 DinoTeam, bool bExactClassMatch, bool bIgnoreClass, int32 ReturnValue);
	void ClearLastMissionDeactivatedTime(class UClass* MissionType);
	void CheckJoinInProgress(bool bIsFromLogin, class APlayerController* NewPlayer, bool ReturnValue);
	void ChatLogAppend(class AShooterPlayerController* SenderController, const struct FPrimalChatMessage& Message);
	void BPPreSpawnedDino(class APrimalDinoCharacter* TheDino);
	void BPIsSpawnpointPreferred(class APlayerStart* SpawnPoint, class AController* Player, bool ReturnValue);
	void BPIsSpawnpointAllowed(class APlayerStart* SpawnPoint, class AController* Player, bool ReturnValue);
	void AreTribesAllied(int32 TribeID1, int32 TribeID2, bool ReturnValue);
	void AllowTaming(int32 ForTeam, bool ReturnValue);
	void AllowDamage(class UWorld* ForWorld, int32 TargetingTeam1, int32 TargetingTeam2, bool bIgnoreDamageIfAllied, bool ReturnValue);
	void AdminExit(const class FString& Verify);
	void AddToTribeLog(int32 TribeID, const class FString& NewLog);
	void AddPlayerToNextTeamBatchPlayersAwaitingUpdatedCachedTeamTameList(class AShooterPlayerController* RequestingPlayer, bool ReturnValue);
	void AddPlayerToBeNotifiedWhenCachedTeamTameListIsUpdated(class AShooterPlayerController* RequestingPlayer);
};

// 0xB0 (0x3FD0 - 0x3F20)
// Class ShooterGame.CustomGameMode
class ACustomGameMode : public AShooterGameMode
{
public:
	bool                                         bFilterCharacterNames;                             // 0x3F20(0x1)(None)
	bool                                         bFilterTribeNames;                                 // 0x3F21(0x1)(None)
	bool                                         bFilterChat;                                       // 0x3F22(0x1)(None)
	uint8                                        Pad_1C7C[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                BadWordListURL;                                    // 0x3F28(0x10)(None)
	class FString                                BadWordWhiteListURL;                               // 0x3F38(0x10)(None)
	struct FAhoCorasickMatcher                   BadWordMatcher;                                    // 0x3F48(0x18)(None)
	struct FAhoCorasickMatcher                   BadWordWhitelistMatcher;                           // 0x3F60(0x18)(None)
	uint8                                        Pad_1C7D[0x58];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ACustomGameMode* GetDefaultObj();

	void SaveIntToConfig(int32 IntValue, const class FString& KeyValue);
	void SaveFloatToConfig(float IntValue, const class FString& KeyValue);
	void SaveBoolToConfig(bool IntValue, const class FString& KeyValue);
	void OnUpdateTribeData(const struct FTribeData& NewTribeData, bool ReturnValue);
	void OnRemoveTribe(int32 TribeID, bool ReturnValue);
	void OnPlayerCanRestart(class APlayerController* Player, bool ReturnValue);
	void OnIsUsedSpawnPointStillSupported(class APlayerStart* SpawnPoint, class AController* Player, bool ReturnValue);
	void OnIsSpawnpointAllowed(class APlayerStart* SpawnPoint, class AController* Player, bool ReturnValue);
	void OnInitOptionEvent(const class FString& Options, bool ReturnValue);
	void OnInitGameState(bool ReturnValue);
	void OnInitGame(const class FString& MapName, const class FString& Options, const class FString& ErrorMessage, bool ReturnValue);
	void OnHandleLeavingMap(bool ReturnValue);
	void OnDoGameCommand(const class FString& TheCommand, const class FString& ReturnValue);
	void OnAllowRenameTribe(class AShooterPlayerState* ForPlayerState, const class FString& TribeName, bool ReturnValue);
	void OnAllowNotifyRemotePlayerDeath(class AShooterCharacter* ForChar, bool ReturnValue);
	void OnAllowModifyStatusValue(class UPrimalCharacterStatusComponent* ForComp, enum class EPrimalCharacterStatusValue ValueType, float Amount, bool ReturnValue);
	void OnAllowClearTribe(class AShooterPlayerState* ForPlayerState, bool ReturnValue);
	void OnAllowAddXP(class UPrimalCharacterStatusComponent* ForComp, bool ReturnValue);
	void OnAllowAddToTribe(class AShooterPlayerState* ForPlayerState, const struct FTribeData& MyNewTribe, bool ReturnValue);
	void OnAdjustDamage(class AActor* Victim, float DefaultDamage, const struct FDamageEvent& DamageEvent, class AController* EventInstigator, class AActor* DamageCauser, float ReturnValue);
	void MakeTribeData(const class FString& TribeName, int32 OwnerPlayerDataId, int32 TribeID, const TArray<class FString>& MembersPlayerName, const TArray<int32>& MembersPlayerDataID, const TArray<int32>& TribeAdmins, bool bSetGovernment, const struct FTribeGovernment& TribeGovernment, const TArray<struct FPrimalPlayerCharacterConfigStructReplicated>& MembersConfigs, const struct FTribeData& ReturnValue);
	void KickPlayersWithoutCharacter(const class FString& Reason);
	void KickPlayer(class APlayerController* NewPlayer);
	void IsInAllowedToCheatList(class APlayerController* NewPlayer, bool ReturnValue);
	void InitOptionFloatToINI(const class FString& Options, float FloatValue, const class FString& KeyValue);
	void GetValueFromINI(const class FString& KeyValue, float ReturnValue);
	void GetIntValueFromINI(const class FString& KeyValue, int32 ReturnValue);
	void GetIniFloatValue(const class FString& Section, const class FString& KeyValue, float ReturnValue);
	void GetFloatValueFromINI(const class FString& KeyValue, float ReturnValue);
	void GetBoolValueFromINI(const class FString& KeyValue, bool ReturnValue);
	void FilterBadWords(const class FString& String, bool bCheckWithoutSpecialChars, bool ReturnValue);
	void CleanUpSotfNotificationManager();
	void CheckForCommand(const class FString& CommandName, bool ReturnValue);
	void BreakTribeData(const struct FTribeData& Data, const class FString& TribeName, int32 OwnerPlayerDataId, int32 TribeID, const TArray<class FString>& MembersPlayerName, const TArray<int32>& MembersPlayerDataID, const TArray<int32>& TribeAdmins, bool bSetGovernment, const struct FTribeGovernment& TribeGovernment, const TArray<struct FPrimalPlayerCharacterConfigStructReplicated>& MembersConfigs);
	void BlueprintRemoveTribe(int32 TribeID);
};

// 0x148 (0xF78 - 0xE30)
// Class ShooterGame.CustomGameState
class ACustomGameState : public AShooterGameState
{
public:
	class UClass*                                TribeFlagClass;                                    // 0xE30(0x8)(ZeroConstructor)
	TArray<class APrimalStructureTribeFlag*>     TribesFlags;                                       // 0xE38(0x10)(ZeroConstructor)
	TArray<struct FSOTFScorePlayerData>          PlayerScoreData;                                   // 0xE48(0x10)(ZeroConstructor)
	uint8                                        Pad_1DF2[0x50];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FSOTFScoreTribeData>           TribeScoreData;                                    // 0xEA8(0x10)(None)
	uint8                                        Pad_1DF3[0x50];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bEnableAllyRadarData;                              // 0xF08(0x1)(None)
	uint8                                        Pad_1DF4[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AllyRadarUpdateFrequency;                          // 0xF0C(0x4)(None)
	uint8                                        Pad_1DF5[0x68];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ACustomGameState* GetDefaultObj();

	void SpawnBuffAndAttachToCharacter(class UClass* Buff, class APrimalCharacter* PrimalCharacter, float ExperiencePoints, class APrimalBuff* ReturnValue);
	void SetTribeTexture(int32 TribeID, class UPaintingTexture* NewTexture);
	void SetScoreDataForTribe(int32 ForTargetingTeam, const struct FSOTFScoreTribeData& NewScoreData, bool bReplicateToClients);
	void SetScoreDataForPlayer(int32 LinkedID, const struct FSOTFScorePlayerData& NewScoreData, bool bReplicateToClients);
	void SetActionReportItem(const struct FActionReportItem& Data, const class FString& PlayerName, const class FString& TribeName, const class FString& TimeOfDeath, const class FString& LevelOfDeath, const class FString& DeathMessage);
	void RemoveTribeFlag(int32 TribeID);
	void ProjectWorldToScreenPosition(const struct FVector& WorldLocation, class APlayerController* ThePC, const struct FVector2D& ReturnValue);
	void OnSetHudEvent();
	void OnRep_TribeScoreData();
	void OnRep_PlayerScoreData();
	void OnOverrideDynamicMusic(class APrimalCharacter* ForCharacter, class USoundBase* ReturnValue);
	void OnNotifyPlayerDied(class AShooterCharacter* TheShooterChar, class AShooterPlayerController* PrevController, class APawn* InstigatingPawn, class AActor* DamageCauser);
	void OnHasGameModeMatchStarted(bool ReturnValue);
	void OnHandleActorEvent(class AActor* ForActor, class FName NameParam, const struct FVector& VecParam);
	void OnForceOccludedFloatingHUD(class AActor* AnActor, class AShooterPlayerController* ForPC, bool ReturnValue);
	void OnExtraShooterCharacterTick(class AShooterCharacter* ForChar, float DeltaTime);
	void OnDrawingHUDNotifications(class AShooterHUD* HUD, bool ReturnValue);
	void OnDrawHUD(class AShooterHUD* HUD, bool ReturnValue);
	void OnDrawExtraPlayerFloatingHUD(class AShooterHUD* HUD, class AShooterCharacter* TheShooterChar, const struct FVector& AtLoc);
	void OnCheckGameStateIfCanRespawn(class APlayerController* ForPC, bool ReturnValue);
	void OnAllowTribeManager(class AShooterPlayerController* ForPC, bool ReturnValue);
	void OnAllowTribeManagement(bool ReturnValue);
	void OnAllowStartSupplyCrateSpawns(bool ReturnValue);
	void OnAllowShowPlayerHudUI(class APrimalCharacter* ForPawn, bool ReturnValue);
	void OnAllowRemoveItems(class UPrimalInventoryComponent* ForInv, class AShooterPlayerController* PC, class UPrimalItem* AnItemToTransfer, bool ReturnValue);
	void OnAllowPopUps(bool ReturnValue);
	void OnAllowOrbitCamera(class APrimalCharacter* ForCharacter, bool ReturnValue);
	void OnAllowFastTravel(class APrimalStructureBed* ForBed, class AShooterPlayerController* ForPC, bool ReturnValue);
	void OnAllowDaytimeTransitionSounds(bool ReturnValue);
	void OnAllowCreateSurvivor(bool ReturnValue);
	void MakePlayerDeathNotification(const class FString& PlayerDeathStringEnemy, const class FString& PlayerDeathStringAlly, const class FString& PlayerDeathStringYou, const class FString& DeathReason, const TArray<class FString>& DeadPlayerNames, bool bIsTribeDeath, const class FString& DeathTribeName, int32 TargetingTeamID, const class FString& LinkedPlayerID, const TArray<struct FPrimalPlayerCharacterConfigStructReplicated>& PlayersData, const struct FPlayerDeathNotification& ReturnValue);
	void MakeBattleTribeData(const class FString& TribeName, int32 TribeID, const struct FBattleTribeData& ReturnValue);
	void MakeBattlePlayerData(const class FString& PlayerName, bool bConnected, bool bAlive, int32 TribeID, const class FString& PlayerID, const struct FBattlePlayerData& ReturnValue);
	void KickPlayer(class APlayerController* Controller, const class FString& Reason);
	void IsTribeID(int32 TeamID, bool ReturnValue);
	void IsAuthorityRole(bool ReturnValue);
	void HideUIScene(class UClass* SceneClass);
	void GetTribeTexture(int32 TribeID, class UTexture2D* ReturnValue);
	void GetTimeSeconds(double ReturnValue);
	void GetPlayerDatasForTribe(int32 TribeID, const TArray<struct FBattlePlayerData>& AllPlayerDatas, const TArray<struct FBattlePlayerData>& ReturnValue);
	void GetPawnName(class APawn* Pawn, const class FString& ReturnValue);
	void GetPawnKillerName(class APawn* Pawn, const class FString& ReturnValue);
	void GetFilteredAllyRadarTargets(const TArray<struct FAllyRadarDatas>& ReturnValue);
	void GetDeathNotificationText(class AShooterCharacter* TheShooterChar, class APawn* InstigatingPawn, const class FString& Killer, const class FString& KillerAndTribe, const class FString& TheNotificationStringYou, const class FString& TheNotificationStringAlly, const class FString& TheNotificationStringEnemy);
	void GetCustomActors(class FName SearchCustomTag, class ACustomActorList* ReturnValue);
	void GetColorForTargetingTeam(int32 ForTargetingTeam, const struct FColor& NameColor, const struct FColor& PlatformProfileNameColor);
	void GetAllShooterControllers(const TArray<class AShooterPlayerController*>& ReturnValue);
	void GetAllShooterCharactersOfTeam(int32 KillerTeam, const TArray<class AShooterCharacter*>& ReturnValue);
	void GetAllShooterCharacters(const TArray<class AShooterCharacter*>& ReturnValue);
	void GetAllDinoCharactersOfTeam(int32 KillerTeam, const TArray<class APrimalDinoCharacter*>& ReturnValue);
	void DrawTileOnCanvas(class AShooterHUD* HUD, class UTexture* Tex, float X, float Y, float XL, float YL, float U, float V, float UL, float VL, const struct FColor& DrawColor);
	void CreateScoreDataForTribe(const TArray<int32>& TargetingTeams);
	void CreateScoreDataForPlayers(const TArray<int32>& LinkedIDs);
	void CreateDeathNotification(class AShooterCharacter* TheShooterChar, class AShooterPlayerController* PrevController, class APawn* InstigatingPawn, int32 MaxNumberOfRespawns, const struct FPlayerDeathNotification& ReturnValue);
	void CreateDamageEvent(const struct FDamageEvent& ReturnValue);
	void CheckTimeSince(float Time, float Duration, bool ReturnValue);
	void BroadcastActorCustomEvent(class AActor* Actor, class FName EventCustomName, const class FString& EventCustomString, class AActor* InstigatorActor);
	void BreakTribeData(const struct FTribeData& InData, const class FString& TribeName, int32 OwnerPlayerDataId, int32 TribeID, const TArray<class FString>& MembersPlayerName, const TArray<int32>& MembersPlayerDataID, const TArray<int32>& TribeAdmins, bool bSetGovernment, const TArray<struct FPrimalPlayerCharacterConfigStructReplicated>& MembersConfigs);
	void BreakPlayerDeathNotification(const struct FPlayerDeathNotification& Data, const class FString& PlayerDeathStringEnemy, const class FString& PlayerDeathStringAlly, const class FString& PlayerDeathStringYou, const class FString& DeathReason, const TArray<class FString>& DeadPlayerNames, bool bIsTribeDeath, const class FString& DeathTribeName, int32 TargetingTeamID, const class FString& LinkedPlayerID, const TArray<struct FPrimalPlayerCharacterConfigStructReplicated>& PlayersData);
	void BreakBattleTribeData(const struct FBattleTribeData& InData, const class FString& TribeName, int32 TribeID);
	void BreakBattlePlayerData(const struct FBattlePlayerData& Data, const class FString& PlayerName, bool bConnected, bool bAlive, int32 TribeID, const class FString& PlayerID);
	void BreakActionReportItem(const struct FActionReportItem& Data, const class FString& PlayerName, const class FString& TribeName, const class FString& TimeOfDeath, const class FString& LevelOfDeath, const class FString& DeathMessage);
	void BPGetTribeFlagRef(int32 TribeID, bool CreateFlag, class APrimalStructureTribeFlag* ReturnValue);
	void BPGetScoreDataForTribe(int32 ForTargetingTeam, const struct FSOTFScoreTribeData& ReturnValue);
	void BPGetScoreDataForPlayer(int32 LinkedID, const struct FSOTFScorePlayerData& ReturnValue);
	void BPClientUpdateAllyRadar();
};

// 0x30 (0x538 - 0x508)
// Class ShooterGame.DamageVolumeBase
class ADamageVolumeBase : public AVolume
{
public:
	float                                        DamageAmount;                                      // 0x508(0x4)(None)
	float                                        DamageInterval;                                    // 0x50C(0x4)(None)
	class UClass*                                DamageType;                                        // 0x510(0x8)(ZeroConstructor)
	TArray<struct FDamageNegatingItem>           DamageNegatingItems;                               // 0x518(0x10)(ZeroConstructor)
	uint8                                        Pad_1E13[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ADamageVolumeBase* GetDefaultObj();

	void OnEndOverlap(class AActor* OverlappedActor, class AActor* Actor);
	void OnBeginOverlap(class AActor* OverlappedActor, class AActor* Actor);
};

// 0x8 (0x540 - 0x538)
// Class ShooterGame.DamageVolumeSwamp
class ADamageVolumeSwamp : public ADamageVolumeBase
{
public:
	uint8                                        Pad_1E15[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ADamageVolumeSwamp* GetDefaultObj();

};

// 0x40 (0x68 - 0x28)
// Class ShooterGame.DatabaseShared
class UDatabaseShared : public UObject
{
public:
	uint8                                        bInitialized : 1;                                  // Mask: 0x1, PropSize: 0x10x28(0x1)(None)
	uint8                                        Pad_1E19[0x3F];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDatabaseShared* GetDefaultObj();

};

// 0x10 (0x78 - 0x68)
// Class ShooterGame.Database_LoginData
class UDatabase_LoginData : public UDatabaseShared
{
public:
	uint8                                        Pad_1E1A[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDatabase_LoginData* GetDefaultObj();

};

// 0x0 (0x78 - 0x78)
// Class ShooterGame.Database_LoginData_Redis
class UDatabase_LoginData_Redis : public UDatabase_LoginData
{
public:

	static class UClass* StaticClass();
	static class UDatabase_LoginData_Redis* GetDefaultObj();

};

// 0x10 (0x78 - 0x68)
// Class ShooterGame.Database_PubSub_GeneralNotifications
class UDatabase_PubSub_GeneralNotifications : public UDatabaseShared
{
public:
	uint8                                        Pad_1E1C[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDatabase_PubSub_GeneralNotifications* GetDefaultObj();

};

// 0x0 (0x78 - 0x78)
// Class ShooterGame.Database_PubSub_GeneralNotifications_Redis
class UDatabase_PubSub_GeneralNotifications_Redis : public UDatabase_PubSub_GeneralNotifications
{
public:

	static class UClass* StaticClass();
	static class UDatabase_PubSub_GeneralNotifications_Redis* GetDefaultObj();

};

// 0xF8 (0x9D0 - 0x8D8)
// Class ShooterGame.DataListEntryButton_CustomOverlay
class UDataListEntryButton_CustomOverlay : public UDataListEntryButton
{
public:
	uint8                                        Pad_1E20[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSlateBrush                           CustomOverlayImage;                                // 0x8E0(0xD0)(ZeroConstructor)
	class UMaterialInterface*                    Material;                                          // 0x9B0(0x8)(ZeroConstructor)
	uint8                                        bCustomOverlayEnabled : 1;                         // Mask: 0x1, PropSize: 0x10x9B8(0x1)(None)
	uint8                                        BitPad_148 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1E23[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             CustomOverlayScale;                                // 0x9C0(0x10)(None)

	static class UClass* StaticClass();
	static class UDataListEntryButton_CustomOverlay* GetDefaultObj();

};

// 0x10 (0x768 - 0x758)
// Class ShooterGame.DataListEntryButton_DyeResources
class UDataListEntryButton_DyeResources : public UPrimalUI
{
public:
	uint8                                        Pad_1E25[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDataListEntryButton_DyeResources* GetDefaultObj();

};

// 0xF8 (0x850 - 0x758)
// Class ShooterGame.DataListEntryButton_HostSession
class UDataListEntryButton_HostSession : public UBaseSelectableButtonWidget
{
public:
	uint8                                        bIsCustom : 1;                                     // Mask: 0x1, PropSize: 0x10x758(0x1)(None)
	uint8                                        bIsProcedural : 1;                                 // Mask: 0x2, PropSize: 0x10x758(0x1)(None)
	uint8                                        bIsActivated : 1;                                  // Mask: 0x4, PropSize: 0x10x758(0x1)(None)
	uint8                                        bIsMapMod : 1;                                     // Mask: 0x8, PropSize: 0x10x758(0x1)(None)
	uint8                                        bIsActiveModListingEntry : 1;                      // Mask: 0x10, PropSize: 0x10x758(0x1)(None)
	uint8                                        BitPad_149 : 3;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1E29[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                DisplayName;                                       // 0x760(0x10)(None)
	bool                                         bCenterDisplayName;                                // 0x770(0x1)(None)
	uint8                                        Pad_1E2A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                ShortMapName;                                      // 0x778(0x10)(None)
	class FString                                LongMapName;                                       // 0x788(0x10)(None)
	class FString                                ModName;                                           // 0x798(0x10)(None)
	class FString                                ModPath;                                           // 0x7A8(0x10)(None)
	uint64                                       ModItemId;                                         // 0x7B8(0x8)(None)
	uint8                                        bSelectOnClicked : 1;                              // Mask: 0x1, PropSize: 0x10x7C0(0x1)(None)
	uint8                                        Pad_1E2B[0x8F];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDataListEntryButton_HostSession* GetDefaultObj();

	void GetHasServerData(bool ReturnValue);
	void GetHasSaveGame(bool ReturnValue);
};

// 0x2E8 (0xA40 - 0x758)
// Class ShooterGame.DataListEntryButton_ListSession
class UDataListEntryButton_ListSession : public UBaseSelectableButtonWidget
{
public:
	struct FCustomButtonWidgetStyle              LastJoinedExtendedStyle;                           // 0x758(0x48)(None)
	struct FCustomButtonWidgetStyle              StandardExtendedStyle;                             // 0x7A0(0x48)(None)
	class FString                                UniqueID;                                          // 0x7E8(0x10)(None)
	class FString                                GameName;                                          // 0x7F8(0x10)(None)
	class FString                                BuildId;                                           // 0x808(0x10)(None)
	class FString                                OwnerName;                                         // 0x818(0x10)(None)
	class FString                                MapName;                                           // 0x828(0x10)(None)
	class FString                                DayTimeStr;                                        // 0x838(0x10)(None)
	uint32                                       NumPlayers;                                        // 0x848(0x4)(None)
	uint32                                       MaxNumPlayers;                                     // 0x84C(0x4)(None)
	uint64                                       ModId;                                             // 0x850(0x8)(None)
	uint64                                       TotalConversionId;                                 // 0x858(0x8)(None)
	uint64                                       Ping;                                              // 0x860(0x8)(None)
	class FString                                ModLabelString;                                    // 0x868(0x10)(None)
	bool                                         bHasMods;                                          // 0x878(0x1)(None)
	bool                                         bHasPassword;                                      // 0x879(0x1)(None)
	bool                                         bIsFavourite;                                      // 0x87A(0x1)(None)
	bool                                         bIsPVEServer;                                      // 0x87B(0x1)(None)
	uint8                                        Pad_1E2E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            PasswordTexture;                                   // 0x880(0x8)(ZeroConstructor)
	bool                                         bIsOfficialServer;                                 // 0x888(0x1)(None)
	bool                                         bUsingBattleEye;                                   // 0x889(0x1)(None)
	bool                                         bAllowDownloadCharacters;                          // 0x88A(0x1)(None)
	bool                                         bAllowDownloadItems;                               // 0x88B(0x1)(None)
	uint8                                        Pad_1E2F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            BattleEyeTexture;                                  // 0x890(0x8)(ZeroConstructor)
	class UTexture2D*                            OfficialServerTexture;                             // 0x898(0x8)(ZeroConstructor)
	class UTexture2D*                            PVPServerTexture;                                  // 0x8A0(0x8)(ZeroConstructor)
	class UTexture2D*                            PVEServerTexture;                                  // 0x8A8(0x8)(ZeroConstructor)
	struct FLinearColor                          DisplayStringSelectedColor;                        // 0x8B0(0x10)(None)
	uint8                                        bSelectOnClicked : 1;                              // Mask: 0x1, PropSize: 0x10x8C0(0x1)(None)
	uint8                                        Pad_1E31[0x17F];                                   // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDataListEntryButton_ListSession* GetDefaultObj();

};

// 0x70 (0x7C8 - 0x758)
// Class ShooterGame.DataListEntryButton_MainMenu
class UDataListEntryButton_MainMenu : public UBaseSelectableButtonWidget
{
public:
	uint8                                        bIsCustom : 1;                                     // Mask: 0x1, PropSize: 0x10x758(0x1)(None)
	uint8                                        bIsProcedural : 1;                                 // Mask: 0x2, PropSize: 0x10x758(0x1)(None)
	uint8                                        BitPad_14A : 6;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1E34[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                DisplayName;                                       // 0x760(0x10)(None)
	bool                                         bCenterDisplayName;                                // 0x770(0x1)(None)
	uint8                                        Pad_1E35[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                MapName;                                           // 0x778(0x10)(None)
	class FString                                ModName;                                           // 0x788(0x10)(None)
	class FString                                ModPath;                                           // 0x798(0x10)(None)
	uint64                                       ModItemId;                                         // 0x7A8(0x8)(None)
	uint8                                        bSelectOnClicked : 1;                              // Mask: 0x1, PropSize: 0x10x7B0(0x1)(None)
	uint8                                        BitPad_14B : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1E36[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCustomButtonWidget*                   ButtonObject;                                      // 0x7B8(0x8)(ZeroConstructor)
	class UTextBlock*                            EntryNameLabel;                                    // 0x7C0(0x8)(ZeroConstructor)

	static class UClass* StaticClass();
	static class UDataListEntryButton_MainMenu* GetDefaultObj();

};

// 0xA8 (0x980 - 0x8D8)
// Class ShooterGame.DataListEntryButton_PrimalFolder
class UDataListEntryButton_PrimalFolder : public UDataListEntryButton
{
public:
	struct FVector2D                             ItemNameSpacing;                                   // 0x8D8(0x10)(None)
	uint8                                        bIsItemSlotButton : 1;                             // Mask: 0x1, PropSize: 0x10x8E8(0x1)(None)
	uint8                                        bSimpleIconOnly : 1;                               // Mask: 0x2, PropSize: 0x10x8E8(0x1)(None)
	uint8                                        BitPad_14C : 6;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1E3B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TextScaleMultiplier;                               // 0x8EC(0x4)(None)
	bool                                         bUseNewRenderingPath;                              // 0x8F0(0x1)(None)
	uint8                                        Pad_1E3C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  TextLabelName;                                     // 0x8F4(0x8)(None)
	uint8                                        Pad_1E3D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPrimalFolderIcons                    IconsNormal;                                       // 0x900(0x20)(ZeroConstructor)
	struct FPrimalFolderIcons                    IconsSelected;                                     // 0x920(0x20)(ZeroConstructor)
	class FString                                FolderName;                                        // 0x940(0x10)(None)
	float                                        FolderNameTextClipOffset;                          // 0x950(0x4)(None)
	float                                        FolderNameTextFontScale;                           // 0x954(0x4)(None)
	class UTexture2D*                            FolderIcon;                                        // 0x958(0x8)(ZeroConstructor)
	enum class EFolderWidgetType                 FolderType;                                        // 0x960(0x1)(None)
	uint8                                        Pad_1E3F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FColor                                FontColor;                                         // 0x964(0x4)(None)
	uint8                                        FolderLevel;                                       // 0x968(0x1)(None)
	uint8                                        Pad_1E40[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UDataListPanel*                        ParentPanel;                                       // 0x970(0x8)(ZeroConstructor)
	uint8                                        Pad_1E41[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDataListEntryButton_PrimalFolder* GetDefaultObj();

};

// 0x8E8 (0x11C0 - 0x8D8)
// Class ShooterGame.DataListEntryButton_PrimalItem
class UDataListEntryButton_PrimalItem : public UDataListEntryButton
{
public:
	struct FVector2D                             DesiredSize;                                       // 0x8D8(0x10)(None)
	struct FColor                                MiscInfoStringColor;                               // 0x8E8(0x4)(None)
	struct FColor                                ItemNameColor;                                     // 0x8EC(0x4)(None)
	struct FColor                                ItemCategoryColor;                                 // 0x8F0(0x4)(None)
	uint8                                        Pad_1E48[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FButtonStyle                          WidgetStyleWhenBroken;                             // 0x900(0x3F0)(ZeroConstructor)
	struct FDataListEntryButtonBorderColors      NormalBorderColors;                                // 0xCF0(0x10)(None)
	struct FDataListEntryButtonBorderColors      BrokenBorderColors;                                // 0xD00(0x10)(None)
	float                                        BarOffsetY;                                        // 0xD10(0x4)(None)
	float                                        DurabilityBarBorderThickness;                      // 0xD14(0x4)(None)
	float                                        DurabilityBarThickness;                            // 0xD18(0x4)(None)
	struct FColor                                DurabilityBarFgColor;                              // 0xD1C(0x4)(None)
	struct FColor                                DurabilityBarBgColor;                              // 0xD20(0x4)(None)
	struct FColor                                SpoilingBarFgColor;                                // 0xD24(0x4)(None)
	struct FColor                                SpoilingBarBgColor;                                // 0xD28(0x4)(None)
	uint8                                        Pad_1E49[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSlateBrush                           WidgetSelectedStyleBrush;                          // 0xD30(0xD0)(ZeroConstructor)
	struct FVector2D                             WidgetSelectedStyleBrushSize;                      // 0xE00(0x10)(None)
	struct FVector2D                             WidgetSelectedStyleBrushOffset;                    // 0xE10(0x10)(None)
	struct FSlateBrush                           WidgetActiveStyleBrush;                            // 0xE20(0xD0)(ZeroConstructor)
	struct FSlateBrush                           WidgetBrokenOverlayStyleBrush;                     // 0xEF0(0xD0)(ZeroConstructor)
	struct FColor                                UnselectedTintColor;                               // 0xFC0(0x4)(None)
	struct FColor                                TintEngramRequirementsMet;                         // 0xFC4(0x4)(None)
	struct FColor                                TintEngramRequirementsUnmet;                       // 0xFC8(0x4)(None)
	struct FColor                                TintBlueprintRequirementsMet;                      // 0xFCC(0x4)(None)
	struct FColor                                TintBlueprintRequirementsUnmet;                    // 0xFD0(0x4)(None)
	struct FColor                                TintTekBlueprintRequirementsMet;                   // 0xFD4(0x4)(None)
	struct FColor                                TintTekBlueprintRequirementsUnmet;                 // 0xFD8(0x4)(None)
	struct FColor                                TintCompatibleWithDraggedItem;                     // 0xFDC(0x4)(None)
	struct FColor                                CraftRepairIconTint;                               // 0xFE0(0x4)(None)
	struct FMargin                               BorderSizePx;                                      // 0xFE4(0x10)(None)
	uint8                                        Pad_1E50[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            EngramBg;                                          // 0xFF8(0x8)(ZeroConstructor)
	class UTexture2D*                            BlueprintBg;                                       // 0x1000(0x8)(ZeroConstructor)
	class UTexture2D*                            TekgramBg;                                         // 0x1008(0x8)(ZeroConstructor)
	class UTexture2D*                            ItemQualityOverlay;                                // 0x1010(0x8)(ZeroConstructor)
	class UTexture2D*                            SlottedIcon;                                       // 0x1018(0x8)(ZeroConstructor)
	class UTexture2D*                            ActiveSlotIcon;                                    // 0x1020(0x8)(ZeroConstructor)
	class UTexture2D*                            CraftingIcon;                                      // 0x1028(0x8)(ZeroConstructor)
	class UTexture2D*                            RepairingIcon;                                     // 0x1030(0x8)(ZeroConstructor)
	class UTexture2D*                            BrokenIcon;                                        // 0x1038(0x8)(ZeroConstructor)
	struct FVector2D                             QuantityTxtPosition;                               // 0x1040(0x10)(None)
	struct FVector2D                             ArmorDamageTxtPosition;                            // 0x1050(0x10)(None)
	struct FVector2D                             ArmorDamageIconPosition;                           // 0x1060(0x10)(None)
	float                                        ArmorDamageIconScale;                              // 0x1070(0x4)(None)
	uint8                                        Pad_1E55[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             AmmoTxtPosition;                                   // 0x1078(0x10)(None)
	struct FVector2D                             WeightTxtPosition;                                 // 0x1088(0x10)(None)
	struct FVector2D                             NameTxtPositionPercent;                            // 0x1098(0x10)(None)
	struct FVector2D                             NameTxtBoxSizePercent;                             // 0x10A8(0x10)(None)
	struct FVector2D                             CategoryTxtPosition;                               // 0x10B8(0x10)(None)
	struct FVector2D                             ItemNameSpacing;                                   // 0x10C8(0x10)(None)
	int32                                        UseItemCraftQueueIndex;                            // 0x10D8(0x4)(None)
	uint8                                        bUseRemoteCraftQueue : 1;                          // Mask: 0x1, PropSize: 0x10x10DC(0x1)(None)
	uint8                                        bIsItemSlotButton : 1;                             // Mask: 0x2, PropSize: 0x10x10DC(0x1)(None)
	uint8                                        BitPad_14D : 6;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1E57[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TextScaleMultiplier;                               // 0x10E0(0x4)(None)
	float                                        TextArmorDamageSize;                               // 0x10E4(0x4)(None)
	float                                        TextQuantitySize;                                  // 0x10E8(0x4)(None)
	float                                        TextAmmoSize;                                      // 0x10EC(0x4)(None)
	float                                        TextWeightSize;                                    // 0x10F0(0x4)(None)
	float                                        TextNameSize;                                      // 0x10F4(0x4)(None)
	float                                        TextCategorySize;                                  // 0x10F8(0x4)(None)
	bool                                         EnableTextShadow;                                  // 0x10FC(0x1)(None)
	bool                                         EnableTextGlow;                                    // 0x10FD(0x1)(None)
	uint8                                        Pad_1E58[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          TextGlowColor;                                     // 0x1100(0x10)(None)
	struct FVector2D                             TextGlowInnerRadius;                               // 0x1110(0x10)(None)
	struct FVector2D                             TextGlowOuterRadius;                               // 0x1120(0x10)(None)
	class UFont*                                 DetailTextFont;                                    // 0x1130(0x8)(ZeroConstructor)
	float                                        ItemIconScale;                                     // 0x1138(0x4)(None)
	uint8                                        Pad_1E5A[0x74];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bIsUsingExtraCanvasBar;                            // 0x11B0(0x1)(None)
	uint8                                        Pad_1E5B[0xF];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDataListEntryButton_PrimalItem* GetDefaultObj();

	void HandleOnContextMenuIsOpenChanged(bool bIsOpen);
	void GetShowExtraCanvasBar(bool IsVisible, float Percent, const struct FLinearColor& BarColor);
};

// 0xB8 (0x810 - 0x758)
// Class ShooterGame.DataListEntryEngramList
class UDataListEntryEngramList : public UPrimalUI
{
public:
	class UClass*                                EntryWidgetTemplate;                               // 0x758(0x8)(ZeroConstructor)
	class FName                                  DataPanelName;                                     // 0x760(0x8)(None)
	class FName                                  LevelLabelName;                                    // 0x768(0x8)(None)
	class FName                                  LevelEnabledEffectName;                            // 0x770(0x8)(None)
	class FName                                  ElementIconName;                                   // 0x778(0x8)(None)
	class FName                                  EngramRowStartName;                                // 0x780(0x8)(None)
	class FName                                  EngramRowMiddleName;                               // 0x788(0x8)(None)
	class FName                                  EngramRowEndName;                                  // 0x790(0x8)(None)
	struct FLinearColor                          SwitcherTextActiveColor;                           // 0x798(0x10)(None)
	struct FLinearColor                          SwitcherTextInactiveColor;                         // 0x7A8(0x10)(None)
	int32                                        WidgetLimit;                                       // 0x7B8(0x4)(None)
	uint8                                        Pad_1E69[0x54];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDataListEntryEngramList* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class ShooterGame.DataListEntryInterface
class IDataListEntryInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IDataListEntryInterface* GetDefaultObj();

};

// 0xC8 (0x3F8 - 0x330)
// Class ShooterGame.DataListEntryWidget
class UDataListEntryWidget : public UPrimalUserWidget
{
public:
	class FName                                  DataListButtonName;                                // 0x330(0x8)(None)
	int32                                        ExistingButtonExplicitIndexType;                   // 0x338(0x4)(None)
	class FName                                  TraditionalButtonName;                             // 0x33C(0x8)(None)
	class FName                                  TraditionalLabelName;                              // 0x344(0x8)(None)
	uint8                                        Pad_1E77[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            ButtonBackgroundOverride;                          // 0x350(0x8)(ZeroConstructor)
	class FString                                DisplayStringOverride;                             // 0x358(0x10)(None)
	int32                                        PrimalItemButton_UseItemCraftQueueIndex;           // 0x368(0x4)(None)
	uint8                                        PrimalItemButton_bUseRemoteCraftQueue : 1;         // Mask: 0x1, PropSize: 0x10x36C(0x1)(None)
	uint8                                        bOverrideButtonShowDisplayStringWhenHasItem : 1;   // Mask: 0x2, PropSize: 0x10x36C(0x1)(None)
	uint8                                        bOverrideButtonShowDisplayStringWhenHasItemValue : 1; // Mask: 0x4, PropSize: 0x10x36C(0x1)(None)
	uint8                                        bOverrideButtonDisplayStringCenterX : 1;           // Mask: 0x8, PropSize: 0x10x36C(0x1)(None)
	uint8                                        bOverrideButtonDisplayStringCenterXValue : 1;      // Mask: 0x10, PropSize: 0x10x36C(0x1)(None)
	uint8                                        bOverrideButtonDisplayStringCenterY : 1;           // Mask: 0x20, PropSize: 0x10x36C(0x1)(None)
	uint8                                        bOverrideButtonDisplayStringCenterYValue : 1;      // Mask: 0x40, PropSize: 0x10x36C(0x1)(None)
	uint8                                        bOverrideButtonDisplayStringOffset : 1;            // Mask: 0x80, PropSize: 0x10x36C(0x1)(None)
	uint8                                        Pad_1E79[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             OverrideButtonDisplayStringOffsetValue;            // 0x370(0x10)(None)
	uint8                                        bOverrideButtonDisplayStringScale : 1;             // Mask: 0x1, PropSize: 0x10x380(0x1)(None)
	uint8                                        bOverrideButtonDisplayStringFontSize : 1;          // Mask: 0x2, PropSize: 0x10x380(0x1)(None)
	uint8                                        bUseEngramToolTips : 1;                            // Mask: 0x4, PropSize: 0x10x380(0x1)(None)
	uint8                                        BitPad_151 : 5;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1E7A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        OverrideButtonDisplayStringFontSizeValue;          // 0x384(0x4)(None)
	struct FVector2D                             OverrideButtonDisplayStringScaleValue;             // 0x388(0x10)(None)
	class UTexture2D*                            OverrideButtonSelectedIcon;                        // 0x398(0x8)(ZeroConstructor)
	bool                                         bBoundToDragging;                                  // 0x3A0(0x1)(None)
	bool                                         CanBeHighlightedWhenEmpty;                         // 0x3A1(0x1)(None)
	uint8                                        Pad_1E7B[0x56];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDataListEntryWidget* GetDefaultObj();

	void OnDraggedClickedEventObject(class UWidget* DraggeddWidget);
	void InitializeMeDefaults();
	void GetShowExtraCanvasBar(bool IsVisible, float Percent, const struct FLinearColor& BarColor);
	void GetDataListButton(class UDataListEntryButton* ReturnValue);
};

// 0x0 (0x28 - 0x28)
// Class ShooterGame.DataListInterface
class IDataListInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IDataListInterface* GetDefaultObj();

};

// 0x208 (0xFA0 - 0xD98)
// Class ShooterGame.DataListPanel
class UDataListPanel : public UScrollBox
{
public:
	class UClass*                                EntryWidgetTemplate;                               // 0xD98(0x8)(ZeroConstructor)
	class UClass*                                EntryListTemplate;                                 // 0xDA0(0x8)(ZeroConstructor)
	class UClass*                                NullEntryWidgetTemplate;                           // 0xDA8(0x8)(ZeroConstructor)
	class UClass*                                PaddingEntryWidgetTemplate;                        // 0xDB0(0x8)(ZeroConstructor)
	class UClass*                                FolderWidgetTemplate;                              // 0xDB8(0x8)(ZeroConstructor)
	class UClass*                                GenericWidgetTemplate;                             // 0xDC0(0x8)(ZeroConstructor)
	TArray<class FString>                        CustomFolders;                                     // 0xDC8(0x10)(None)
	class UTexture2D*                            FolderIcon;                                        // 0xDD8(0x8)(ZeroConstructor)
	struct FColor                                FolderColor;                                       // 0xDE0(0x4)(None)
	uint8                                        Pad_1E7E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            BackFolderIcon;                                    // 0xDE8(0x8)(ZeroConstructor)
	struct FColor                                BackFolderColor;                                   // 0xDF0(0x4)(None)
	uint8                                        Pad_1E7F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            CustomFolderIcon;                                  // 0xDF8(0x8)(ZeroConstructor)
	struct FColor                                CustomFolderColor;                                 // 0xE00(0x4)(None)
	uint8                                        bSupportsCustomFolders : 1;                        // Mask: 0x1, PropSize: 0x10xE04(0x1)(None)
	uint8                                        bAllowMultiLevelCustomFolders : 1;                 // Mask: 0x2, PropSize: 0x10xE04(0x1)(None)
	uint8                                        bUsePaddingTemplate : 1;                           // Mask: 0x4, PropSize: 0x10xE04(0x1)(None)
	uint8                                        bUseForEngramList : 1;                             // Mask: 0x8, PropSize: 0x10xE04(0x1)(None)
	uint8                                        bForceRefreshDataListWidgetAdjacents : 1;          // Mask: 0x10, PropSize: 0x10xE04(0x1)(None)
	uint8                                        BitPad_152 : 3;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1E80[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bBringHoveredItemsToTop;                           // 0xE08(0x1)(None)
	bool                                         bEnableSupportCustomFolders;                       // 0xE09(0x1)(None)
	bool                                         bForceDragging;                                    // 0xE0A(0x1)(None)
	bool                                         bForceEntryDisplayString;                          // 0xE0B(0x1)(None)
	bool                                         bForceEntryClickWhenNoData;                        // 0xE0C(0x1)(None)
	bool                                         bUseExistingButtons;                               // 0xE0D(0x1)(None)
	bool                                         bUseExistingButtonExplicitEntryIndexTypeMapping;   // 0xE0E(0x1)(None)
	bool                                         bSelectEntriesOnHighlight;                         // 0xE0F(0x1)(None)
	int32                                        MinimalItemCount;                                  // 0xE10(0x4)(None)
	bool                                         bSupplyAdjacentsToChildren;                        // 0xE14(0x1)(None)
	bool                                         bCanBeSelectedWhenEmpty;                           // 0xE15(0x1)(None)
	uint8                                        Pad_1E81[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        FilledRowsBeforeEnablingScrolling;                 // 0xE18(0x4)(None)
	uint8                                        Pad_1E82[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UDataListEntryWidget*>          EntryWidgets;                                      // 0xE20(0x10)(ZeroConstructor)
	uint8                                        Pad_1E83[0xC0];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                CustomFolderBlueprint;                             // 0xEF0(0x8)(ZeroConstructor)
	bool                                         bOnlySkins;                                        // 0xEF8(0x1)(None)
	bool                                         bIsSkinSelectorMode;                               // 0xEF9(0x1)(None)
	bool                                         bIncludeSkins;                                     // 0xEFA(0x1)(None)
	bool                                         bCreateFolders;                                    // 0xEFB(0x1)(None)
	int8                                         FolderLevel;                                       // 0xEFC(0x1)(None)
	uint8                                        Pad_1E84[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                CustomFolderFilter;                                // 0xF00(0x10)(None)
	int8                                         SortType;                                          // 0xF10(0x1)(None)
	uint8                                        Pad_1E85[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                NameFilter;                                        // 0xF18(0x10)(None)
	uint8                                        Pad_1E86[0x28];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MyDataListType;                                    // 0xF50(0x4)(None)
	uint8                                        Pad_1E87[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UDataListEntryWidget*>          CurrentCustomFolders;                              // 0xF58(0x10)(ZeroConstructor)
	class UDataListEntryWidget*                  BackWidget;                                        // 0xF68(0x8)(ZeroConstructor)
	uint8                                        Pad_1E88[0x30];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDataListPanel* GetDefaultObj();

	void PreemptiveRequestLoadAllEntries(bool ReturnValue);
};

// 0x0 (0x28 - 0x28)
// Class ShooterGame.DataListProviderInterface
class IDataListProviderInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IDataListProviderInterface* GetDefaultObj();

};

// 0x90 (0x3C0 - 0x330)
// Class ShooterGame.DataListValueGeneric
class UDataListValueGeneric : public UPrimalUserWidget
{
public:
	FMulticastInlineDelegateProperty_            OnValueChanged;                                    // 0x330(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnTextCommitted;                                   // 0x340(0x10)(ZeroConstructor)
	class FText                                  OptionSelectedText;                                // 0x350(0x18)(None)
	TArray<class FText>                          OptionsValues;                                     // 0x368(0x10)(None)
	bool                                         bShowOverrideValue;                                // 0x378(0x1)(None)
	uint8                                        Pad_1EBF[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  OverridedOptionSelectedText;                       // 0x380(0x18)(None)
	struct FLinearColor                          Color;                                             // 0x398(0x10)(None)
	struct FVector2D                             ColorPickerValue;                                  // 0x3A8(0x10)(None)
	uint8                                        Pad_1EC0[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDataListValueGeneric* GetDefaultObj();

	void UpdateColorPicker(const struct FVector2D& ColorPickerSliderValue);
	void SetParameterValue(const class FString& Value, bool bPreventCallParent);
	void SetOverridedParameterValue(class FText Value, bool bPreventRecall);
	void SetOverridedFloatValue(float Value);
	void SetIsSelectedBP(bool Selected);
	void SetFloatValue(float Value);
	void SetBoolValue(bool Value);
	void OnOverridedParameterValue(const class FString& Value, bool bPreventCallParent);
	void IsExpanded(bool ReturnValue);
	void HasSlider(class USlider* ReturnValue);
	void HasExpandedSlider(class USlider* ReturnValue);
	void HandleOnValueChanged(float InValue);
	void HandleOnOverrideValueChanged(class FText Text, enum class ETextCommit CommitMethod);
	void GetOverridedFloatValue(float ReturnValue);
	void GetIsSelectedBP(bool ReturnValue);
	void GetFloatValue(float ReturnValue);
	void GetBoolValue(bool ReturnValue);
	void GetAllValueWidgets(const TArray<class UWidget*>& ReturnValue);
	void CycleDataValues(class UWidget* CurrentHighlighted, int32 Dir, class UWidget* ReturnValue);
	void CloseSlider();
};

// 0x30 (0x4E8 - 0x4B8)
// Class ShooterGame.DayCycleAmbientSound
class ADayCycleAmbientSound : public AActor
{
public:
	class UAudioComponent*                       AudioComponentDay;                                 // 0x4B8(0x8)(ZeroConstructor)
	class UAudioComponent*                       AudioComponentNight;                               // 0x4C0(0x8)(ZeroConstructor)
	float                                        DayTimeSoundMorningFadeInStart;                    // 0x4C8(0x4)(None)
	float                                        DayTimeSoundMorningFadeInEnd;                      // 0x4CC(0x4)(None)
	float                                        DayTimeSoundEveningFadeOutStart;                   // 0x4D0(0x4)(None)
	float                                        DayTimeSoundEveningFadeOutEnd;                     // 0x4D4(0x4)(None)
	uint8                                        bIsAlwaysAudible : 1;                              // Mask: 0x1, PropSize: 0x10x4D8(0x1)(None)
	uint8                                        bAllowConcurrentWithPostProcessSound : 1;          // Mask: 0x2, PropSize: 0x10x4D8(0x1)(None)
	uint8                                        bOnlyAudibleWhenRaining : 1;                       // Mask: 0x4, PropSize: 0x10x4D8(0x1)(None)
	uint8                                        bBlueprintAudibleWhenRainingEnabled : 1;           // Mask: 0x8, PropSize: 0x10x4D8(0x1)(None)
	uint8                                        Pad_1EC3[0xF];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ADayCycleAmbientSound* GetDefaultObj();

};

// 0x180 (0x638 - 0x4B8)
// Class ShooterGame.DayCycleManager
class ADayCycleManager : public AInfo
{
public:
	uint8                                        Pad_1F11[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CurrentTime;                                       // 0x4C0(0x4)(None)
	float                                        TrueSkyTime;                                       // 0x4C4(0x4)(None)
	uint8                                        Pad_1F12[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        TheDayNumberToMakeSerilizationWork;                // 0x4CC(0x4)(None)
	float                                        GlobalTrueSkyBrightness;                           // 0x4D0(0x4)(None)
	uint8                                        Pad_1F13[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               GlobalTrueSkyColorMultiplier;                      // 0x4D8(0x18)(None)
	float                                        GlobalIBLCaptureBrightness;                        // 0x4F0(0x4)(None)
	float                                        GlobalBakeAndStreamIBLMultiplier;                  // 0x4F4(0x4)(None)
	float                                        GlobalGroundColorMultiplier;                       // 0x4F8(0x4)(None)
	float                                        GlobalSkyColorMultiplier;                          // 0x4FC(0x4)(None)
	float                                        SM4SkyLightMult;                                   // 0x500(0x4)(None)
	float                                        SM4DirLightMult;                                   // 0x504(0x4)(None)
	struct FVector                               AtmosphericFogMultiplier;                          // 0x508(0x18)(None)
	float                                        SkyIBLIntensityMultiplier;                         // 0x520(0x4)(None)
	float                                        BaseTemperature;                                   // 0x524(0x4)(None)
	float                                        BaseWind;                                          // 0x528(0x4)(None)
	float                                        RainAmount;                                        // 0x52C(0x4)(None)
	float                                        SnowAmount;                                        // 0x530(0x4)(None)
	float                                        SkyWeatherSequenceBlend_Normal;                    // 0x534(0x4)(None)
	float                                        SkyWeatherSequenceBlend_Hot;                       // 0x538(0x4)(None)
	float                                        SkyWeatherSequenceBlend_Cold;                      // 0x53C(0x4)(None)
	float                                        SkyWeatherSequenceBlend_Rainy;                     // 0x540(0x4)(None)
	float                                        SkyWeatherSequenceBlend_Fog;                       // 0x544(0x4)(None)
	bool                                         bIsRaining;                                        // 0x548(0x1)(None)
	bool                                         bLastReplicatedIsRaining;                          // 0x549(0x1)(None)
	bool                                         bLastReplicatedIsSnowing;                          // 0x54A(0x1)(None)
	uint8                                        Pad_1F14[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USoundBase*                            Sound_TransitionToMorning;                         // 0x550(0x8)(ZeroConstructor)
	class USoundBase*                            Sound_TransitionToMidDay;                          // 0x558(0x8)(ZeroConstructor)
	class USoundBase*                            Sound_TransitionToNight;                           // 0x560(0x8)(ZeroConstructor)
	float                                        Sound_TransitionToMorningTime;                     // 0x568(0x4)(None)
	float                                        Sound_TransitionToNightTime;                       // 0x56C(0x4)(None)
	float                                        Sound_TransitionToMidDayTime;                      // 0x570(0x4)(None)
	float                                        DayTimeStart;                                      // 0x574(0x4)(None)
	float                                        DayTimeEnd;                                        // 0x578(0x4)(None)
	float                                        DayTimeLengthMultiplier;                           // 0x57C(0x4)(None)
	TArray<class ALevelSequenceActor*>           NewLightingSequence;                               // 0x580(0x10)(ZeroConstructor)
	int32                                        ActiveLightingSequence;                            // 0x590(0x4)(None)
	uint8                                        Pad_1F16[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bCheckForStructureActivation;                      // 0x59C(0x1)(None)
	bool                                         bUsesWind;                                         // 0x59D(0x1)(None)
	bool                                         bCheckForWeaponFiring;                             // 0x59E(0x1)(None)
	bool                                         bUseBPOverrideItemAutoDecreaseDurability;          // 0x59F(0x1)(None)
	bool                                         bHideSupplyCrates;                                 // 0x5A0(0x1)(None)
	uint8                                        Pad_1F17[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UClass*>                        PreventBuffClassesInDayCycleLevel;                 // 0x5A8(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnStartDaytime;                                    // 0x5B8(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnStartNighttime;                                  // 0x5C8(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnDayChange;                                       // 0x5D8(0x10)(ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnHazardChange;                                    // 0x5E8(0x10)(ZeroConstructor)
	TArray<class UClass*>                        GenesisTradableOptions;                            // 0x5F8(0x10)(ZeroConstructor)
	class UClass*                                HexagonVFXActorClass;                              // 0x608(0x8)(ZeroConstructor)
	uint8                                        Pad_1F18[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UClass*>                        GivePlayersBuffsOnSpawn;                           // 0x618(0x10)(ZeroConstructor)
	TArray<struct FSoftObjectPath>               GivePlayersBuffAssetsOnSpawn;                      // 0x628(0x10)(None)

	static class UClass* StaticClass();
	static class ADayCycleManager* GetDefaultObj();

	void ShooterCharacterSpawned(class AShooterCharacter* TheShooterCharacter);
	void ShooterCharacterPossessed(class AShooterCharacter* TheShooterCharacter);
	void SetTimeOfDay(int32 Hours, int32 Minutes, int32 Seconds);
	void IsRainingAtLocation(const struct FVector& Location, bool ReturnValue);
	void IsDaytime(bool ReturnValue);
	void GetWindAtLocation(const struct FVector& AtLocation, class APrimalCharacter* ForPrimalCharacter, float ReturnValue);
	void GetWeatherModifiedAmbientSoundMultiplier(class ADayCycleAmbientSound* ForDayCycleAmbientSound, float ReturnValue);
	void GetWaterLineStartZ(const struct FVector& AtLocation, float ReturnValue);
	void GetTemperatureAtLocation(const struct FVector& AtLocation, class APrimalCharacter* ForPrimalCharacter, float ReturnValue);
	void GetPreventBuffClassesInDayCycleLevel(const TArray<class UClass*>& ReturnValue);
	void GetDeepWaterStartZ(const struct FVector& AtLocation, float ReturnValue);
	void GetDayNumberString(bool bIncludeDayString, const class FString& ReturnValue);
	void BPPostDrawSpawnMap(class AShooterPlayerController* ForPC, class UCanvas* ItemCanvas, const struct FVector2D& ItemCanvasSize);
	void BPOverrideItemAutoDecreaseDurability(class UPrimalItem* AnItem, bool ReturnValue);
	void BPOverrideGameStateMatineePlayRate(class AActor* ForMatinee, float InPlayRate, float ReturnValue);
	void BPOnDCMCheat(class FName CheatName, float Value);
	void BPGetAdditionalMapMarkers(class AShooterPlayerController* ForPC, const TArray<struct FPrimalMapMarkerEntryData>& ReturnValue);
	void BPAllowSpawningCrate(class UClass* CrateType, bool ReturnValue);
	void BPAdjustTemperature(float TemperatureIn, class ABiomeZoneVolume* BiomeZoneVolume, const struct FVector& AtLocation, class APrimalCharacter* ForPrimalCharacter, float ReturnValue);
	void AttemptWeaponFiring(class AShooterWeapon* TheWeapon);
	void AllowWeaponFiring(class AActor* TheWeaponOrStructure, bool ReturnValue);
	void AllowStructureActivation(class APrimalStructure* TheStructure, bool ReturnValue);
	void AdjustStructureItemInsulation(class AShooterCharacter* ForCharacter, class UPrimalItem* ForPrimalItem, enum class EPrimalItemStat TypeInsulation, float InsulationValue, float ReturnValue);
};

// 0xB0 (0xD8 - 0x28)
// Class ShooterGame.DeferredMovementContext
class UDeferredMovementContext : public UObject
{
public:
	uint8                                        Pad_1F1D[0x70];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TWeakObjectPtr<class UPrimalCharacterMovement>> DeferredComponents;                                // 0x98(0x10)(None)
	struct FDeferredMovementTick                 TickFunction;                                      // 0xA8(0x30)(None)

	static class UClass* StaticClass();
	static class UDeferredMovementContext* GetDefaultObj();

};

// 0x8 (0x4C0 - 0x4B8)
// Class ShooterGame.DestructibleActor
class ADestructibleActor : public ADestructibleBaseActor
{
public:
	class USceneComponent*                       ActorRootComponent;                                // 0x4B8(0x8)(ZeroConstructor)

	static class UClass* StaticClass();
	static class ADestructibleActor* GetDefaultObj();

	void SetFadingStaticMesh(class UStaticMesh* TheMesh);
	void SetFadingSkeletalMesh(class USkeletalMesh* TheMesh);
	void GetFadingMeshComponent(class UMeshComponent* ReturnValue);
};

// 0x18 (0x4D8 - 0x4C0)
// Class ShooterGame.DestroyedMeshActor
class ADestroyedMeshActor : public ADestructibleActor
{
public:
	float                                        TimeToSetNoCollision;                              // 0x4C0(0x4)(None)
	class FName                                  NoCollisionProfileName;                            // 0x4C4(0x8)(None)
	class FName                                  DefaultCollisionProfileName;                       // 0x4CC(0x8)(None)
	uint8                                        Pad_1F1E[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ADestroyedMeshActor* GetDefaultObj();

	void SetNoCollisionProfile();
};

// 0x20 (0x778 - 0x758)
// Class ShooterGame.DinoAncestryEntryWidget
class UDinoAncestryEntryWidget : public UPrimalUI
{
public:
	uint8                                        Pad_1F1F[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDinoAncestryEntryWidget* GetDefaultObj();

};

// 0x198 (0x8F0 - 0x758)
// Class ShooterGame.DinoListButtonWidget
class UDinoListButtonWidget : public UBaseSelectableButtonWidget
{
public:
	class FName                                  ContextMenuAnchorName;                             // 0x758(0x8)(None)
	class FName                                  DinoStatusLabelName;                               // 0x760(0x8)(None)
	class FName                                  ExpirationLabelName;                               // 0x768(0x8)(None)
	class FName                                  ExpirationLabelParentName;                         // 0x770(0x8)(None)
	uint8                                        bSelectOnClicked : 1;                              // Mask: 0x1, PropSize: 0x10x778(0x1)(None)
	uint8                                        BitPad_15D : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1F21[0x167];                                   // Fixing Size After Last Property  [ Dumper-7 ]
	class UMenuAnchor*                           ContextMenuAnchor;                                 // 0x8E0(0x8)(ZeroConstructor)
	uint8                                        Pad_1F23[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDinoListButtonWidget* GetDefaultObj();

	void SetDinoExpiration(const class FString& Expiration);
	void SetButtonString(const class FString& Status);
	void OnGetContextMenuContent(class UWidget* ReturnValue);
	void InitializeWithClick(bool bCanExpire);
	void ForceSetSelected(bool bSelected);
};

// 0x88 (0x3B8 - 0x330)
// Class ShooterGame.ToolTipWidget
class UToolTipWidget : public UPrimalUserWidget
{
public:
	class FString                                ToolTipLabelName;                                  // 0x330(0x10)(None)
	int32                                        WidgetWidth;                                       // 0x340(0x4)(None)
	int32                                        WidgetHeight;                                      // 0x344(0x4)(None)
	uint8                                        bDoOverlayFade : 1;                                // Mask: 0x1, PropSize: 0x10x348(0x1)(None)
	uint8                                        BitPad_15E : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1F24[0x17];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bUseBPInitToolTip;                                 // 0x360(0x1)(None)
	bool                                         bUseBPUpdateToolTip;                               // 0x361(0x1)(None)
	uint8                                        Pad_1F25[0x56];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UToolTipWidget* GetDefaultObj();

	void BPUpdateToolTip(float DeltaSeconds);
	void BPInitToolTip(class AShooterPlayerController* HUDOwner, const class FString& ToolTipString, class UObject* DataListEntry);
};

// 0x0 (0x3B8 - 0x3B8)
// Class ShooterGame.TooltipSmartLayoutWidget
class UTooltipSmartLayoutWidget : public UToolTipWidget
{
public:

	static class UClass* StaticClass();
	static class UTooltipSmartLayoutWidget* GetDefaultObj();

};

// 0x1C8 (0x580 - 0x3B8)
// Class ShooterGame.DinoListItemTooltip
class UDinoListItemTooltip : public UTooltipSmartLayoutWidget
{
public:
	class FName                                  FnameTitleBar_NameLabel;                           // 0x3B8(0x8)(None)
	class FName                                  FnameTitleBar_LevelLabel;                          // 0x3C0(0x8)(None)
	class FName                                  FnameInfo_ImageName;                               // 0x3C8(0x8)(None)
	TArray<class FName>                          FnameInfo_LabelNames;                              // 0x3D0(0x10)(None)
	TArray<class FName>                          FnameInfo_GroupNames;                              // 0x3E0(0x10)(None)
	float                                        Info_GroupFreq;                                    // 0x3F0(0x4)(None)
	uint8                                        Pad_1F27[0x17C];                                   // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            EnabledDinoTexture;                                // 0x570(0x8)(ZeroConstructor)
	class UMaterialInterface*                    EnabledDinoMaterial;                               // 0x578(0x8)(ZeroConstructor)

	static class UClass* StaticClass();
	static class UDinoListItemTooltip* GetDefaultObj();

};

// 0x120 (0x150 - 0x30)
// Class ShooterGame.DinoSetupDataAsset
class UDinoSetupDataAsset : public UDataAsset
{
public:
	struct FDinoSetup                            DinoSetup;                                         // 0x30(0x120)(ZeroConstructor)

	static class UClass* StaticClass();
	static class UDinoSetupDataAsset* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class ShooterGame.Object_WithWorldContext
class UObject_WithWorldContext : public UObject
{
public:
	uint8                                        Pad_1F28[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UObject_WithWorldContext* GetDefaultObj();

	void SetWorldContext(class UObject* NewWorldContext);
	void GetWorldContextObject(class UObject* ReturnValue);
};

// 0x20 (0x50 - 0x30)
// Class ShooterGame.DinoTrackFilterOption
class UDinoTrackFilterOption : public UObject_WithWorldContext
{
public:
	class FString                                FilterDisplayName;                                 // 0x30(0x10)(None)
	class FString                                OverwrittenAdditionalSearchInputDisplayName;       // 0x40(0x10)(None)

	static class UClass* StaticClass();
	static class UDinoTrackFilterOption* GetDefaultObj();

	void GetSearchActorListType(int32 ReturnValue);
	void GetOverwrittenAdditionalSearchInputDisplayName(const class FString& ReturnValue);
	void GetFilterDisplayName(const class FString& ReturnValue);
	void GetActorsToSearchThrough(const TArray<class AActor*>& ReturnValue);
};

// 0x0 (0x4C8 - 0x4C8)
// Class ShooterGame.DirectionalAmbientLight
class ADirectionalAmbientLight : public ALight
{
public:

	static class UClass* StaticClass();
	static class ADirectionalAmbientLight* GetDefaultObj();

};

// 0x0 (0x4C8 - 0x4C8)
// Class ShooterGame.DirectionalInjectedLight
class ADirectionalInjectedLight : public ALight
{
public:

	static class UClass* StaticClass();
	static class ADirectionalInjectedLight* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class ShooterGame.DraggableObjectInterface
class IDraggableObjectInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IDraggableObjectInterface* GetDefaultObj();

};

// 0x20 (0x7B0 - 0x790)
// Class ShooterGame.DraggedDecoratorWidget
class UDraggedDecoratorWidget : public UCustomCanvasWidget
{
public:
	class UMaterialInterface*                    DraggedMaterial;                                   // 0x790(0x8)(ZeroConstructor)
	class UTexture2D*                            DraggedTexture;                                    // 0x798(0x8)(ZeroConstructor)
	uint8                                        Pad_1F2A[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDraggedDecoratorWidget* GetDefaultObj();

};

// 0x3D8 (0x890 - 0x4B8)
// Class ShooterGame.DroppedItem
class ADroppedItem : public AActor
{
public:
	uint8                                        Pad_1F2E[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FItemNetInfo                          MyItemInfo;                                        // 0x4C8(0x1C8)(ZeroConstructor)
	class UPrimalItem*                           MyItem;                                            // 0x690(0x8)(ZeroConstructor)
	uint8                                        bApplyImpulseOnSpawn : 1;                          // Mask: 0x1, PropSize: 0x10x698(0x1)(None)
	uint8                                        bDestroyOnStasis : 1;                              // Mask: 0x2, PropSize: 0x10x698(0x1)(None)
	uint8                                        bUseCollisionTrace : 1;                            // Mask: 0x4, PropSize: 0x10x698(0x1)(None)
	uint8                                        bPreventPickup : 1;                                // Mask: 0x8, PropSize: 0x10x698(0x1)(None)
	uint8                                        bDestroyOutOfWater : 1;                            // Mask: 0x10, PropSize: 0x10x698(0x1)(None)
	uint8                                        bUseClientDroppedItemPhysics : 1;                  // Mask: 0x20, PropSize: 0x10x698(0x1)(None)
	uint8                                        bIsUnderwater : 1;                                 // Mask: 0x40, PropSize: 0x10x698(0x1)(None)
	uint8                                        bNotifyPreviousOwnerOfPickup : 1;                  // Mask: 0x80, PropSize: 0x10x698(0x1)(None)
	uint8                                        bAssignedToTribePickupOnly : 1;                    // Mask: 0x1, PropSize: 0x10x699(0x1)(None)
	uint8                                        BitPad_160 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1F30[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        AssignedToTribeID;                                 // 0x69C(0x4)(None)
	uint8                                        bLowQuality : 1;                                   // Mask: 0x1, PropSize: 0x10x6A0(0x1)(None)
	uint8                                        BitPad_161 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1F31[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ImpulseMagnitude;                                  // 0x6A4(0x4)(None)
	bool                                         bUseImpulseOffsetRanges;                           // 0x6A8(0x1)(None)
	uint8                                        Pad_1F32[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRotator                              ImpulseOffsetRanges;                               // 0x6B0(0x18)(None)
	float                                        ForceSleepTimer;                                   // 0x6C8(0x4)(None)
	uint8                                        Pad_1F33[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               DroppedItemScale;                                  // 0x6D0(0x18)(None)
	struct FVector2D                             OverlayTooltipPadding;                             // 0x6E8(0x10)(None)
	struct FVector2D                             OverlayTooltipScale;                               // 0x6F8(0x10)(None)
	struct FVector                               CenterLocationOffset;                              // 0x708(0x18)(None)
	class UClass*                                HUDOverlayToolTipWidget;                           // 0x720(0x8)(ZeroConstructor)
	class UClass*                                HUDOverlayToolTipWidgetOnlyAction;                 // 0x728(0x8)(ZeroConstructor)
	class FString                                DroppedByName;                                     // 0x730(0x10)(None)
	uint64                                       DroppedByPlayerID;                                 // 0x740(0x8)(None)
	double                                       DroppedItemDestructionTime;                        // 0x748(0x8)(None)
	struct FVector                               DroppedItemInterpTarget;                           // 0x750(0x18)(None)
	bool                                         bClientDisablePhysics;                             // 0x768(0x1)(None)
	uint8                                        Pad_1F34[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UStaticMesh*                           NetDroppedMeshOverride;                            // 0x770(0x8)(ZeroConstructor)
	class UMaterialInterface*                    NetDroppedMeshMaterialOverride;                    // 0x778(0x8)(ZeroConstructor)
	struct FVector                               NetDroppedMeshOverrideScale3D;                     // 0x780(0x18)(None)
	struct FVector                               DroppedItemVelocity;                               // 0x798(0x18)(None)
	float                                        DroppedItemAccelerationGravity;                    // 0x7B0(0x4)(None)
	float                                        DroppedItemMaxFallSpeed;                           // 0x7B4(0x4)(None)
	uint8                                        Pad_1F35[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       SpawnDropSoundTime;                                // 0x7D0(0x8)(None)
	uint8                                        Pad_1F36[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bIsPreventDroppedItemPhysics;                      // 0x7F0(0x1)(None)
	uint8                                        Pad_1F37[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TWeakObjectPtr<class AActor>                 DroppedByActor;                                    // 0x7F4(0x8)(ZeroConstructor)
	uint8                                        Pad_1F38[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class APrimalCharacter*                      BasedTransformCharacter;                           // 0x800(0x8)(ZeroConstructor)
	struct FVector                               BasedTransformLocation;                            // 0x808(0x18)(None)
	struct FVector                               BasedTransformVelocity;                            // 0x820(0x18)(None)
	class UStaticMesh*                           UsedMeshAsset;                                     // 0x838(0x8)(ZeroConstructor)
	bool                                         bUseBPDroppedItemImpacted;                         // 0x840(0x1)(None)
	bool                                         bUseBPSetupDroppedItemVisuals;                     // 0x841(0x1)(None)
	bool                                         bPreventDropAttachment;                            // 0x842(0x1)(None)
	uint8                                        Pad_1F39[0x2D];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FreezePhysicsAfterTime;                            // 0x870(0x4)(None)
	float                                        PickupAllRange;                                    // 0x874(0x4)(None)
	uint8                                        Pad_1F3A[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bBPOnItemPickedUp : 1;                             // Mask: 0x1, PropSize: 0x10x880(0x1)(None)
	uint8                                        BitPad_162 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1F3B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            PickupIcon;                                        // 0x888(0x8)(ZeroConstructor)

	static class UClass* StaticClass();
	static class ADroppedItem* GetDefaultObj();

	void ResetLifeSpan(float NewLifeSpan);
	void ReplicateMovement();
	void KeepPhysicsActiveForDuration(float Duration);
	void IsAllowedToPickupItem(class APlayerController* PC, bool ReturnValue);
	void FreezePhysics();
	void ForceSleep();
	void BPSetupDroppedItemVisuals();
	void BPOnItemPickedUp(class APlayerController* ByPC, class UPrimalItem* InventoryItem);
	void BPDroppedItemImpacted(const struct FHitResult& ImpactHitInfo);
};

// 0x30 (0x8C0 - 0x890)
// Class ShooterGame.DroppedItemEgg
class ADroppedItemEgg : public ADroppedItem
{
public:
	class UClass*                                SpawnDinoEmitter;                                  // 0x890(0x8)(ZeroConstructor)
	float                                        IndoorsHypoThermalInsulation;                      // 0x898(0x4)(None)
	float                                        IndoorsHyperThermalInsulation;                     // 0x89C(0x4)(None)
	float                                        EggThermalInsulationTemperatureMultiplier;         // 0x8A0(0x4)(None)
	uint8                                        bIsEggTooHot : 1;                                  // Mask: 0x1, PropSize: 0x10x8A4(0x1)(None)
	uint8                                        bIsEggTooCold : 1;                                 // Mask: 0x2, PropSize: 0x10x8A4(0x1)(None)
	uint8                                        BitPad_163 : 6;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1F3D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ABiomeZoneVolume*                      MyBiomeZone;                                       // 0x8A8(0x8)(ZeroConstructor)
	uint8                                        Pad_1F3E[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ADroppedItemEgg* GetDefaultObj();

	void NetSpawnDinoEmitter();
};

// 0x0 (0x890 - 0x890)
// Class ShooterGame.DroppedItemLowQuality
class ADroppedItemLowQuality : public ADroppedItem
{
public:

	static class UClass* StaticClass();
	static class ADroppedItemLowQuality* GetDefaultObj();

};

// 0x10 (0x8A0 - 0x890)
// Class ShooterGame.DroppedItemMission
class ADroppedItemMission : public ADroppedItem
{
public:
	uint8                                        bPickupOnlyAllowMissionPlayers : 1;                // Mask: 0x1, PropSize: 0x10x890(0x1)(None)
	uint8                                        bShowHUDMissionInfo : 1;                           // Mask: 0x2, PropSize: 0x10x890(0x1)(None)
	uint8                                        BitPad_164 : 6;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1F41[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AMissionType*                          OwnerMission;                                      // 0x898(0x8)(ZeroConstructor)

	static class UClass* StaticClass();
	static class ADroppedItemMission* GetDefaultObj();

	void GetOwnerMission(class AMissionType* ReturnValue);
};

// 0x20 (0x8B0 - 0x890)
// Class ShooterGame.DroppedItemTorch
class ADroppedItemTorch : public ADroppedItemLowQuality
{
public:
	float                                        LifeTimeMeter;                                     // 0x890(0x4)(None)
	float                                        PassiveDurabilityCostPerInterval;                  // 0x894(0x4)(None)
	float                                        PassiveDurabilityCostInterval;                     // 0x898(0x4)(None)
