#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x778 (0xED0 - 0x758)
// WidgetBlueprintGeneratedClass UI_ModPage.UI_ModPage_C
class UUI_ModPage_C : public UPrimalUI
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x758(0x8)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                      NotifyAnim;                                        // 0x760(0x8)(Edit, ZeroConstructor)
	class UWidgetAnimation*                      HoverInDownloadedThumbnail;                        // 0x768(0x8)(Edit, ZeroConstructor)
	class UWidgetAnimation*                      OnScreenshotLoaded;                                // 0x770(0x8)(Edit, ZeroConstructor)
	class UWidgetAnimation*                      HoverInPreloadedThumbnail;                         // 0x778(0x8)(Edit, ZeroConstructor)
	class UWidgetAnimation*                      OnBeginPlay;                                       // 0x780(0x8)(Edit, ZeroConstructor)
	class UButton*                               Button_Close;                                      // 0x788(0x8)(Edit, ZeroConstructor)
	class UButton*                               Button_Comments;                                   // 0x790(0x8)(Edit, ZeroConstructor)
	class UButton*                               Button_GameImages;                                 // 0x798(0x8)(Edit, ZeroConstructor)
	class UButton*                               Button_ModInstalled;                               // 0x7A0(0x8)(Edit, ZeroConstructor)
	class UButton*                               BUTTON_REPORT;                                     // 0x7A8(0x8)(Edit, ZeroConstructor)
	class UButton*                               Button_Uninstall;                                  // 0x7B0(0x8)(Edit, ZeroConstructor)
	class UVerticalBox*                          CategoriesVer;                                     // 0x7B8(0x8)(Edit, ZeroConstructor)
	class UCFCoreRichText*                       CFCoreRichText_97;                                 // 0x7C0(0x8)(Edit, ZeroConstructor)
	class UHorizontalBox*                        HorizontalBox_167;                                 // 0x7C8(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_47;                                          // 0x7D0(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_96;                                          // 0x7D8(0x8)(Edit, ZeroConstructor)
	class UImage*                                IMG_AddonsIcon;                                    // 0x7E0(0x8)(Edit, ZeroConstructor)
	class UImage*                                IMG_AddonsIcon_1;                                  // 0x7E8(0x8)(Edit, ZeroConstructor)
	class UImage*                                IMG_Background;                                    // 0x7F0(0x8)(Edit, ZeroConstructor)
	class UImage*                                IMG_DownloadIcon;                                  // 0x7F8(0x8)(Edit, ZeroConstructor)
	class UImage*                                IMG_Files;                                         // 0x800(0x8)(Edit, ZeroConstructor)
	class UImage*                                IMG_GameImagesBackground;                          // 0x808(0x8)(Edit, ZeroConstructor)
	class UImage*                                IMG_HB1;                                           // 0x810(0x8)(Edit, ZeroConstructor)
	class UImage*                                IMG_HB2;                                           // 0x818(0x8)(Edit, ZeroConstructor)
	class UImage*                                IMG_HB3;                                           // 0x820(0x8)(Edit, ZeroConstructor)
	class UImage*                                IMG_HB3_1;                                         // 0x828(0x8)(Edit, ZeroConstructor)
	class UButton*                               IMG_ImageZoom;                                     // 0x830(0x8)(Edit, ZeroConstructor)
	class UImage*                                IMG_ModThumbnail;                                  // 0x838(0x8)(Edit, ZeroConstructor)
	class UButton*                               IMG_NextImage;                                     // 0x840(0x8)(Edit, ZeroConstructor)
	class UImage*                                IMG_PD_Back;                                       // 0x848(0x8)(Edit, ZeroConstructor)
	class UImage*                                IMG_PD_Back_1;                                     // 0x850(0x8)(Edit, ZeroConstructor)
	class UImage*                                IMG_PD_Back_2;                                     // 0x858(0x8)(Edit, ZeroConstructor)
	class UImage*                                IMG_PD_Back_3;                                     // 0x860(0x8)(Edit, ZeroConstructor)
	class UButton*                               IMG_PrevImage;                                     // 0x868(0x8)(Edit, ZeroConstructor)
	class UImage*                                IMG_Rating_Back;                                   // 0x870(0x8)(Edit, ZeroConstructor)
	class UImage*                                IMG_Rating_Back_1;                                 // 0x878(0x8)(Edit, ZeroConstructor)
	class UImage*                                IMG_Spacer;                                        // 0x880(0x8)(Edit, ZeroConstructor)
	class UImage*                                IMG_Thumbnail;                                     // 0x888(0x8)(Edit, ZeroConstructor)
	class UImage*                                IMG_Time;                                          // 0x890(0x8)(Edit, ZeroConstructor)
	class UImage*                                IMG_Time_1;                                        // 0x898(0x8)(Edit, ZeroConstructor)
	class UImage*                                IMG_Version;                                       // 0x8A0(0x8)(Edit, ZeroConstructor)
	class UOverlay*                              Overlay_Window_Rating;                             // 0x8A8(0x8)(Edit, ZeroConstructor)
	class UOverlay*                              Overlay_Window_Unavailable;                        // 0x8B0(0x8)(Edit, ZeroConstructor)
	class USizeBox*                              SizeBox_Description;                               // 0x8B8(0x8)(Edit, ZeroConstructor)
	class USpacer*                               Spacer_6;                                          // 0x8C0(0x8)(Edit, ZeroConstructor)
	class USpacer*                               Spacer_99;                                         // 0x8C8(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            TEXT_BrowseMods;                                   // 0x8D0(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            TEXT_BrowseMods_1;                                 // 0x8D8(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            TEXT_By;                                           // 0x8E0(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            TEXT_Class;                                        // 0x8E8(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            TEXT_Date;                                         // 0x8F0(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            TEXT_DateCreated;                                  // 0x8F8(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            TEXT_DateUpdated;                                  // 0x900(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            TEXT_FileSize;                                     // 0x908(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            TEXT_FileSizeAmount;                               // 0x910(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            TEXT_HB;                                           // 0x918(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            TEXT_Installs;                                     // 0x920(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            TEXT_Message;                                      // 0x928(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            TEXT_ModAuthor;                                    // 0x930(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            TEXT_ModTitle;                                     // 0x938(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            TEXT_ModVersion;                                   // 0x940(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            TEXT_ModVersionNumber;                             // 0x948(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            TEXT_Name;                                         // 0x950(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            TEXT_Rating_Percent;                               // 0x958(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            TEXT_Report;                                       // 0x960(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            TEXT_Report_1;                                     // 0x968(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            TEXT_RT;                                           // 0x970(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            TEXT_RT_1;                                         // 0x978(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            TEXT_UpdatedDate;                                  // 0x980(0x8)(Edit, ZeroConstructor)
	class UUI_Button_Ark_Blue_C*                 UI_Button_Ark_Back;                                // 0x988(0x8)(Edit, ZeroConstructor)
	class UUI_LikeDislikeButton_C*               UI_DislikeButton;                                  // 0x990(0x8)(Edit, ZeroConstructor)
	class UUI_Button_Install_C*                  UI_InstallButton;                                  // 0x998(0x8)(Edit, ZeroConstructor)
	class UUI_LikeDislikeButton_C*               UI_LikeButton;                                     // 0x9A0(0x8)(Edit, ZeroConstructor)
	class UVerticalBox*                          VerticalBox_208;                                   // 0x9A8(0x8)(Edit, ZeroConstructor)
	class UWidgetSwitcher*                       WidgetSwitcher_Status;                             // 0x9B0(0x8)(Edit, ZeroConstructor)
	class UUI_ZoomImage_C*                       UI_ZoomImageUI;                                    // 0x9B8(0x8)(Edit, ZeroConstructor)
	class UUI_GameSlot_C*                        UI_GameSlotRef;                                    // 0x9C0(0x8)(Edit, ZeroConstructor)
	struct FInstallProgressMod                   ModDetails;                                        // 0x9C8(0x488)(Edit, ZeroConstructor, AutoWeak, Protected, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        CurrentImageIndex;                                 // 0xE50(0x4)(None)
	bool                                         IsDownloading;                                     // 0xE54(0x1)(None)
	uint8                                        Pad_354D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ScreenshotsIterator;                               // 0xE58(0x4)(None)
	uint8                                        Pad_354E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UUI_StoreMenu_C*                       UI_StoreMenu;                                      // 0xE60(0x8)(Edit, ZeroConstructor)
	class UUI_RightClickMenu_C*                  UI_DropdownMenuR;                                  // 0xE68(0x8)(Edit, ZeroConstructor)
	class UUI_Prompt_GoToComments_C*             UI_GoToCommentsPrompt;                             // 0xE70(0x8)(Edit, ZeroConstructor)
	enum class EGameModsEvent                    Evt;                                               // 0xE78(0x1)(None)
	uint8                                        Pad_354F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<enum class EGameModsEvent>            Evts;                                              // 0xE80(0x10)(SimpleDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, NativeAccessSpecifierPrivate)
	bool                                         CreatedInServerModPage;                            // 0xE90(0x1)(None)
	bool                                         Available;                                         // 0xE91(0x1)(None)
	uint8                                        Pad_3550[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UUI_Prompt_Uninstall_C*                UninstallWB;                                       // 0xE98(0x8)(Edit, ZeroConstructor)
	FMulticastInlineDelegateProperty_            OnReturnClicked;                                   // 0xEA0(0x10)(ZeroConstructor, ContainsInstancedReference, AssetRegistrySearchable, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, NativeAccessSpecifierPrivate)
	struct FModsDirInfo                          Mods_Dir_Info;                                     // 0xEB0(0x20)(None)

	static class UClass* StaticClass();
	static class UUI_ModPage_C* GetDefaultObj();

	void OnEventBroadcasted(enum class EGameModsEvent Evt, const TArray<struct FInstallProgressMod>& ModsList, const struct FCFCoreApiResponsePagination& Pagination, bool ReturnValue, const struct FInstallProgressMod& NewInformation, const struct FInstallProgressMod& TempMod, int32 Temp_int_Array_Index_Variable, int32 CallFunc_Array_Length_ReturnValue, const struct FInstallProgressMod& CallFunc_Array_Get_Item, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_EqualEqual_Int64Int64_ReturnValue);
	void GetClose_B(class UWidget* Widget);
	void SequenceEvent__ENTRYPOINTUI_ModPage_0(class UImage* IMG_Mod);
	void SequenceEvent__ENTRYPOINTUI_ModPage(class UImage* IMG_Mod);
