#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x11D (0x11D - 0x0)
// Function UI_Prompt_Report.UI_Prompt_Report_C.CheckIfDropLine
struct UUI_Prompt_Report_C_CheckIfDropLine_Params
{
public:
	class FText                                  Text;                                              // 0x0(0x18)(ContainsInstancedReference, AdvancedDisplay, BlueprintAuthorityOnly, TextExportTransient, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class FString                                CallFunc_Conv_TextToString_ReturnValue;            // 0x18(0x10)(ContainsInstancedReference, NonPIEDuplicateTransient, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	int32                                        CallFunc_Len_ReturnValue;                          // 0x28(0x4)(None)
	int32                                        CallFunc_Array_Length_ReturnValue;                 // 0x2C(0x4)(None)
	int32                                        CallFunc_Len_ReturnValue_1;                        // 0x30(0x4)(None)
	bool                                         CallFunc_Less_IntInt_ReturnValue;                  // 0x34(0x1)(None)
	uint8                                        Pad_4AB8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_Array_Length_ReturnValue_1;               // 0x38(0x4)(None)
	bool                                         CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x3C(0x1)(None)
	uint8                                        Pad_4AB9[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_Array_Length_ReturnValue_2;               // 0x40(0x4)(None)
	bool                                         CallFunc_Less_IntInt_ReturnValue_1;                // 0x44(0x1)(None)
	uint8                                        Pad_4ABA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_Array_Add_ReturnValue;                    // 0x48(0x4)(None)
	uint8                                        Pad_4ABB[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData;              // 0x50(0x50)(ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, NonPIEDuplicateTransient, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         CallFunc_Less_IntInt_ReturnValue_2;                // 0xA0(0x1)(None)
	uint8                                        Pad_4ABC[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array;                            // 0xA8(0x10)(AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class FText                                  CallFunc_Format_ReturnValue;                       // 0xB8(0x18)(SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	bool                                         CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0xD0(0x1)(None)
	uint8                                        Pad_4ABD[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                CallFunc_Conv_TextToString_ReturnValue_1;          // 0xD8(0x10)(None)
	int32                                        CallFunc_Len_ReturnValue_2;                        // 0xE8(0x4)(None)
	bool                                         CallFunc_EqualEqual_IntInt_ReturnValue;            // 0xEC(0x1)(None)
	bool                                         CallFunc_Greater_IntInt_ReturnValue;               // 0xED(0x1)(None)
	uint8                                        Pad_4ABE[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_Array_Length_ReturnValue_3;               // 0xF0(0x4)(None)
	int32                                        CallFunc_Add_IntInt_ReturnValue;                   // 0xF4(0x4)(None)
	bool                                         CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0xF8(0x1)(None)
	uint8                                        Pad_4ABF[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Temp_int_Variable;                                 // 0xFC(0x4)(None)
	int32                                        CallFunc_Array_Length_ReturnValue_4;               // 0x100(0x4)(None)
	int32                                        CallFunc_Array_LastIndex_ReturnValue;              // 0x104(0x4)(None)
	bool                                         CallFunc_Greater_IntInt_ReturnValue_1;             // 0x108(0x1)(None)
	uint8                                        Pad_4AC0[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_Array_Get_Item;                           // 0x10C(0x4)(None)
	int32                                        Temp_int_Variable_1;                               // 0x110(0x4)(None)
	bool                                         CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x114(0x1)(None)
	uint8                                        Pad_4AC1[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_Subtract_IntInt_ReturnValue;              // 0x118(0x4)(None)
	bool                                         CallFunc_GreaterEqual_IntInt_ReturnValue_3;        // 0x11C(0x1)(None)
};

// 0xC0 (0xC0 - 0x0)
// Function UI_Prompt_Report.UI_Prompt_Report_C.AddReasonOptions
struct UUI_Prompt_Report_C_AddReasonOptions_Params
{
public:
	int32                                        Temp_int_Array_Index_Variable;                     // 0x0(0x4)(None)
	int32                                        Temp_int_Loop_Counter_Variable;                    // 0x4(0x4)(None)
	int32                                        CallFunc_Add_IntInt_ReturnValue;                   // 0x8(0x4)(None)
	uint8                                        Pad_4ACF[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSTRUCT_CustomComboBoxOption          K2Node_MakeStruct_STRUCT_CustomComboBoxOption;     // 0x10(0x38)(Protected, BlueprintAuthorityOnly, TextExportTransient, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	struct FReportingReason                      CallFunc_Array_Get_Item;                           // 0x48(0x38)(ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, BlueprintAuthorityOnly, TextExportTransient, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	int32                                        CallFunc_Array_Length_ReturnValue;                 // 0x80(0x4)(None)
	bool                                         CallFunc_Less_IntInt_ReturnValue;                  // 0x84(0x1)(None)
	uint8                                        Pad_4ADF[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSTRUCT_CustomComboBoxOption          K2Node_MakeStruct_STRUCT_CustomComboBoxOption_1;   // 0x88(0x38)(None)
};

// 0x149 (0x149 - 0x0)
// Function UI_Prompt_Report.UI_Prompt_Report_C.OnKeyDown
struct UUI_Prompt_Report_C_OnKeyDown_Params
{
public:
	struct FGeometry                             MyGeometry;                                        // 0x0(0x38)(None)
	struct FKeyEvent                             InKeyEvent;                                        // 0x38(0x40)(ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, NonPIEDuplicateTransient, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	struct FEventReply                           ReturnValue;                                       // 0x78(0xB8)(AssetRegistrySearchable, AdvancedDisplay, NonPIEDuplicateTransient, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	struct FKey                                  CallFunc_GetKey_ReturnValue;                       // 0x130(0x18)(None)
	bool                                         CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x148(0x1)(None)
};

// 0x18 (0x18 - 0x0)
// Function UI_Prompt_Report.UI_Prompt_Report_C.BndEvt__Report_UI_MultiLineTextBox_Description_K2Node_ComponentBoundEvent_14_OnMultiLineEditableTextBoxChangedEvent__DelegateSignature
struct UUI_Prompt_Report_C_BndEvt__Report_UI_MultiLineTextBox_Description_K2Node_ComponentBoundEvent_14_OnMultiLineEditableTextBoxChangedEvent__DelegateSignature_Params
{
public:
	class FText                                  Text;                                              // 0x0(0x18)(None)
};

// 0x10 (0x10 - 0x0)
// Function UI_Prompt_Report.UI_Prompt_Report_C.BndEvt__Report_UI_SortBySelect_K2Node_ComponentBoundEvent_1_OnOptionSelected__DelegateSignature
struct UUI_Prompt_Report_C_BndEvt__Report_UI_SortBySelect_K2Node_ComponentBoundEvent_1_OnOptionSelected__DelegateSignature_Params
{
public:
	class FString                                Option;                                            // 0x0(0x10)(None)
};

// 0x38 (0x38 - 0x0)
// Function UI_Prompt_Report.UI_Prompt_Report_C.Event On Failed Reporting
struct UUI_Prompt_Report_C_Event_On_Failed_Reporting_Params
{
public:
	struct FCFCoreError                          Error;                                             // 0x0(0x38)(None)
};

// 0x38 (0x38 - 0x0)
// Function UI_Prompt_Report.UI_Prompt_Report_C.Event On Failed Get Report Reasons
struct UUI_Prompt_Report_C_Event_On_Failed_Get_Report_Reasons_Params
{
public:
	struct FCFCoreError                          Error;                                             // 0x0(0x38)(None)
};

// 0x10 (0x10 - 0x0)
// Function UI_Prompt_Report.UI_Prompt_Report_C.Event On Get Reporting Reasons
struct UUI_Prompt_Report_C_Event_On_Get_Reporting_Reasons_Params
{
public:
	TArray<struct FReportingReason>              Reasons;                                           // 0x0(0x10)(None)
};

// 0x1A1 (0x1A1 - 0x0)
// Function UI_Prompt_Report.UI_Prompt_Report_C.ExecuteUbergraph_UI_Prompt_Report
struct UUI_Prompt_Report_C_ExecuteUbergraph_UI_Prompt_Report_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(None)
	int32                                        Temp_int_Array_Index_Variable;                     // 0x4(0x4)(None)
	class APlayerController*                     CallFunc_GetOwningPlayer_ReturnValue;              // 0x8(0x8)(Edit, ZeroConstructor)
	class FText                                  K2Node_ComponentBoundEvent_Text;                   // 0x10(0x18)(ContainsInstancedReference, AssetRegistrySearchable, BlueprintCallable, NonPIEDuplicateTransient, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	bool                                         CallFunc_IsHovered_ReturnValue;                    // 0x28(0x1)(None)
	bool                                         CallFunc_NotEqual_StriStri_ReturnValue;            // 0x29(0x1)(None)
	uint8                                        Pad_4AED[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Temp_int_Loop_Counter_Variable;                    // 0x2C(0x4)(None)
	int32                                        CallFunc_Add_IntInt_ReturnValue;                   // 0x30(0x4)(None)
	uint8                                        Pad_4AEE[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                K2Node_ComponentBoundEvent_Option;                 // 0x38(0x10)(ContainsInstancedReference, BlueprintCallable, NonPIEDuplicateTransient, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate;              // 0x48(0x10)(Edit, ZeroConstructor)
	struct FCFCoreError                          K2Node_CustomEvent_error_1;                        // 0x58(0x38)(ContainsInstancedReference, SimpleDisplay, AdvancedDisplay, Protected, NonPIEDuplicateTransient, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	bool                                         Temp_bool_True_if_break_was_hit_Variable;          // 0x90(0x1)(None)
	bool                                         CallFunc_Not_PreBool_ReturnValue;                  // 0x91(0x1)(None)
	uint8                                        Pad_4AEF[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_1;            // 0x94(0x10)(Edit, ZeroConstructor)
	uint8                                        Pad_4AF0[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                CallFunc_Conv_TextToString_ReturnValue;            // 0xA8(0x10)(ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, Protected, NonPIEDuplicateTransient, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class UCFCoreSubsystem*                      CallFunc_GetEngineSubsystem_ReturnValue;           // 0xB8(0x8)(Edit, ZeroConstructor)
	struct FCFCoreError                          K2Node_CustomEvent_error;                          // 0xC0(0x38)(AutoWeak, AssetRegistrySearchable, SimpleDisplay, Protected, BlueprintCallable, NonPIEDuplicateTransient, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FReportingReason>              K2Node_CustomEvent_reasons;                        // 0xF8(0x10)(ContainsInstancedReference, AdvancedDisplay, Protected, NonPIEDuplicateTransient, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	struct FReportingReason                      CallFunc_Array_Get_Item;                           // 0x108(0x38)(AutoWeak, ContainsInstancedReference, SimpleDisplay, Protected, BlueprintCallable, NonPIEDuplicateTransient, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        CallFunc_Array_Length_ReturnValue;                 // 0x140(0x4)(None)
	bool                                         CallFunc_Less_IntInt_ReturnValue;                  // 0x144(0x1)(None)
	bool                                         CallFunc_BooleanAND_ReturnValue;                   // 0x145(0x1)(None)
	bool                                         CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x146(0x1)(None)
	uint8                                        Pad_4AF7[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_2;            // 0x148(0x10)(Edit, ZeroConstructor)
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate_3;            // 0x158(0x10)(Edit, ZeroConstructor)
	class UCFCoreSubsystem*                      CallFunc_GetEngineSubsystem_ReturnValue_1;         // 0x168(0x8)(None)
	bool                                         CallFunc_NotEqual_StriStri_ReturnValue_1;          // 0x170(0x1)(None)
	uint8                                        Pad_4AF9[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array;                            // 0x178(0x10)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, NonPIEDuplicateTransient, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class FText                                  CallFunc_Format_ReturnValue;                       // 0x188(0x18)(None)
	bool                                         CallFunc_EqualEqual_TextText_ReturnValue;          // 0x1A0(0x1)(None)
};

}
}


