#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x2B8 (0xA10 - 0x758)
// WidgetBlueprintGeneratedClass UI_ParentPage.UI_ParentPage_C
class UUI_ParentPage_C : public UPrimalUI
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x758(0x8)(ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                               Button_NextPage;                                   // 0x760(0x8)(Edit, ZeroConstructor)
	class UButton*                               Button_PrevPage;                                   // 0x768(0x8)(Edit, ZeroConstructor)
	class UButton*                               Button_UninstallAll;                               // 0x770(0x8)(Edit, ZeroConstructor)
	class UHorizontalBox*                        HorizontalBox_FilterBy;                            // 0x778(0x8)(Edit, ZeroConstructor)
	class UHorizontalBox*                        HorizontalBox_FilterByTime;                        // 0x780(0x8)(Edit, ZeroConstructor)
	class UImage*                                Image_194;                                         // 0x788(0x8)(Edit, ZeroConstructor)
	class UImage*                                IMG_NextPage;                                      // 0x790(0x8)(Edit, ZeroConstructor)
	class UImage*                                IMG_NoResultsBackground;                           // 0x798(0x8)(Edit, ZeroConstructor)
	class UImage*                                IMG_PrevPage;                                      // 0x7A0(0x8)(Edit, ZeroConstructor)
	class UMultiLineEditableTextBox*             MultiLineEditableTextBox;                          // 0x7A8(0x8)(Edit, ZeroConstructor)
	class UMultiLineEditableTextBox*             MultiLineEditableTextBox_1;                        // 0x7B0(0x8)(Edit, ZeroConstructor)
	class UVerticalBox*                          NO_MOD_PROJECT;                                    // 0x7B8(0x8)(Edit, ZeroConstructor)
	class UOverlay*                              Overlay_CategorySwap;                              // 0x7C0(0x8)(Edit, ZeroConstructor)
	class UProgressBar*                          ProgressBar_Loading;                               // 0x7C8(0x8)(Edit, ZeroConstructor)
	class UVerticalBox*                          SearchNotFound_ver;                                // 0x7D0(0x8)(Edit, ZeroConstructor)
	class USizeBox*                              SizeBox_4;                                         // 0x7D8(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            Text_ButtonMessage;                                // 0x7E0(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            TEXT_Filters;                                      // 0x7E8(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            TEXT_Pages;                                        // 0x7F0(0x8)(Edit, ZeroConstructor)
	class UTextBlock*                            TEXT_SearchModName;                                // 0x7F8(0x8)(Edit, ZeroConstructor)
	class UThrobber*                             Throbber_Loading;                                  // 0x800(0x8)(Edit, ZeroConstructor)
	class UUI_Button_Ark_Back_C*                 UI_Button_Ark_Back;                                // 0x808(0x8)(Edit, ZeroConstructor)
	class UUI_CategoriesSelect_C*                UI_CategoriesSelect;                               // 0x810(0x8)(Edit, ZeroConstructor)
	class UUI_ClassCategorySelect_C*             UI_ClassSelect;                                    // 0x818(0x8)(Edit, ZeroConstructor)
	class UUI_NoModsFound_C*                     UI_NoInstalledModsFound;                           // 0x820(0x8)(Edit, ZeroConstructor)
	class UUI_CustomComboBox_C*                  UI_SortBySelect;                                   // 0x828(0x8)(Edit, ZeroConstructor)
	class UUI_CustomComboBox_C*                  UI_TimeFilters;                                    // 0x830(0x8)(Edit, ZeroConstructor)
	class UUniformGridPanel*                     UniformGridPanel_GameSlots;                        // 0x838(0x8)(Edit, ZeroConstructor)
	class UWidgetSwitcher*                       WidgetSwitcher_Status;                             // 0x840(0x8)(Edit, ZeroConstructor)
	int32                                        Pages;                                             // 0x848(0x4)(None)
	int32                                        PageNum;                                           // 0x84C(0x4)(None)
	TArray<struct FSTRUCT_Categories>            Categories_Subcategories;                          // 0x850(0x10)(Protected, BlueprintAuthorityOnly, TextExportTransient, ExposeOnSpawn, NativeAccessSpecifierPrivate)
	class FString                                SelectedCategory;                                  // 0x860(0x10)(SimpleDisplay, AdvancedDisplay, BlueprintAuthorityOnly, TextExportTransient, ExposeOnSpawn, NativeAccessSpecifierPrivate)
	bool                                         IsSearchFound;                                     // 0x870(0x1)(None)
	enum class ECFCoreModsSearchSortField        SelectedSortByOption;                              // 0x871(0x1)(None)
	uint8                                        Pad_138B[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UUI_StoreMenu_C*                       UI_StoreMenu;                                      // 0x878(0x8)(ZeroConstructor)
	class FString                                CombinedAuthorsNames;                              // 0x880(0x10)(AutoWeak, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FModAuthor>                    AuthorsForCheck;                                   // 0x890(0x10)(ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FInstallProgressMod>           CurrentClassMods;                                  // 0x8A0(0x10)(ZeroConstructor, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, BlueprintAuthorityOnly, TextExportTransient, ExposeOnSpawn, NativeAccessSpecifierPrivate)
	int32                                        ModsPerPage;                                       // 0x8B0(0x4)(None)
	bool                                         IsPageLoaded;                                      // 0x8B4(0x1)(None)
	uint8                                        Pad_138E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CurrentSearchInput;                                // 0x8B8(0x18)(ContainsInstancedReference, SimpleDisplay, NonPIEDuplicateTransient, ExposeOnSpawn, NativeAccessSpecifierPrivate)
	bool                                         IsCurrentActiveWidget;                             // 0x8D0(0x1)(None)
	bool                                         IsClassCategoriesModAmountLocal;                   // 0x8D1(0x1)(None)
	uint8                                        Pad_1390[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ModsPerRow;                                        // 0x8D4(0x4)(None)
	class FText                                  PageTitle;                                         // 0x8D8(0x18)(ContainsInstancedReference, AssetRegistrySearchable, NonPIEDuplicateTransient, ExposeOnSpawn, NativeAccessSpecifierPrivate)
	bool                                         IsDownloading;                                     // 0x8F0(0x1)(None)
	uint8                                        Pad_1391[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                GameVersion;                                       // 0x8F8(0x10)(AssetRegistrySearchable, NonPIEDuplicateTransient, ExposeOnSpawn, NativeAccessSpecifierPrivate)
	class FString                                SearchFilter;                                      // 0x908(0x10)(ContainsInstancedReference, AdvancedDisplay, Protected, NonPIEDuplicateTransient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        TotalModsResult_Count;                             // 0x918(0x4)(None)
	enum class ENUM_TimeFilters                  Selected_Default_Option;                           // 0x91C(0x1)(None)
	uint8                                        Pad_1393[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class FString, class UTexture2DDynamic*> Images;                                            // 0x920(0x50)(ZeroConstructor, AssetRegistrySearchable, SimpleDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxImagesCached;                                   // 0x970(0x4)(None)
	uint8                                        Pad_1394[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<enum class ECFCoreModsSearchSortField> Array;                                             // 0x978(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<enum class EGameModsEvent>            Evts;                                              // 0x988(0x10)(ContainsInstancedReference, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FString>                        ThumbnailsRequested;                               // 0x998(0x10)(AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        ImageDownloadingRow;                               // 0x9A8(0x4)(None)
	uint8                                        Pad_1398[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FInstallProgressMod>           TrueModInfo;                                       // 0x9B0(0x10)(ZeroConstructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, Protected, NonPIEDuplicateTransient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FString, enum class ECFCoreModsSearchSortField> SortMap;                                           // 0x9C0(0x50)(None)

	static class UClass* StaticClass();
	static class UUI_ParentPage_C* GetDefaultObj();

	void GetClose_B(class UWidget* Widget);
	void GetVisibility_0(enum class ESlateVisibility ReturnValue, class UCFCoreUISubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsAnyModInstalling_ReturnValue, class UUI_ParentPage_C* CallFunc_GetCurrentActivePage_CurrentPage, enum class ENUM_SideTabs CallFunc_GetCurrentActivePage_CurrentActiveTab, bool Temp_bool_Variable, bool K2Node_SwitchEnum_CmpSuccess, enum class ESlateVisibility Temp_byte_Variable, enum class ESlateVisibility Temp_byte_Variable_1, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_Array_IsValidIndex_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, enum class ESlateVisibility K2Node_Select_Default);
