#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x2B (0x2B - 0x0)
// Function UI_RightClickMenu.UI_RightClickMenu_C.DecideWhichOptionsToDisplay
struct UUI_RightClickMenu_C_DecideWhichOptionsToDisplay_Params
{
public:
	bool                                         Temp_bool_Variable;                                // 0x0(0x1)(None)
	enum class ESlateVisibility                  Temp_byte_Variable;                                // 0x1(0x1)(None)
	enum class ESlateVisibility                  Temp_byte_Variable_1;                              // 0x2(0x1)(None)
	bool                                         Temp_bool_Variable_1;                              // 0x3(0x1)(None)
	bool                                         CallFunc_IsValid_ReturnValue;                      // 0x4(0x1)(None)
	enum class ESlateVisibility                  Temp_byte_Variable_2;                              // 0x5(0x1)(None)
	enum class ESlateVisibility                  Temp_byte_Variable_3;                              // 0x6(0x1)(None)
	bool                                         CallFunc_IsValid_ReturnValue_1;                    // 0x7(0x1)(None)
	bool                                         Temp_bool_Variable_2;                              // 0x8(0x1)(None)
	enum class ESlateVisibility                  Temp_byte_Variable_4;                              // 0x9(0x1)(None)
	enum class ESlateVisibility                  Temp_byte_Variable_5;                              // 0xA(0x1)(None)
	bool                                         CallFunc_IsValid_ReturnValue_2;                    // 0xB(0x1)(None)
	bool                                         CallFunc_IsValid_ReturnValue_3;                    // 0xC(0x1)(None)
	bool                                         CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0xD(0x1)(None)
	bool                                         CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0xE(0x1)(None)
	bool                                         CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0xF(0x1)(None)
	bool                                         CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x10(0x1)(None)
	bool                                         CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x11(0x1)(None)
	bool                                         CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x12(0x1)(None)
	bool                                         CallFunc_BooleanOR_ReturnValue;                    // 0x13(0x1)(None)
	bool                                         CallFunc_BooleanOR_ReturnValue_1;                  // 0x14(0x1)(None)
	enum class ESlateVisibility                  K2Node_Select_Default;                             // 0x15(0x1)(None)
	enum class ESlateVisibility                  K2Node_Select_Default_1;                           // 0x16(0x1)(None)
	bool                                         CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x17(0x1)(None)
	bool                                         CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x18(0x1)(None)
	bool                                         K2Node_SwitchEnum_CmpSuccess;                      // 0x19(0x1)(None)
	bool                                         CallFunc_BooleanOR_ReturnValue_2;                  // 0x1A(0x1)(None)
	bool                                         CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x1B(0x1)(None)
	enum class ESlateVisibility                  K2Node_Select_Default_2;                           // 0x1C(0x1)(None)
	bool                                         CallFunc_EqualEqual_ByteByte_ReturnValue_8;        // 0x1D(0x1)(None)
	bool                                         CallFunc_BooleanAND_ReturnValue;                   // 0x1E(0x1)(None)
	bool                                         CallFunc_IsValid_ReturnValue_4;                    // 0x1F(0x1)(None)
	bool                                         CallFunc_BooleanOR_ReturnValue_3;                  // 0x20(0x1)(None)
	bool                                         CallFunc_BooleanOR_ReturnValue_4;                  // 0x21(0x1)(None)
	enum class ESlateVisibility                  Temp_byte_Variable_6;                              // 0x22(0x1)(None)
	bool                                         CallFunc_EqualEqual_ByteByte_ReturnValue_9;        // 0x23(0x1)(None)
	bool                                         CallFunc_EqualEqual_ByteByte_ReturnValue_10;       // 0x24(0x1)(None)
	bool                                         CallFunc_BooleanOR_ReturnValue_5;                  // 0x25(0x1)(None)
	enum class ESlateVisibility                  Temp_byte_Variable_7;                              // 0x26(0x1)(None)
	bool                                         Temp_bool_Variable_3;                              // 0x27(0x1)(None)
	bool                                         CallFunc_IsValid_ReturnValue_5;                    // 0x28(0x1)(None)
	enum class ESlateVisibility                  K2Node_Select_Default_3;                           // 0x29(0x1)(None)
	bool                                         CallFunc_IsValid_ReturnValue_6;                    // 0x2A(0x1)(None)
};

// 0x1 (0x1 - 0x0)
// Function UI_RightClickMenu.UI_RightClickMenu_C.PreConstruct
struct UUI_RightClickMenu_C_PreConstruct_Params
{
public:
	bool                                         IsDesignTime;                                      // 0x0(0x1)(None)
};

// 0x38 (0x38 - 0x0)
// Function UI_RightClickMenu.UI_RightClickMenu_C.ExecuteUbergraph_UI_RightClickMenu
struct UUI_RightClickMenu_C_ExecuteUbergraph_UI_RightClickMenu_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(None)
	uint8                                        Pad_1177[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UUI_Prompt_Report_C*                   CallFunc_Create_ReturnValue;                       // 0x8(0x8)(Edit, ZeroConstructor)
	bool                                         CallFunc_IsValid_ReturnValue;                      // 0x10(0x1)(None)
	bool                                         CallFunc_IsValid_ReturnValue_1;                    // 0x11(0x1)(None)
	bool                                         CallFunc_IsValid_ReturnValue_2;                    // 0x12(0x1)(None)
	bool                                         Temp_bool_Variable;                                // 0x13(0x1)(None)
	enum class ESlateVisibility                  Temp_byte_Variable;                                // 0x14(0x1)(None)
	enum class ESlateVisibility                  Temp_byte_Variable_1;                              // 0x15(0x1)(None)
	bool                                         CallFunc_IsValid_ReturnValue_3;                    // 0x16(0x1)(None)
	bool                                         CallFunc_IsValid_ReturnValue_4;                    // 0x17(0x1)(None)
	bool                                         CallFunc_IsValid_ReturnValue_5;                    // 0x18(0x1)(None)
	bool                                         CallFunc_IsValid_ReturnValue_6;                    // 0x19(0x1)(None)
	bool                                         CallFunc_IsValid_ReturnValue_7;                    // 0x1A(0x1)(None)
	bool                                         CallFunc_IsValid_ReturnValue_8;                    // 0x1B(0x1)(None)
	bool                                         CallFunc_IsValid_ReturnValue_9;                    // 0x1C(0x1)(None)
	bool                                         CallFunc_IsValid_ReturnValue_10;                   // 0x1D(0x1)(None)
	bool                                         CallFunc_IsValid_ReturnValue_11;                   // 0x1E(0x1)(None)
	bool                                         CallFunc_IsValid_ReturnValue_12;                   // 0x1F(0x1)(None)
	class APlayerController*                     CallFunc_GetOwningPlayer_ReturnValue;              // 0x20(0x8)(None)
	bool                                         CallFunc_IsValid_ReturnValue_13;                   // 0x28(0x1)(None)
	bool                                         CallFunc_IsValid_ReturnValue_14;                   // 0x29(0x1)(None)
	bool                                         CallFunc_IsValid_ReturnValue_15;                   // 0x2A(0x1)(None)
	bool                                         CallFunc_IsValid_ReturnValue_16;                   // 0x2B(0x1)(None)
	bool                                         CallFunc_IsValid_ReturnValue_17;                   // 0x2C(0x1)(None)
	bool                                         K2Node_Event_IsDesignTime;                         // 0x2D(0x1)(None)
	enum class ESlateVisibility                  K2Node_Select_Default;                             // 0x2E(0x1)(None)
	bool                                         CallFunc_IsValid_ReturnValue_18;                   // 0x2F(0x1)(None)
	bool                                         CallFunc_IsValid_ReturnValue_19;                   // 0x30(0x1)(None)
	uint8                                        Pad_1178[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x34(0x4)(None)
};

}
}


