#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x70 (0x70 - 0x0)
// Function WeapFists.WeapFists_C.BPOverrideMeleeSwingSocket
struct AWeapFists_C_BPOverrideMeleeSwingSocket_Params
{
public:
	class FName                                  FromSocket;                                        // 0x0(0x8)(None)
	class FName                                  ReturnValue;                                       // 0x8(0x8)(None)
	bool                                         Temp_bool_Variable;                                // 0x10(0x1)(None)
	uint8                                        Pad_40B9[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                CallFunc_Conv_NameToString_ReturnValue;            // 0x18(0x10)(ContainsInstancedReference, AssetRegistrySearchable, AdvancedDisplay, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	class FName                                  CallFunc_MakeLiteralName_ReturnValue;              // 0x28(0x8)(None)
	class FString                                CallFunc_Conv_NameToString_ReturnValue_1;          // 0x30(0x10)(ContainsInstancedReference, AdvancedDisplay, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected)
	int32                                        CallFunc_Add_IntInt_ReturnValue;                   // 0x40(0x4)(None)
	uint8                                        Pad_40BB[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                CallFunc_Concat_StrStr_ReturnValue;                // 0x48(0x10)(None)
	int32                                        CallFunc_Percent_IntInt_ReturnValue;               // 0x58(0x4)(None)
	class FName                                  CallFunc_Conv_StringToName_ReturnValue;            // 0x5C(0x8)(None)
	bool                                         CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x64(0x1)(None)
	uint8                                        Pad_40BC[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  K2Node_Select_Default;                             // 0x68(0x8)(None)
};

}
}


